Repository: seanpm2001/python-docs-uk
Catalog: license.po
Languages: uk

source: History and License
uk: Історія та ліцензія

source: History of the software
uk: Історія програмного забезпечення

source: Python was created in the early 1990s by Guido van Rossum at Stichting Mathematisch Centrum (CWI, see https://www.cwi.nl/) in the Netherlands as a successor of a language called ABC. Guido remains Python's principal author, although it includes many contributions from others.
uk: Python створив на початку 1990-х років Guido van Rossum у Stichting Mathematisch Centrum (CWI, див. https://www.cwi.nl/) у Нідерландах, як наступник мови під назвою ABC. Гвідо залишається головним автором Python, хоча є багато внесків інших людей.

source: In 1995, Guido continued his work on Python at the Corporation for National Research Initiatives (CNRI, see https://www.cnri.reston.va.us/) in Reston, Virginia where he released several versions of the software.
uk: У 1995 році Гвідо продовжив роботу над Python у Корпорації національних дослідницьких ініціатив (CNRI, див. https://www.cnri.reston.va.us/) у Рестоні, штат Вірджинія, де він випустив кілька версій програмного забезпечення.

source: In May 2000, Guido and the Python core development team moved to BeOpen.com to form the BeOpen PythonLabs team. In October of the same year, the PythonLabs team moved to Digital Creations (now Zope Corporation; see https://www.zope.org/). In 2001, the Python Software Foundation (PSF, see https://www.python.org/psf/) was formed, a non-profit organization created specifically to own Python-related Intellectual Property. Zope Corporation is a sponsoring member of the PSF.
uk: У травні 2000 року Гвідо та команда розробників ядра Python переїхали на BeOpen.com, щоб створити команду BeOpen PythonLabs. У жовтні того ж року команда PythonLabs перейшла до Digital Creations (нині Zope Corporation; див. https://www.zope.org/). У 2001 році було створено Python Software Foundation (PSF, див. https://www.python.org/psf/), некомерційну організацію, створену спеціально для володіння інтелектуальною власністю, пов’язаною з Python. Корпорація Zope є членом-спонсором PSF.

source: All Python releases are Open Source (see https://opensource.org/ for the Open Source Definition). Historically, most, but not all, Python releases have also been GPL-compatible; the table below summarizes the various releases.
uk: Усі випуски Python є відкритими (визначення відкритого вихідного коду див. на https://opensource.org/). Історично більшість, але не всі випуски Python також були GPL-сумісними; таблиця нижче підсумовує різні випуски.

source: Release
uk: Реліз

source: Derived from
uk: Походить з

source: Year
uk: Рік

source: Owner
uk: Власник

source: GPL compatible?
uk: GPL сумісний?

source: 0.9.0 thru 1.2
uk: з 0.9.0 до 1.2

source: n/a
uk: н/в

source: yes
uk: так

source: 1.3 thru 1.5.2
uk: з 1.3 по 1.5.2

source: no
uk: ні

source: 2.2 and above
uk: 2.2 і вище

source: 2001-now
uk: 2001-дотепер

source: GPL-compatible doesn't mean that we're distributing Python under the GPL. All Python licenses, unlike the GPL, let you distribute a modified version without making your changes open source. The GPL-compatible licenses make it possible to combine Python with other software that is released under the GPL; the others don't.
uk: GPL-сумісність не означає, що ми розповсюджуємо Python під GPL. Усі ліцензії Python, на відміну від GPL, дозволяють розповсюджувати модифіковану версію без створення змін у відкритому коді. Ліцензії, сумісні з GPL, дають змогу поєднувати Python з іншим програмним забезпеченням, яке випускається під GPL; інші ні.

source: Thanks to the many outside volunteers who have worked under Guido's direction to make these releases possible.
uk: Дякуємо багатьом зовнішнім волонтерам, які працювали під керівництвом Гвідо, щоб зробити ці випуски можливими.

source: Terms and conditions for accessing or otherwise using Python
uk: Умови доступу або іншого використання Python

source: Python software and documentation are licensed under the :ref:`PSF License Agreement <PSF-license>`.
uk: Програмне забезпечення та документація Python надаються згідно з :ref:`Ліцензійною угодою PSF <PSF-license>`.

source: Starting with Python 3.8.6, examples, recipes, and other code in the documentation are dual licensed under the PSF License Agreement and the :ref:`Zero-Clause BSD license <BSD0>`.
uk: Починаючи з Python 3.8.6, приклади, посібники та інший код у документації мають подвійну ліцензію згідно з Ліцензійною угодою PSF і :ref:`ліцензією Zero-Clause BSD <BSD0>`.

source: Some software incorporated into Python is under different licenses. The licenses are listed with code falling under that license. See :ref:`OtherLicenses` for an incomplete list of these licenses.
uk: Деякі програми, інтегровані в Python, знаходяться під іншими ліцензіями. Ліцензії перераховані з кодом, що підпадає під цю ліцензію. Перегляньте :ref:`OtherLicenses` для неповного списку цих ліцензій.

source: PSF LICENSE AGREEMENT FOR PYTHON |release|
uk: ЛІЦЕНЗІЙНА УГОДА PSF ДЛЯ |release| PYTHON

source: BEOPEN.COM LICENSE AGREEMENT FOR PYTHON 2.0
uk: ЛІЦЕНЗІЙНА УГОДА BEOPEN.COM ДЛЯ PYTHON 2.0

source: BEOPEN PYTHON OPEN SOURCE LICENSE AGREEMENT VERSION 1
uk: ЛІЦЕНЗІЙНА УГОДА BEOPEN PYTHON ВЕРСІЯ 1

source: CNRI LICENSE AGREEMENT FOR PYTHON 1.6.1
uk: ЛІЦЕНЗІЙНА УГОДА CNRI ДЛЯ PYTHON 1.6.1

source: CWI LICENSE AGREEMENT FOR PYTHON 0.9.0 THROUGH 1.2
uk: ЛІЦЕНЗІЙНА УГОДА CWI ДЛЯ PYTHON 0.9.0 ЧЕРЗ 1.2

source: ZERO-CLAUSE BSD LICENSE FOR CODE IN THE PYTHON |release| DOCUMENTATION
uk: ЛІЦЕНЗІЯ BSD БЕЗ ЗАСТЕРЕЖЕНЬ ДЛЯ КОДУ В PYTHON |release| ДОКУМЕНТАЦІЯ

source: Licenses and Acknowledgements for Incorporated Software
uk: Ліцензії та підтвердження для вбудованого програмного забезпечення

source: This section is an incomplete, but growing list of licenses and acknowledgements for third-party software incorporated in the Python distribution.
uk: Цей розділ є неповним, але постійно зростаючим списком ліцензій і підтверджень стороннього програмного забезпечення, включеного в дистрибутив Python.

source: The :mod:`_random` module includes code based on a download from http://www.math.sci.hiroshima-u.ac.jp/~m-mat/MT/MT2002/emt19937ar.html. The following are the verbatim comments from the original code::
uk: Модуль :mod:`_random` включає код, заснований на завантаженні з http://www.math.sci.hiroshima-u.ac.jp/~m-mat/MT/MT2002/emt19937ar.html. Нижче наведено дослівні коментарі з оригінального коду:

source: Sockets
uk: Сокети

source: Asynchronous socket services
uk: Сервіси асинхронних сокетів

source: The :mod:`asynchat` and :mod:`asyncore` modules contain the following notice::
uk: Модулі :mod:`asynchat` і :mod:`asyncore` містять таке застереження:

source: Cookie management
uk: Керування файлами cookie

source: The :mod:`http.cookies` module contains the following notice::
uk: Модуль :mod:`http.cookies` містить таке повідомлення:

source: Execution tracing
uk: Відстеження виконання

source: The :mod:`trace` module contains the following notice::
uk: Модуль :mod:`trace` містить таке застереження:

source: UUencode and UUdecode functions
uk: Функції UUencode та UUdecode

source: The :mod:`uu` module contains the following notice::
uk: Модуль :mod:`uu` містить таке застереження:

source: XML Remote Procedure Calls
uk: Виклики віддалених процедур XML

source: The :mod:`xmlrpc.client` module contains the following notice::
uk: Модуль :mod:`xmlrpc.client` містить таке застереження:

source: The :mod:`test_epoll` module contains the following notice::
uk: Модуль :mod:`test_epoll` містить таке застереження:

source: Select kqueue
uk: Виберіть kqueue

source: The :mod:`select` module contains the following notice for the kqueue interface::
uk: Модуль :mod:`select` містить таке застереження для інтерфейсу kqueue:

source: The file :file:`Python/pyhash.c` contains Marek Majkowski' implementation of Dan Bernstein's SipHash24 algorithm. It contains the following note::
uk: Файл :file:`Python/pyhash.c` містить реалізацію Мареком Майковським алгоритму SipHash24 Дена Бернштейна. Він містить таку примітку:

source: strtod and dtoa
uk: strtod і dtoa

source: The modules :mod:`hashlib`, :mod:`posix`, :mod:`ssl`, :mod:`crypt` use the OpenSSL library for added performance if made available by the operating system. Additionally, the Windows and macOS installers for Python may include a copy of the OpenSSL libraries, so we include a copy of the OpenSSL license here::
uk: Модулі :mod:`hashlib`, :mod:`posix`, :mod:`ssl`, :mod:`crypt` використовують бібліотеку OpenSSL для підвищення продуктивності, якщо вона доступна операційною системою. Крім того, інсталятори Windows і macOS для Python можуть містити копію бібліотек OpenSSL, тому ми додаємо копію ліцензії OpenSSL тут:

source: The :mod:`pyexpat` extension is built using an included copy of the expat sources unless the build is configured ``--with-system-expat``::
uk: Розширення :mod:`pyexpat` створено з використанням включеної копії вихідних кодів експату, якщо збірка не налаштована ``--with-system-expat``::

source: The :mod:`_ctypes` extension is built using an included copy of the libffi sources unless the build is configured ``--with-system-libffi``::
uk: Розширення :mod:`_ctypes` створено з використанням включеної копії вихідних кодів libffi, якщо збірка не налаштована ``--with-system-libffi``::

source: The :mod:`zlib` extension is built using an included copy of the zlib sources if the zlib version found on the system is too old to be used for the build::
uk: Розширення :mod:`zlib` створюється з використанням включеної копії вихідних кодів zlib, якщо версія zlib, знайдена в системі, надто стара, щоб використовувати її для збірки::

source: The implementation of the hash table used by the :mod:`tracemalloc` is based on the cfuhash project::
uk: Реалізація хеш-таблиці, яку використовує :mod:`tracemalloc`, базується на проекті cfuhash::

source: The :mod:`_decimal` module is built using an included copy of the libmpdec library unless the build is configured ``--with-system-libmpdec``::
uk: Модуль :mod:`_decimal` створено з використанням включеної копії бібліотеки libmpdec, якщо збірка не налаштована ``--with-system-libmpdec``::

source: W3C C14N test suite
uk: Набір тестів W3C C14N

source: The C14N 2.0 test suite in the :mod:`test` package (``Lib/test/xmltestdata/c14n-20/``) was retrieved from the W3C website at https://www.w3.org/TR/xml-c14n2-testcases/ and is distributed under the 3-clause BSD license::
uk: Набір тестів C14N 2.0 у пакеті :mod:`test` (``Lib/test/xmltestdata/c14n-20/``) було отримано з веб-сайту W3C за адресою https://www.w3.org/TR/xml-c14n2-testcases/ і розповсюджується за ліцензією BSD із трьох пунктів:
