Repository: seanpm2001/python-docs-uk
Catalog: reference/datamodel.po
Languages: uk

source: Classes are callable. These objects normally act as factories for new instances of themselves, but variations are possible for class types that override :meth:`~object.__new__`. The arguments of the call are passed to :meth:`__new__` and, in the typical case, to :meth:`~object.__init__` to initialize the new instance.
uk: Заняття викликні. Ці об’єкти зазвичай діють як фабрики для нових екземплярів самих себе, але можливі варіанти для типів класів, які перевизначають :meth:`~object.__new__`. Аргументи виклику передаються до :meth:`__new__` і, у типовому випадку, до :meth:`~object.__init__` для ініціалізації нового екземпляра.

source: Class Instances
uk: Екземпляри класу

source: Instances of arbitrary classes can be made callable by defining a :meth:`~object.__call__` method in their class.
uk: Екземпляри довільних класів можна зробити викликаними, визначивши метод :meth:`~object.__call__` у їхньому класі.

source: Modules
uk: Модулі

source: Modules are a basic organizational unit of Python code, and are created by the :ref:`import system <importsystem>` as invoked either by the :keyword:`import` statement, or by calling functions such as :func:`importlib.import_module` and built-in :func:`__import__`. A module object has a namespace implemented by a dictionary object (this is the dictionary referenced by the ``__globals__`` attribute of functions defined in the module). Attribute references are translated to lookups in this dictionary, e.g., ``m.x`` is equivalent to ``m.__dict__["x"]``. A module object does not contain the code object used to initialize the module (since it isn't needed once the initialization is done).
uk: Модулі є основною організаційною одиницею коду Python і створюються :ref:`системою імпорту <importsystem>`, яка викликається оператором :keyword:`import` або викликом функцій, таких як :func:`importlib.import_module` і вбудований :func:`__import__`. Об’єкт модуля має простір імен, реалізований об’єктом словника (це словник, на який посилається атрибут ``__globals__`` функцій, визначених у модулі). Посилання на атрибути перекладено на пошуки в цьому словнику, наприклад, ``m.x`` еквівалентно ``m.__dict__["x"]``. Об’єкт модуля не містить об’єкт коду, який використовується для ініціалізації модуля (оскільки він не потрібен після завершення ініціалізації).

source: Attribute assignment updates the module's namespace dictionary, e.g., ``m.x = 1`` is equivalent to ``m.__dict__["x"] = 1``.
uk: Призначення атрибутів оновлює словник простору імен модуля, наприклад, ``m.x = 1`` еквівалентно ``m.__dict__["x"] = 1``.

source: Predefined (writable) attributes:
uk: Попередньо визначені (записувані) атрибути:

source: The module's name.
uk: Назва модуля.

source: The module's documentation string, or ``None`` if unavailable.
uk: Рядок документації модуля або ``None``, якщо він недоступний.

source: The pathname of the file from which the module was loaded, if it was loaded from a file. The :attr:`__file__` attribute may be missing for certain types of modules, such as C modules that are statically linked into the interpreter. For extension modules loaded dynamically from a shared library, it's the pathname of the shared library file.
uk: Шлях до файлу, з якого було завантажено модуль, якщо він був завантажений із файлу. Атрибут :attr:`__file__` може бути відсутнім для певних типів модулів, таких як модулі C, які статично пов’язані з інтерпретатором. Для модулів розширення, які динамічно завантажуються зі спільної бібліотеки, це шлях до файлу спільної бібліотеки.

source: A dictionary containing :term:`variable annotations <variable annotation>` collected during module body execution. For best practices on working with :attr:`__annotations__`, please see :ref:`annotations-howto`.
uk: Словник, що містить :term:`анотації змінних <variable annotation>`, зібрані під час виконання тіла модуля. Найкращі методи роботи з :attr:`__annotations__` див. :ref:`annotations-howto`.

source: Special read-only attribute: :attr:`~object.__dict__` is the module's namespace as a dictionary object.
uk: Спеціальний атрибут лише для читання: :attr:`~object.__dict__` — це простір імен модуля як об’єкт словника.

source: Because of the way CPython clears module dictionaries, the module dictionary will be cleared when the module falls out of scope even if the dictionary still has live references. To avoid this, copy the dictionary or keep the module around while using its dictionary directly.
uk: Через те, як CPython очищає словники модулів, словник модуля буде очищено, коли модуль виходить із області видимості, навіть якщо в словнику все ще є живі посилання. Щоб уникнути цього, скопіюйте словник або збережіть модуль, використовуючи його словник безпосередньо.

source: Custom classes
uk: Спеціальні заняття

source: Custom class types are typically created by class definitions (see section :ref:`class`). A class has a namespace implemented by a dictionary object. Class attribute references are translated to lookups in this dictionary, e.g., ``C.x`` is translated to ``C.__dict__["x"]`` (although there are a number of hooks which allow for other means of locating attributes). When the attribute name is not found there, the attribute search continues in the base classes. This search of the base classes uses the C3 method resolution order which behaves correctly even in the presence of 'diamond' inheritance structures where there are multiple inheritance paths leading back to a common ancestor. Additional details on the C3 MRO used by Python can be found in the documentation accompanying the 2.3 release at https://www.python.org/download/releases/2.3/mro/.
uk: Спеціальні типи класів зазвичай створюються визначеннями класів (див. розділ :ref:`class`). Клас має простір імен, реалізований об’єктом словника. Посилання на атрибути класу перекладаються на пошуки в цьому словнику, наприклад, ``C.x`` перекладається на ``C.__dict__["x"]`` (хоча є ряд хуків, які дозволяють інші способи пошуку атрибутів) . Якщо ім'я атрибута там не знайдено, пошук атрибута продовжується в базових класах. Цей пошук базових класів використовує порядок розв’язання методів C3, який поводиться правильно навіть за наявності "діамантових" структур успадкування, де є кілька шляхів успадкування, що ведуть до спільного предка. Додаткову інформацію про C3 MRO, який використовує Python, можна знайти в документації, що супроводжує випуск 2.3, за адресою https://www.python.org/download/releases/2.3/mro/.

source: When a class attribute reference (for class :class:`C`, say) would yield a class method object, it is transformed into an instance method object whose :attr:`__self__` attribute is :class:`C`. When it would yield a static method object, it is transformed into the object wrapped by the static method object. See section :ref:`descriptors` for another way in which attributes retrieved from a class may differ from those actually contained in its :attr:`~object.__dict__`.
uk: Коли посилання на атрибут класу (наприклад, для класу :class:`C`) дає об’єкт методу класу, воно перетворюється на об’єкт методу екземпляра, чий атрибут :attr:`__self__` є :class:`C`. Коли він дає об’єкт статичного методу, він перетворюється на об’єкт, обгорнутий об’єктом статичного методу. Перегляньте розділ :ref:`descriptors` щодо іншого способу, яким атрибути, отримані з класу, можуть відрізнятися від тих, що насправді містяться в його :attr:`~object.__dict__`.

source: Class attribute assignments update the class's dictionary, never the dictionary of a base class.
uk: Призначення атрибутів класу оновлює словник класу, а не словник базового класу.

source: A class object can be called (see above) to yield a class instance (see below).
uk: Об’єкт класу можна викликати (див. вище), щоб створити екземпляр класу (див. нижче).

source: The class name.
uk: Назва класу.

source: The name of the module in which the class was defined.
uk: Ім'я модуля, в якому було визначено клас.

source: The dictionary containing the class's namespace.
uk: Словник, що містить простір імен класу.

source: A tuple containing the base classes, in the order of their occurrence in the base class list.
uk: Кортеж, що містить базові класи в порядку їх появи в списку базових класів.

source: The class's documentation string, or ``None`` if undefined.
uk: Рядок документації класу або ``None``, якщо не визначено.

source: A dictionary containing :term:`variable annotations <variable annotation>` collected during class body execution. For best practices on working with :attr:`__annotations__`, please see :ref:`annotations-howto`.
uk: Словник, що містить :term:`анотації змінних <variable annotation>`, зібрані під час виконання тіла класу. Найкращі методи роботи з :attr:`__annotations__` див. :ref:`annotations-howto`.

source: Class instances
uk: Екземпляри класу

source: A class instance is created by calling a class object (see above). A class instance has a namespace implemented as a dictionary which is the first place in which attribute references are searched. When an attribute is not found there, and the instance's class has an attribute by that name, the search continues with the class attributes. If a class attribute is found that is a user-defined function object, it is transformed into an instance method object whose :attr:`__self__` attribute is the instance. Static method and class method objects are also transformed; see above under "Classes". See section :ref:`descriptors` for another way in which attributes of a class retrieved via its instances may differ from the objects actually stored in the class's :attr:`~object.__dict__`. If no class attribute is found, and the object's class has a :meth:`~object.__getattr__` method, that is called to satisfy the lookup.
uk: Екземпляр класу створюється шляхом виклику об’єкта класу (див. вище). Екземпляр класу має простір імен, реалізований як словник, який є першим місцем, у якому здійснюється пошук посилань на атрибути. Якщо атрибут там не знайдено, а клас екземпляра має атрибут із таким іменем, пошук продовжується з атрибутами класу. Якщо знайдено атрибут класу, який є визначеним користувачем об’єктом функції, він перетворюється на об’єкт методу екземпляра, атрибут :attr:`__self__` якого є екземпляром. Статичний метод і об’єкти методу класу також трансформуються; див. вище в розділі "Класи". Перегляньте розділ :ref:`descriptors` щодо іншого способу, яким атрибути класу, отримані через його екземпляри, можуть відрізнятися від об’єктів, які насправді зберігаються в :attr:`~object.__dict__` класу. Якщо атрибут класу не знайдено, а клас об’єкта має метод :meth:`~object.__getattr__`, який викликається для виконання пошуку.

source: Attribute assignments and deletions update the instance's dictionary, never a class's dictionary. If the class has a :meth:`~object.__setattr__` or :meth:`~object.__delattr__` method, this is called instead of updating the instance dictionary directly.
uk: Призначення та видалення атрибутів оновлюють словник екземпляра, а не словник класу. Якщо клас має метод :meth:`~object.__setattr__` або :meth:`~object.__delattr__`, він викликається замість безпосереднього оновлення словника примірника.

source: Class instances can pretend to be numbers, sequences, or mappings if they have methods with certain special names. See section :ref:`specialnames`.
uk: Екземпляри класу можуть видавати себе за числа, послідовності або відображення, якщо вони мають методи з певними спеціальними назвами. Дивіться розділ :ref:`specialnames`.

source: Special attributes: :attr:`~object.__dict__` is the attribute dictionary; :attr:`~instance.__class__` is the instance's class.
uk: Спеціальні атрибути: :attr:`~object.__dict__` — це словник атрибутів; :attr:`~instance.__class__` є класом екземпляра.

source: I/O objects (also known as file objects)
uk: Об’єкти введення-виведення (також відомі як файлові об’єкти)

source: A :term:`file object` represents an open file. Various shortcuts are available to create file objects: the :func:`open` built-in function, and also :func:`os.popen`, :func:`os.fdopen`, and the :meth:`~socket.socket.makefile` method of socket objects (and perhaps by other functions or methods provided by extension modules).
uk: :term:`file object` представляє відкритий файл. Для створення файлових об’єктів доступні різні ярлики: вбудована функція :func:`open`, а також :func:`os.popen`, :func:`os.fdopen` і :meth:`~socket. socket.makefile` метод об’єктів сокета (і, можливо, за допомогою інших функцій або методів, наданих модулями розширення).

source: The objects ``sys.stdin``, ``sys.stdout`` and ``sys.stderr`` are initialized to file objects corresponding to the interpreter's standard input, output and error streams; they are all open in text mode and therefore follow the interface defined by the :class:`io.TextIOBase` abstract class.
uk: Об'єкти ``sys.stdin``, ``sys.stdout`` і ``sys.stderr`` ініціалізуються об'єктами файлів, що відповідають стандартним потокам введення, виведення та помилок інтерпретатора; усі вони відкриті в текстовому режимі, тому відповідають інтерфейсу, визначеному :class:`io.TextIOBase` абстрактним класом.

source: Internal types
uk: Внутрішні типи

source: A few types used internally by the interpreter are exposed to the user. Their definitions may change with future versions of the interpreter, but they are mentioned here for completeness.
uk: Кілька типів, які використовуються внутрішньо інтерпретатором, доступні користувачеві. Їх визначення можуть змінюватися в майбутніх версіях інтерпретатора, але вони згадуються тут для повноти.

source: Code objects
uk: Об'єкти коду

source: Code objects represent *byte-compiled* executable Python code, or :term:`bytecode`. The difference between a code object and a function object is that the function object contains an explicit reference to the function's globals (the module in which it was defined), while a code object contains no context; also the default argument values are stored in the function object, not in the code object (because they represent values calculated at run-time). Unlike function objects, code objects are immutable and contain no references (directly or indirectly) to mutable objects.
uk: Об’єкти коду представляють *байт-скомпільований* виконуваний код Python або :term:`bytecode`. Різниця між об’єктом коду та об’єктом функції полягає в тому, що об’єкт функції містить явне посилання на глобальні елементи функції (модуль, у якому вона була визначена), тоді як об’єкт коду не містить контексту; також значення аргументів за замовчуванням зберігаються в об’єкті функції, а не в об’єкті коду (оскільки вони представляють значення, обчислені під час виконання). На відміну від функціональних об’єктів, об’єкти коду є незмінними і не містять посилань (прямих чи опосередкованих) на змінні об’єкти.

source: The following flag bits are defined for :attr:`co_flags`: bit ``0x04`` is set if the function uses the ``*arguments`` syntax to accept an arbitrary number of positional arguments; bit ``0x08`` is set if the function uses the ``**keywords`` syntax to accept arbitrary keyword arguments; bit ``0x20`` is set if the function is a generator.
uk: Для :attr:`co_flags` визначено такі біти прапорів: біт ``0x04`` встановлюється, якщо функція використовує синтаксис ``*arguments`` для прийняття довільної кількості позиційних аргументів; біт ``0x08`` встановлено, якщо функція використовує синтаксис ``**keywords`` для прийняття довільних ключових аргументів; біт ``0x20`` встановлено, якщо функція є генератором.

source: Future feature declarations (``from __future__ import division``) also use bits in :attr:`co_flags` to indicate whether a code object was compiled with a particular feature enabled: bit ``0x2000`` is set if the function was compiled with future division enabled; bits ``0x10`` and ``0x1000`` were used in earlier versions of Python.
uk: Оголошення майбутніх функцій (``from __future__ import division``) також використовують біти в :attr:`co_flags`, щоб вказати, чи був об’єкт коду скомпільовано з певною функцією: біт ``0x2000`` встановлюється, якщо функція була скомпільована з увімкненим майбутнім поділом; біти ``0x10`` і ``0x1000`` використовувалися в попередніх версіях Python.

source: Other bits in :attr:`co_flags` are reserved for internal use.
uk: Інші біти в :attr:`co_flags` зарезервовані для внутрішнього використання.

source: If a code object represents a function, the first item in :attr:`co_consts` is the documentation string of the function, or ``None`` if undefined.
uk: Якщо об’єкт коду представляє функцію, перший елемент у :attr:`co_conts` — це рядок документації функції або ``None``, якщо не визначено.

source: Frame objects
uk: Рамкові об'єкти

source: Frame objects represent execution frames. They may occur in traceback objects (see below), and are also passed to registered trace functions.
uk: Об’єкти фрейму представляють кадри виконання. Вони можуть виникнути в об’єктах трасування (див. нижче), а також передаються зареєстрованим функціям трасування.

source: Special read-only attributes: :attr:`f_back` is to the previous stack frame (towards the caller), or ``None`` if this is the bottom stack frame; :attr:`f_code` is the code object being executed in this frame; :attr:`f_locals` is the dictionary used to look up local variables; :attr:`f_globals` is used for global variables; :attr:`f_builtins` is used for built-in (intrinsic) names; :attr:`f_lasti` gives the precise instruction (this is an index into the bytecode string of the code object).
uk: Спеціальні атрибути лише для читання: :attr:`f_back` до попереднього фрейму стека (до абонента), або ``None``, якщо це нижній фрейм стека; :attr:`f_code` - об'єкт коду, який виконується в цьому кадрі; :attr:`f_locals` - це словник, який використовується для пошуку локальних змінних; :attr:`f_globals` використовується для глобальних змінних; :attr:`f_builtins` використовується для вбудованих (внутрішніх) імен; :attr:`f_lasti` дає точну інструкцію (це індекс у рядку байт-коду об’єкта коду).

source: Accessing ``f_code`` raises an :ref:`auditing event <auditing>` ``object.__getattr__`` with arguments ``obj`` and ``"f_code"``.
uk: Доступ до ``f_code`` викликає :ref:`подію аудиту <auditing>` ``object.__getattr__`` з аргументами ``obj`` і ``"f_code"``.

source: Special writable attributes: :attr:`f_trace`, if not ``None``, is a function called for various events during code execution (this is used by the debugger). Normally an event is triggered for each new source line - this can be disabled by setting :attr:`f_trace_lines` to :const:`False`.
uk: Спеціальні атрибути, доступні для запису: :attr:`f_trace`, якщо не ``None``, це функція, яка викликається для різних подій під час виконання коду (вона використовується налагоджувачем). Зазвичай подія запускається для кожного нового вихідного рядка - це можна вимкнути, встановивши :attr:`f_trace_lines` на :const:`False`.

source: Implementations *may* allow per-opcode events to be requested by setting :attr:`f_trace_opcodes` to :const:`True`. Note that this may lead to undefined interpreter behaviour if exceptions raised by the trace function escape to the function being traced.
uk: Реалізації *можуть* дозволити надсилати запит на події кожного коду операції, встановивши для :attr:`f_trace_opcodes` значення :const:`True`. Зауважте, що це може призвести до невизначеної поведінки інтерпретатора, якщо винятки, викликані функцією трасування, переходять до функції, що трасується.

source: :attr:`f_lineno` is the current line number of the frame --- writing to this from within a trace function jumps to the given line (only for the bottom-most frame). A debugger can implement a Jump command (aka Set Next Statement) by writing to f_lineno.
uk: :attr:`f_lineno` — поточний номер рядка кадру --- запис у нього з функції трасування переходить до заданого рядка (лише для самого нижнього кадру). Налагоджувач може реалізувати команду Jump (така ж Set Next Statement), записавши f_lineno.

source: Frame objects support one method:
uk: Об’єкти фрейму підтримують один метод:

source: This method clears all references to local variables held by the frame. Also, if the frame belonged to a generator, the generator is finalized. This helps break reference cycles involving frame objects (for example when catching an exception and storing its traceback for later use).
uk: Цей метод очищає всі посилання на локальні змінні, які містяться у кадрі. Крім того, якщо кадр належав генератору, генератор завершується. Це допомагає розірвати цикли посилань, пов’язані з об’єктами фрейму (наприклад, під час перехоплення винятку та збереження його трасування для подальшого використання).

source: :exc:`RuntimeError` is raised if the frame is currently executing.
uk: :exc:`RuntimeError` виникає, якщо кадр зараз виконується.

source: Traceback objects
uk: Об'єкти відстеження

source: Traceback objects represent a stack trace of an exception. A traceback object is implicitly created when an exception occurs, and may also be explicitly created by calling :class:`types.TracebackType`.
uk: Об'єкти Traceback представляють трасування стека виняткової ситуації. Об’єкт трасування неявно створюється, коли виникає виняткова ситуація, а також може бути явно створений викликом :class:`types.TracebackType`.

source: For implicitly created tracebacks, when the search for an exception handler unwinds the execution stack, at each unwound level a traceback object is inserted in front of the current traceback. When an exception handler is entered, the stack trace is made available to the program. (See section :ref:`try`.) It is accessible as the third item of the tuple returned by ``sys.exc_info()``, and as the ``__traceback__`` attribute of the caught exception.
uk: Для неявно створених трасування, коли пошук обробника винятків розгортає стек виконання, на кожному розкрученому рівні об’єкт трасування вставляється перед поточним трасуванням. Коли вводиться обробник винятків, трасування стека стає доступним для програми. (Див. розділ :ref:`try`.) Він доступний як третій елемент кортежу, який повертає ``sys.exc_info()``, і як атрибут ``__traceback__`` перехопленого винятку.

source: When the program contains no suitable handler, the stack trace is written (nicely formatted) to the standard error stream; if the interpreter is interactive, it is also made available to the user as ``sys.last_traceback``.
uk: Якщо програма не містить відповідного обробника, трасування стека записується (добре відформатована) у стандартний потік помилок; якщо інтерпретатор є інтерактивним, він також стає доступним для користувача як ``sys.last_traceback``.

source: For explicitly created tracebacks, it is up to the creator of the traceback to determine how the ``tb_next`` attributes should be linked to form a full stack trace.
uk: Для явно створених зворотних трасувань автор повинен визначити, як атрибути ``tb_next`` повинні бути пов’язані, щоб сформувати повну трасування стека.

source: Special read-only attributes: :attr:`tb_frame` points to the execution frame of the current level; :attr:`tb_lineno` gives the line number where the exception occurred; :attr:`tb_lasti` indicates the precise instruction. The line number and last instruction in the traceback may differ from the line number of its frame object if the exception occurred in a :keyword:`try` statement with no matching except clause or with a finally clause.
uk: Спеціальні атрибути лише для читання: :attr:`tb_frame` вказує на кадр виконання поточного рівня; :attr:`tb_lineno` вказує номер рядка, де сталася виняток; :attr:`tb_lasti` вказує на точну інструкцію. Номер рядка та остання інструкція в трасуванні можуть відрізнятися від номера рядка його об’єкта фрейму, якщо виняток стався в операторі :keyword:`try` без відповідного пункту крім або з пунктом finally.
