Repository: seanpm2001/python-docs-uk
Catalog: reference/datamodel.po
Languages: uk

source: This class object is the one that will be referenced by the zero-argument form of :func:`super`. ``__class__`` is an implicit closure reference created by the compiler if any methods in a class body refer to either ``__class__`` or ``super``. This allows the zero argument form of :func:`super` to correctly identify the class being defined based on lexical scoping, while the class or instance that was used to make the current call is identified based on the first argument passed to the method.
uk: Цей об’єкт класу є тим, на який посилатиметься форма :func:`super` з нульовим аргументом. ``__class__`` — це неявне посилання на закриття, створене компілятором, якщо будь-які методи в тілі класу посилаються на ``__class__`` або ``super``. Це дозволяє формі нульового аргументу :func:`super` правильно ідентифікувати клас, який визначається на основі лексичного визначення, тоді як клас або екземпляр, який використовувався для здійснення поточного виклику, ідентифікується на основі першого аргументу, переданого методу.

source: In CPython 3.6 and later, the ``__class__`` cell is passed to the metaclass as a ``__classcell__`` entry in the class namespace. If present, this must be propagated up to the ``type.__new__`` call in order for the class to be initialised correctly. Failing to do so will result in a :exc:`RuntimeError` in Python 3.8.
uk: У CPython 3.6 і пізніших версіях клітинка ``__class__`` передається метакласу як запис ``__classcell__`` у просторі імен класу. Якщо є, це має бути передано до виклику ``type.__new__`` для правильної ініціалізації класу. Якщо цього не зробити, у Python 3.8 виникне :exc:`RuntimeError`.

source: When using the default metaclass :class:`type`, or any metaclass that ultimately calls ``type.__new__``, the following additional customization steps are invoked after creating the class object:
uk: При використанні метакласу за замовчуванням :class:`type` або будь-якого метакласу, який остаточно викликає ``type.__new__``, наступні додаткові кроки налаштування викликаються після створення об’єкта класу:

source: The ``type.__new__`` method collects all of the attributes in the class namespace that define a :meth:`~object.__set_name__` method;
uk: Метод ``type.__new__`` збирає всі атрибути в просторі імен класу, які визначають метод :meth:`~object.__set_name__`;

source: Those ``__set_name__`` methods are called with the class being defined and the assigned name of that particular attribute;
uk: Ці методи ``__set_name__`` викликаються з визначеним класом і присвоєною назвою цього конкретного атрибута;

source: The :meth:`~object.__init_subclass__` hook is called on the immediate parent of the new class in its method resolution order.
uk: Хук :meth:`~object.__init_subclass__` викликається на безпосередньому батькові нового класу в порядку вирішення методів.

source: After the class object is created, it is passed to the class decorators included in the class definition (if any) and the resulting object is bound in the local namespace as the defined class.
uk: Після того, як об’єкт класу створено, він передається до декораторів класу, включених у визначення класу (якщо такі є), і отриманий об’єкт зв’язується в локальному просторі імен як визначений клас.

source: When a new class is created by ``type.__new__``, the object provided as the namespace parameter is copied to a new ordered mapping and the original object is discarded. The new copy is wrapped in a read-only proxy, which becomes the :attr:`~object.__dict__` attribute of the class object.
uk: Коли новий клас створюється за допомогою ``type.__new__``, об’єкт, наданий як параметр простору імен, копіюється до нового впорядкованого відображення, а вихідний об’єкт відкидається. Нову копію загортають у проксі-сервер лише для читання, який стає атрибутом :attr:`~object.__dict__` об’єкта класу.

source: :pep:`3135` - New super
uk: :pep:`3135` - Новий супер

source: Describes the implicit ``__class__`` closure reference
uk: Описує неявне посилання на закриття ``__class__``

source: Uses for metaclasses
uk: Використання для метакласів

source: The potential uses for metaclasses are boundless. Some ideas that have been explored include enum, logging, interface checking, automatic delegation, automatic property creation, proxies, frameworks, and automatic resource locking/synchronization.
uk: Можливості використання метакласів безмежні. Деякі ідеї, які були досліджені, включають enum, журналювання, перевірку інтерфейсу, автоматичне делегування, автоматичне створення властивостей, проксі, фреймворки та автоматичне блокування/синхронізацію ресурсів.

source: Customizing instance and subclass checks
uk: Налаштування перевірок екземплярів і підкласів

source: The following methods are used to override the default behavior of the :func:`isinstance` and :func:`issubclass` built-in functions.
uk: Наступні методи використовуються для заміни типової поведінки вбудованих функцій :func:`isinstance` і :func:`issubclass`.

source: In particular, the metaclass :class:`abc.ABCMeta` implements these methods in order to allow the addition of Abstract Base Classes (ABCs) as "virtual base classes" to any class or type (including built-in types), including other ABCs.
uk: Зокрема, метаклас :class:`abc.ABCMeta` реалізує ці методи, щоб дозволити додавання абстрактних базових класів (ABC) як "віртуальних базових класів" до будь-якого класу або типу (включно з вбудованими типами), включаючи інші Азбука.

source: Return true if *instance* should be considered a (direct or indirect) instance of *class*. If defined, called to implement ``isinstance(instance, class)``.
uk: Повертає true, якщо *екземпляр* слід вважати (прямим чи непрямим) екземпляром *класу*. Якщо визначено, викликається для реалізації ``isinstance(instance, class)``.

source: Return true if *subclass* should be considered a (direct or indirect) subclass of *class*. If defined, called to implement ``issubclass(subclass, class)``.
uk: Повертає true, якщо *підклас* слід вважати (прямим чи непрямим) підкласом *класу*. Якщо визначено, викликається для реалізації ``issubclass(subclass, class)``.

source: Note that these methods are looked up on the type (metaclass) of a class. They cannot be defined as class methods in the actual class. This is consistent with the lookup of special methods that are called on instances, only in this case the instance is itself a class.
uk: Зауважте, що ці методи шукаються за типом (метакласом) класу. Вони не можуть бути визначені як методи класу в реальному класі. Це узгоджується з пошуком спеціальних методів, які викликаються для екземплярів, тільки в цьому випадку екземпляр сам по собі є класом.

source: :pep:`3119` - Introducing Abstract Base Classes
uk: :pep:`3119` - Представляємо абстрактні базові класи

source: Includes the specification for customizing :func:`isinstance` and :func:`issubclass` behavior through :meth:`~class.__instancecheck__` and :meth:`~class.__subclasscheck__`, with motivation for this functionality in the context of adding Abstract Base Classes (see the :mod:`abc` module) to the language.
uk: Включає специфікацію для налаштування поведінки :func:`isinstance` і :func:`issubclass` через :meth:`~class.__instancecheck__` і :meth:`~class.__subclasscheck__` з мотивацією для цієї функції в контексті додавання Абстрактні базові класи (див. модуль :mod:`abc`) до мови.

source: Emulating generic types
uk: Емуляція загальних типів

source: When using :term:`type annotations<annotation>`, it is often useful to *parameterize* a :term:`generic type` using Python's square-brackets notation. For example, the annotation ``list[int]`` might be used to signify a :class:`list` in which all the elements are of type :class:`int`.
uk: Використовуючи :term:`анотації типу <annotation>`, часто корисно *параметризувати* загальний тип (:term:`generic type`) за допомогою нотації Python у квадратних дужках. Наприклад, анотацію ``list[int]`` можна використовувати для позначення :class:`list`, у якому всі елементи мають тип :class:`int`.

source: :pep:`484` - Type Hints
uk: :pep:`484` - підказки типу

source: Introducing Python's framework for type annotations
uk: Представляємо структуру Python для анотацій типів

source: :ref:`Generic Alias Types<types-genericalias>`
uk: :ref:`Загальні типи псевдонімів <types-genericalias>`

source: Documentation for objects representing parameterized generic classes
uk: Документація для об'єктів, що представляють параметризовані загальні класи

source: :ref:`Generics`, :ref:`user-defined generics<user-defined-generics>` and :class:`typing.Generic`
uk: :ref:`Generics`, :ref:`визначені користувачем узагальнення <user-defined-generics>` і :class:`typing.Generic`

source: Documentation on how to implement generic classes that can be parameterized at runtime and understood by static type-checkers.
uk: Документація про те, як реалізувати загальні класи, які можна параметризувати під час виконання та розуміти статичними засобами перевірки типів.

source: A class can *generally* only be parameterized if it defines the special class method ``__class_getitem__()``.
uk: *Зазвичай* клас може бути параметризований, лише якщо він визначає спеціальний метод класу ``__class_getitem__()``.

source: Return an object representing the specialization of a generic class by type arguments found in *key*.
uk: Повертає об’єкт, який представляє спеціалізацію загального класу за аргументами типу, знайденими в *key*.

source: When defined on a class, ``__class_getitem__()`` is automatically a class method. As such, there is no need for it to be decorated with :func:`@classmethod<classmethod>` when it is defined.
uk: Коли визначено в класі, ``__class_getitem__()`` автоматично стає методом класу. Таким чином, немає необхідності прикрашати його :func:`@classmethod <classmethod>`, коли він визначений.

source: The purpose of *__class_getitem__*
uk: Мета *__class_getitem__*

source: The purpose of :meth:`~object.__class_getitem__` is to allow runtime parameterization of standard-library generic classes in order to more easily apply :term:`type hints<type hint>` to these classes.
uk: Метою :meth:`~object.__class_getitem__` є можливість параметризації загальних класів стандартної бібліотеки під час виконання, щоб легше застосовувати :term:`підказки типу <type hint>` до цих класів.

source: To implement custom generic classes that can be parameterized at runtime and understood by static type-checkers, users should either inherit from a standard library class that already implements :meth:`~object.__class_getitem__`, or inherit from :class:`typing.Generic`, which has its own implementation of ``__class_getitem__()``.
uk: Щоб реалізувати користувальницькі загальні класи, які можна параметризувати під час виконання та розуміти статичними засобами перевірки типів, користувачі повинні або успадкувати від класу стандартної бібліотеки, яка вже реалізує :meth:`~object.__class_getitem__`, або успадкувати від :class:`typing. Generic`, який має власну реалізацію ``__class_getitem__()``.

source: Custom implementations of :meth:`~object.__class_getitem__` on classes defined outside of the standard library may not be understood by third-party type-checkers such as mypy. Using ``__class_getitem__()`` on any class for purposes other than type hinting is discouraged.
uk: Спеціальні реалізації :meth:`~object.__class_getitem__` у класах, визначених за межами стандартної бібліотеки, можуть бути не зрозумілі сторонніми засобами перевірки типів, такими як mypy. Не рекомендується використовувати ``__class_getitem__()`` для будь-якого класу для цілей, відмінних від підказки типу.

source: *__class_getitem__* versus *__getitem__*
uk: *__class_getitem__* проти *__getitem__*

source: Usually, the :ref:`subscription<subscriptions>` of an object using square brackets will call the :meth:`~object.__getitem__` instance method defined on the object's class. However, if the object being subscribed is itself a class, the class method :meth:`~object.__class_getitem__` may be called instead. ``__class_getitem__()`` should return a :ref:`GenericAlias<types-genericalias>` object if it is properly defined.
uk: Зазвичай :ref:`підписка <subscriptions>` об’єкта з використанням квадратних дужок викликає метод екземпляра :meth:`~object.__getitem__`, визначений у класі об’єкта. Проте, якщо об’єкт, на який підписується, сам є класом, замість нього можна викликати метод класу :meth:`~object.__class_getitem__`. ``__class_getitem__()`` має повертати об’єкт :ref:`GenericAlias <types-genericalias>`, якщо він правильно визначений.

source: Presented with the :term:`expression` ``obj[x]``, the Python interpreter follows something like the following process to decide whether :meth:`~object.__getitem__` or :meth:`~object.__class_getitem__` should be called::
uk: Представлений у вигляді :term:`expression` ``obj[x]``, інтерпретатор Python виконує щось на зразок наступного процесу, щоб вирішити, чи слід :meth:`~object.__getitem__` або :meth:`~object.__class_getitem__` бути викликаним::

source: In Python, all classes are themselves instances of other classes. The class of a class is known as that class's :term:`metaclass`, and most classes have the :class:`type` class as their metaclass. :class:`type` does not define :meth:`~object.__getitem__`, meaning that expressions such as ``list[int]``, ``dict[str, float]`` and ``tuple[str, bytes]`` all result in :meth:`~object.__class_getitem__` being called::
uk: У Python усі класи самі є екземплярами інших класів. Клас класу відомий як :term:`metaclass` цього класу, і більшість класів мають клас :class:`type` як метаклас. :class:`type` не визначає :meth:`~object.__getitem__`, тобто такі вирази, як ``list[int]``, ``dict[str, float]`` і ``tuple[str, bytes]`` все призводить до виклику :meth:`~object.__class_getitem__`::

source: However, if a class has a custom metaclass that defines :meth:`~object.__getitem__`, subscribing the class may result in different behaviour. An example of this can be found in the :mod:`enum` module::
uk: Однак, якщо клас має спеціальний метаклас, який визначає :meth:`~object.__getitem__`, підписка на клас може призвести до іншої поведінки. Приклад цього можна знайти в модулі :mod:`enum`::

source: :pep:`560` - Core Support for typing module and generic types
uk: :pep:`560` - Основна підтримка модуля введення тексту та загальних типів

source: Introducing :meth:`~object.__class_getitem__`, and outlining when a :ref:`subscription<subscriptions>` results in ``__class_getitem__()`` being called instead of :meth:`~object.__getitem__`
uk: Представляємо :meth:`~object.__class_getitem__` і пояснюємо, коли :ref:`підписка <subscriptions>` призводить до виклику ``__class_getitem__()`` замість :meth:`~object.__getitem__`

source: Emulating callable objects
uk: Емуляція викликаних об'єктів

source: Called when the instance is "called" as a function; if this method is defined, ``x(arg1, arg2, ...)`` roughly translates to ``type(x).__call__(x, arg1, ...)``.
uk: Викликається, коли екземпляр "викликається" як функція; якщо цей метод визначено, ``x(arg1, arg2, ...)`` приблизно перекладається як ``type(x).__call__(x, arg1, ...)``.

source: Emulating container types
uk: Емуляція типів контейнерів

source: The following methods can be defined to implement container objects. Containers usually are :term:`sequences <sequence>` (such as :class:`lists <list>` or :class:`tuples <tuple>`) or :term:`mappings <mapping>` (like :class:`dictionaries <dict>`), but can represent other containers as well. The first set of methods is used either to emulate a sequence or to emulate a mapping; the difference is that for a sequence, the allowable keys should be the integers *k* for which ``0 <= k < N`` where *N* is the length of the sequence, or :class:`slice` objects, which define a range of items. It is also recommended that mappings provide the methods :meth:`keys`, :meth:`values`, :meth:`items`, :meth:`get`, :meth:`clear`, :meth:`setdefault`, :meth:`pop`, :meth:`popitem`, :meth:`!copy`, and :meth:`update` behaving similar to those for Python's standard :class:`dictionary <dict>` objects. The :mod:`collections.abc` module provides a :class:`~collections.abc.MutableMapping` :term:`abstract base class` to help create those methods from a base set of :meth:`~object.__getitem__`, :meth:`~object.__setitem__`, :meth:`~object.__delitem__`, and :meth:`keys`. Mutable sequences should provide methods :meth:`append`, :meth:`count`, :meth:`index`, :meth:`extend`, :meth:`insert`, :meth:`pop`, :meth:`remove`, :meth:`reverse` and :meth:`sort`, like Python standard :class:`list` objects. Finally, sequence types should implement addition (meaning concatenation) and multiplication (meaning repetition) by defining the methods :meth:`~object.__add__`, :meth:`~object.__radd__`, :meth:`~object.__iadd__`, :meth:`~object.__mul__`, :meth:`~object.__rmul__` and :meth:`~object.__imul__` described below; they should not define other numerical operators. It is recommended that both mappings and sequences implement the :meth:`~object.__contains__` method to allow efficient use of the ``in`` operator; for mappings, ``in`` should search the mapping's keys; for sequences, it should search through the values. It is further recommended that both mappings and sequences implement the :meth:`~object.__iter__` method to allow efficient iteration through the container; for mappings, :meth:`__iter__` should iterate through the object's keys; for sequences, it should iterate through the values.
uk: Наступні методи можуть бути визначені для реалізації контейнерних об’єктів. Зазвичай контейнерами є :term:`послідовності <sequence>` (такі як :class:`списки <list>` або :class:`кортежі <tuple>`) або :term:`відображення <mapping>` (наприклад, :class:`словник <dict>`), але його представляють також інші контейнери. Перший набір методів використовується або для емуляції послідовності, або для емуляції відображення; різниця полягає в тому, що для послідовності дозволеними ключами мають бути цілі числа *k*, для яких ``0 <= k < N``, де *N* — довжина послідовності, або об’єкти :class:`slice`, які визначають діапазон предметів. Також рекомендується, щоб зіставлення передбачало методи :meth:`keys`, :meth:`values`, :meth:`items`, :meth:`get`, :meth:`clear`, :meth:`setdefault` , :meth:`pop`, :meth:`popitem`, :meth:`!copy` і :meth:`update` поводяться подібно до об’єктів стандарту Python :class:`dictionary <dict>`. Модуль :mod:`collections.abc` надає :class:`~collections.abc.MutableMapping` :term:`abstract base class`, щоб допомогти створити ці методи з базового набору :meth:`~object.__getitem__` , :meth:`~object.__setitem__`, :meth:`~object.__delitem__` і :meth:`keys`. Змінні послідовності повинні надавати методи: :meth:`append`, :meth:`count`, :meth:`index`, :meth:`extend`, :meth:`insert`, :meth:`pop`, :meth:`remove`, :meth:`reverse` і :meth:`sort`, як стандартні об’єкти Python :class:`list`. Нарешті, типи послідовностей повинні реалізовувати додавання (що означає конкатенацію) і множення (що означає повторення) шляхом визначення методів :meth:`~object.__add__`, :meth:`~object.__radd__`, :meth:`~object.__iadd__` , :meth:`~object.__mul__`, :meth:`~object.__rmul__` і :meth:`~object.__imul__`, описані нижче; вони не повинні визначати інші числові оператори. Рекомендується, щоб і відображення, і послідовності реалізовували метод :meth:`~object.__contains__`, щоб забезпечити ефективне використання оператора ``in``; для відображень ``in`` має шукати ключі відображення; для послідовностей слід шукати значення. Крім того, рекомендується, щоб і відображення, і послідовності реалізовували метод :meth:`~object.__iter__`, щоб забезпечити ефективну ітерацію через контейнер; для відображень :meth:`__iter__` має виконувати ітерацію по ключах об’єкта; для послідовностей він повинен перебирати значення.

source: Called to implement the built-in function :func:`len`. Should return the length of the object, an integer ``>=`` 0. Also, an object that doesn't define a :meth:`__bool__` method and whose :meth:`__len__` method returns zero is considered to be false in a Boolean context.
uk: Викликається для реалізації вбудованої функції :func:`len`. Має повертати довжину об’єкта, ціле число ``>=`` 0. Крім того, об’єкт, який не визначає метод :meth:`__bool__` і чий метод :meth:`__len__` повертає нуль, вважається false у логічному контексті.

source: In CPython, the length is required to be at most :attr:`sys.maxsize`. If the length is larger than :attr:`!sys.maxsize` some features (such as :func:`len`) may raise :exc:`OverflowError`. To prevent raising :exc:`!OverflowError` by truth value testing, an object must define a :meth:`__bool__` method.
uk: У CPython довжина не повинна перевищувати :attr:`sys.maxsize`. Якщо довжина більша за :attr:`!sys.maxsize`, деякі функції (такі як :func:`len`) можуть викликати :exc:`OverflowError`. Щоб запобігти виникненню :exc:`!OverflowError` шляхом перевірки значення істинності, об’єкт повинен визначити метод :meth:`__bool__`.

source: Called to implement :func:`operator.length_hint`. Should return an estimated length for the object (which may be greater or less than the actual length). The length must be an integer ``>=`` 0. The return value may also be :const:`NotImplemented`, which is treated the same as if the ``__length_hint__`` method didn't exist at all. This method is purely an optimization and is never required for correctness.
uk: Викликається для реалізації :func:`operator.length_hint`. Має повернути приблизну довжину об’єкта (яка може бути більшою або меншою за фактичну). Довжина має бути цілим числом ``>=`` 0. Поверненим значенням також може бути :const:`NotImplemented`, яке обробляється так само, як якби метод ``__length_hint__`` взагалі не існував. Цей метод є виключно оптимізаційним і ніколи не потрібен для коректності.

source: Slicing is done exclusively with the following three methods. A call like ::
uk: Нарізка виконується виключно трьома способами. Дзвінок типу ::

source: is translated to ::
uk: перекладається на ::

source: and so forth. Missing slice items are always filled in with ``None``.
uk: і так далі. Відсутні елементи фрагмента завжди заповнюються ``None``.

source: Called to implement evaluation of ``self[key]``. For :term:`sequence` types, the accepted keys should be integers and slice objects. Note that the special interpretation of negative indexes (if the class wishes to emulate a :term:`sequence` type) is up to the :meth:`__getitem__` method. If *key* is of an inappropriate type, :exc:`TypeError` may be raised; if of a value outside the set of indexes for the sequence (after any special interpretation of negative values), :exc:`IndexError` should be raised. For :term:`mapping` types, if *key* is missing (not in the container), :exc:`KeyError` should be raised.
uk: Викликається для реалізації оцінки ``self[key]``. Для типів :term:`sequence` прийнятними ключами мають бути цілі числа та об’єкти зрізу. Зверніть увагу, що спеціальна інтерпретація негативних індексів (якщо клас бажає емулювати тип :term:`sequence`) залежить від методу :meth:`__getitem__`. Якщо *key* має невідповідний тип, може виникнути :exc:`TypeError`; якщо значення знаходиться за межами набору індексів для послідовності (після будь-якої спеціальної інтерпретації від’ємних значень), має бути викликано :exc:`IndexError`. Для типів :term:`mapping`, якщо *key* відсутній (не в контейнері), слід викликати :exc:`KeyError`.

source: :keyword:`for` loops expect that an :exc:`IndexError` will be raised for illegal indexes to allow proper detection of the end of the sequence.
uk: :keyword:`for` цикли очікують, що :exc:`IndexError` буде викликано для недопустимих індексів, щоб забезпечити належне виявлення кінця послідовності.
