Repository: seanpm2001/python-docs-uk
Catalog: reference/datamodel.po
Languages: uk

source: Raises the specified exception in the coroutine. This method delegates to the :meth:`~generator.throw` method of the iterator that caused the coroutine to suspend, if it has such a method. Otherwise, the exception is raised at the suspension point. The result (return value, :exc:`StopIteration`, or other exception) is the same as when iterating over the :meth:`~object.__await__` return value, described above. If the exception is not caught in the coroutine, it propagates back to the caller.
uk: Викликає вказаний виняток у співпрограмі. Цей метод делегує метод :meth:`~generator.throw` ітератора, який викликав призупинення співпрограми, якщо він має такий метод. В іншому випадку виняток виникає в точці призупинення. Результат (повернене значення, :exc:`StopIteration` або інший виняток) такий самий, як і під час ітерації по поверненому значенню :meth:`~object.__await__`, описаному вище. Якщо виняток не перехоплюється співпрограмою, він поширюється назад до абонента.

source: Causes the coroutine to clean itself up and exit. If the coroutine is suspended, this method first delegates to the :meth:`~generator.close` method of the iterator that caused the coroutine to suspend, if it has such a method. Then it raises :exc:`GeneratorExit` at the suspension point, causing the coroutine to immediately clean itself up. Finally, the coroutine is marked as having finished executing, even if it was never started.
uk: Примушує співпрограму самоочиститися та завершити роботу. Якщо співпрограму призупинено, цей метод спочатку делегує метод :meth:`~generator.close` ітератора, який викликав призупинення співпрограми, якщо він має такий метод. Потім він викликає :exc:`GeneratorExit` у точці призупинення, змушуючи співпрограму негайно очищатися. Нарешті, співпрограма позначається як завершена, навіть якщо вона ніколи не запускалася.

source: Coroutine objects are automatically closed using the above process when they are about to be destroyed.
uk: Об’єкти співпрограми автоматично закриваються за допомогою описаного вище процесу, коли їх збираються знищити.

source: Asynchronous Iterators
uk: Асинхронні ітератори

source: An *asynchronous iterator* can call asynchronous code in its ``__anext__`` method.
uk: *Асинхронний ітератор* може викликати асинхронний код у своєму методі ``__anext__``.

source: Asynchronous iterators can be used in an :keyword:`async for` statement.
uk: Асинхронні ітератори можна використовувати в операторі :keyword:`async for`.

source: Must return an *asynchronous iterator* object.
uk: Має повертати об’єкт *асинхронного ітератора*.

source: Must return an *awaitable* resulting in a next value of the iterator. Should raise a :exc:`StopAsyncIteration` error when the iteration is over.
uk: Має повернути *waitable*, що призводить до наступного значення ітератора. Має викликати помилку :exc:`StopAsyncIteration` після завершення ітерації.

source: An example of an asynchronous iterable object::
uk: Приклад асинхронного ітерованого об'єкта::

source: Prior to Python 3.7, :meth:`~object.__aiter__` could return an *awaitable* that would resolve to an :term:`asynchronous iterator <asynchronous iterator>`.
uk: До Python 3.7 :meth:`~object.__aiter__` міг повертати *waitable*, який перетворювався на :term:`асинхронний ітератор <asynchronous iterator>`.

source: Starting with Python 3.7, :meth:`~object.__aiter__` must return an asynchronous iterator object. Returning anything else will result in a :exc:`TypeError` error.
uk: Починаючи з Python 3.7, :meth:`~object.__aiter__` має повертати об’єкт асинхронного ітератора. Повернення чогось іншого призведе до помилки :exc:`TypeError`.

source: Asynchronous Context Managers
uk: Менеджери асинхронного контексту

source: An *asynchronous context manager* is a *context manager* that is able to suspend execution in its ``__aenter__`` and ``__aexit__`` methods.
uk: *Асинхронний контекстний менеджер* — це *контекстний менеджер*, який може призупинити виконання своїх методів ``__aenter__`` і ``__aexit__``.

source: Asynchronous context managers can be used in an :keyword:`async with` statement.
uk: Асинхронні менеджери контексту можна використовувати в операторі :keyword:`async with`.

source: Semantically similar to :meth:`__enter__`, the only difference being that it must return an *awaitable*.
uk: Семантично подібний до :meth:`__enter__`, єдина відмінність полягає в тому, що він повинен повертати *waitable*.

source: Semantically similar to :meth:`__exit__`, the only difference being that it must return an *awaitable*.
uk: Семантично подібний до :meth:`__exit__`, єдина відмінність полягає в тому, що він повинен повертати *waitable*.

source: An example of an asynchronous context manager class::
uk: Приклад класу диспетчера асинхронного контексту::

source: Footnotes
uk: Виноски

source: It *is* possible in some cases to change an object's type, under certain controlled conditions. It generally isn't a good idea though, since it can lead to some very strange behaviour if it is handled incorrectly.
uk: У деяких випадках *можливо* змінити тип об’єкта за певних контрольованих умов. Загалом це не дуже гарна ідея, оскільки це може призвести до дуже дивної поведінки, якщо з ним поводитись неправильно.

source: The :meth:`~object.__hash__`, :meth:`~object.__iter__`, :meth:`~object.__reversed__`, and :meth:`~object.__contains__` methods have special handling for this; others will still raise a :exc:`TypeError`, but may do so by relying on the behavior that ``None`` is not callable.
uk: Методи :meth:`~object.__hash__`, :meth:`~object.__iter__`, :meth:`~object.__reversed__` і :meth:`~object.__contains__` мають спеціальну обробку для цього; інші все одно викличуть :exc:`TypeError`, але можуть зробити це, покладаючись на поведінку, що ``None`` не викликається.

source: "Does not support" here means that the class has no such method, or the method returns ``NotImplemented``. Do not set the method to ``None`` if you want to force fallback to the right operand's reflected method—that will instead have the opposite effect of explicitly *blocking* such fallback.
uk: "Не підтримує" тут означає, що клас не має такого методу, або метод повертає ``NotImplemented``. Не встановлюйте для методу значення ``None``, якщо ви хочете примусово повернутися до відображеного методу правого операнда — це натомість матиме протилежний ефект явного *блокування* такого резерву.

source: For operands of the same type, it is assumed that if the non-reflected method -- such as :meth:`~object.__add__` -- fails then the overall operation is not supported, which is why the reflected method is not called.
uk: Для операндів одного типу передбачається, що якщо невідбитий метод, наприклад :meth:`~object.__add__`, завершується помилкою, тоді загальна операція не підтримується, тому відображений метод не викликається .
