Repository: seanpm2001/python-docs-uk
Catalog: reference/datamodel.po
Languages: uk

source: There are no swapped-argument versions of these methods (to be used when the left argument does not support the operation but the right argument does); rather, :meth:`__lt__` and :meth:`__gt__` are each other's reflection, :meth:`__le__` and :meth:`__ge__` are each other's reflection, and :meth:`__eq__` and :meth:`__ne__` are their own reflection. If the operands are of different types, and right operand's type is a direct or indirect subclass of the left operand's type, the reflected method of the right operand has priority, otherwise the left operand's method has priority. Virtual subclassing is not considered.
uk: Немає версій цих методів із заміною аргументів (для використання, коли лівий аргумент не підтримує операцію, але правий підтримує); швидше, :meth:`__lt__` і :meth:`__gt__` є відображенням одне одного, :meth:`__le__` і :meth:`__ge__` є відображенням одне одного, а :meth:`__eq__` і :meth:`__ne__` є їх власним відображенням. Якщо операнди мають різні типи, а тип правого операнда є прямим або непрямим підкласом типу лівого операнда, відображений метод правого операнда має пріоритет, інакше метод лівого операнда має пріоритет. Віртуальний підклас не розглядається.

source: Called by built-in function :func:`hash` and for operations on members of hashed collections including :class:`set`, :class:`frozenset`, and :class:`dict`. The ``__hash__()`` method should return an integer. The only required property is that objects which compare equal have the same hash value; it is advised to mix together the hash values of the components of the object that also play a part in comparison of objects by packing them into a tuple and hashing the tuple. Example::
uk: Викликається вбудованою функцією :func:`hash` і для операцій над членами хешованих колекцій, включаючи :class:`set`, :class:`frozenset` і :class:`dict`. Метод ``__hash__()`` має повертати ціле число. Єдиною необхідною властивістю є те, що об’єкти, які порівнюються, мають однакове хеш-значення; рекомендується змішувати геш-значення компонентів об’єкта, які також відіграють роль у порівнянні об’єктів, упаковуючи їх у кортеж і хешуючи кортеж. Приклад::

source: :func:`hash` truncates the value returned from an object's custom :meth:`__hash__` method to the size of a :c:type:`Py_ssize_t`. This is typically 8 bytes on 64-bit builds and 4 bytes on 32-bit builds. If an object's :meth:`__hash__` must interoperate on builds of different bit sizes, be sure to check the width on all supported builds. An easy way to do this is with ``python -c "import sys; print(sys.hash_info.width)"``.
uk: :func:`hash` скорочує значення, що повертається користувацьким методом :meth:`__hash__` об’єкта, до розміру :c:type:`Py_ssize_t`. Зазвичай це 8 байтів для 64-розрядних збірок і 4 байти для 32-розрядних збірок. Якщо :meth:`__hash__` об’єкта має взаємодіяти зі збірками різних бітових розмірів, обов’язково перевірте ширину всіх підтримуваних збірок. Простий спосіб зробити це за допомогою ``python -c "import sys; print(sys.hash_info.width)"``.

source: If a class does not define an :meth:`__eq__` method it should not define a :meth:`__hash__` operation either; if it defines :meth:`__eq__` but not :meth:`__hash__`, its instances will not be usable as items in hashable collections. If a class defines mutable objects and implements an :meth:`__eq__` method, it should not implement :meth:`__hash__`, since the implementation of hashable collections requires that a key's hash value is immutable (if the object's hash value changes, it will be in the wrong hash bucket).
uk: Якщо клас не визначає метод :meth:`__eq__`, він також не повинен визначати операцію :meth:`__hash__`; якщо він визначає :meth:`__eq__`, але не :meth:`__hash__`, його екземпляри не можна буде використовувати як елементи в хешованих колекціях. Якщо клас визначає змінні об’єкти та реалізує метод :meth:`__eq__`, він не повинен реалізовувати :meth:`__hash__`, оскільки реалізація хешованих колекцій вимагає, щоб хеш-значення ключа було незмінним (якщо хеш-значення об’єкта змінюється, воно буде в неправильному хеш-бакеті).

source: User-defined classes have :meth:`__eq__` and :meth:`__hash__` methods by default; with them, all objects compare unequal (except with themselves) and ``x.__hash__()`` returns an appropriate value such that ``x == y`` implies both that ``x is y`` and ``hash(x) == hash(y)``.
uk: Визначені користувачем класи за замовчуванням мають методи :meth:`__eq__` і :meth:`__hash__`; з ними всі об’єкти порівнюються нерівно (крім самих себе), і ``x.__hash__()`` повертає відповідне значення, так що ``x == y`` означає, що ``x є y`` і ``hash (x) == хеш(y)``.

source: A class that overrides :meth:`__eq__` and does not define :meth:`__hash__` will have its :meth:`__hash__` implicitly set to ``None``. When the :meth:`__hash__` method of a class is ``None``, instances of the class will raise an appropriate :exc:`TypeError` when a program attempts to retrieve their hash value, and will also be correctly identified as unhashable when checking ``isinstance(obj, collections.abc.Hashable)``.
uk: Для класу, який перевизначає :meth:`__eq__` і не визначає :meth:`__hash__`, його :meth:`__hash__` буде неявно встановлено на ``None``. Коли метод :meth:`__hash__` класу має значення ``None``, екземпляри класу викличуть відповідну :exc:`TypeError`, коли програма намагатиметься отримати їх хеш-значення, а також будуть правильно визначені як нехешується під час перевірки ``isinstance(obj, collections.abc.Hashable)``.

source: If a class that overrides :meth:`__eq__` needs to retain the implementation of :meth:`__hash__` from a parent class, the interpreter must be told this explicitly by setting ``__hash__ = <ParentClass>.__hash__``.
uk: Якщо клас, який перевизначає :meth:`__eq__`, потребує збереження реалізації :meth:`__hash__` від батьківського класу, інтерпретатор має бути повідомлений про це явно, встановивши ``__hash__ = <ParentClass> .__hash__``.

source: If a class that does not override :meth:`__eq__` wishes to suppress hash support, it should include ``__hash__ = None`` in the class definition. A class which defines its own :meth:`__hash__` that explicitly raises a :exc:`TypeError` would be incorrectly identified as hashable by an ``isinstance(obj, collections.abc.Hashable)`` call.
uk: Якщо клас, який не перевизначає :meth:`__eq__`, бажає придушити підтримку хешу, він повинен включити ``__hash__ = None`` у визначення класу. Клас, який визначає власний :meth:`__hash__`, який явно викликає :exc:`TypeError`, буде неправильно ідентифікований як хешований викликом ``isinstance(obj, collections.abc.Hashable)``.

source: By default, the :meth:`__hash__` values of str and bytes objects are "salted" with an unpredictable random value. Although they remain constant within an individual Python process, they are not predictable between repeated invocations of Python.
uk: За замовчуванням значення :meth:`__hash__` об’єктів str і bytes "підсолюються" непередбачуваним випадковим значенням. Хоча вони залишаються незмінними в окремому процесі Python, вони не передбачувані між повторними викликами Python.

source: Changing hash values affects the iteration order of sets. Python has never made guarantees about this ordering (and it typically varies between 32-bit and 64-bit builds).
uk: Зміна хеш-значень впливає на порядок ітерацій наборів. Python ніколи не надавав гарантій щодо такого порядку (і він зазвичай варіюється між 32-бітними та 64-бітними збірками).

source: See also :envvar:`PYTHONHASHSEED`.
uk: Дивіться також :envvar:`PYTHONHASHSEED`.

source: Hash randomization is enabled by default.
uk: Хеш-рандомізація ввімкнена за замовчуванням.

source: Called to implement truth value testing and the built-in operation ``bool()``; should return ``False`` or ``True``. When this method is not defined, :meth:`__len__` is called, if it is defined, and the object is considered true if its result is nonzero. If a class defines neither :meth:`__len__` nor :meth:`__bool__`, all its instances are considered true.
uk: Викликається для реалізації перевірки значення істинності та вбудованої операції ``bool()``; має повертати ``False`` або ``True``. Коли цей метод не визначено, викликається :meth:`__len__`, якщо він визначений, і об’єкт вважається істинним, якщо його результат ненульовий. Якщо клас не визначає ані :meth:`__len__`, ані :meth:`__bool__`, усі його екземпляри вважаються істинними.

source: Customizing attribute access
uk: Налаштування доступу до атрибутів

source: The following methods can be defined to customize the meaning of attribute access (use of, assignment to, or deletion of ``x.name``) for class instances.
uk: Наступні методи можна визначити для налаштування значення доступу до атрибутів (використання, призначення або видалення ``x.name``) для екземплярів класу.

source: Called when the default attribute access fails with an :exc:`AttributeError` (either :meth:`__getattribute__` raises an :exc:`AttributeError` because *name* is not an instance attribute or an attribute in the class tree for ``self``; or :meth:`__get__` of a *name* property raises :exc:`AttributeError`). This method should either return the (computed) attribute value or raise an :exc:`AttributeError` exception.
uk: Викликається, коли доступ до атрибута за замовчуванням не вдається через :exc:`AttributeError` (будь-який :meth:`__getattribute__` викликає :exc:`AttributeError`, оскільки *name* не є атрибутом екземпляра або атрибутом у дереві класів для ``self``; або :meth:`__get__` властивості *name* викликає :exc:`AttributeError`). Цей метод має повертати (обчислене) значення атрибута або викликати виняток :exc:`AttributeError`.

source: Note that if the attribute is found through the normal mechanism, :meth:`__getattr__` is not called. (This is an intentional asymmetry between :meth:`__getattr__` and :meth:`__setattr__`.) This is done both for efficiency reasons and because otherwise :meth:`__getattr__` would have no way to access other attributes of the instance. Note that at least for instance variables, you can fake total control by not inserting any values in the instance attribute dictionary (but instead inserting them in another object). See the :meth:`__getattribute__` method below for a way to actually get total control over attribute access.
uk: Зауважте, що якщо атрибут знайдено за допомогою звичайного механізму, :meth:`__getattr__` не викликається. (Це навмисна асиметрія між :meth:`__getattr__` і :meth:`__setattr__`.) Це зроблено як з міркувань ефективності, так і тому, що інакше :meth:`__getattr__` не матиме доступу до інших атрибутів примірника. Зауважте, що принаймні для змінних екземпляра ви можете імітувати повний контроль, не вставляючи жодних значень у словник атрибутів екземпляра (а натомість вставляючи їх в інший об’єкт). Перегляньте метод :meth:`__getattribute__` нижче, щоб дізнатися, як фактично отримати повний контроль над доступом до атрибутів.

source: Called unconditionally to implement attribute accesses for instances of the class. If the class also defines :meth:`__getattr__`, the latter will not be called unless :meth:`__getattribute__` either calls it explicitly or raises an :exc:`AttributeError`. This method should return the (computed) attribute value or raise an :exc:`AttributeError` exception. In order to avoid infinite recursion in this method, its implementation should always call the base class method with the same name to access any attributes it needs, for example, ``object.__getattribute__(self, name)``.
uk: Викликається безумовно для реалізації доступу до атрибутів для екземплярів класу. Якщо клас також визначає :meth:`__getattr__`, останній не буде викликаний, якщо :meth:`__getattribute__` не викличе його явно або не викличе :exc:`AttributeError`. Цей метод має повертати (обчислене) значення атрибута або викликати виняток :exc:`AttributeError`. Щоб уникнути нескінченної рекурсії в цьому методі, його реалізація повинна завжди викликати метод базового класу з тим самим іменем для доступу до будь-яких необхідних атрибутів, наприклад, ``object.__getattribute__(self, name)``.

source: This method may still be bypassed when looking up special methods as the result of implicit invocation via language syntax or built-in functions. See :ref:`special-lookup`.
uk: Цей метод все ще можна обійти під час пошуку спеціальних методів у результаті неявного виклику через синтаксис мови або вбудовані функції. Перегляньте :ref:`special-lookup`.

source: Raises an :ref:`auditing event <auditing>` ``object.__getattr__`` with arguments ``obj``, ``name``.
uk: Викликає :ref:`подію аудиту <auditing>` ``object.__getattr__`` з аргументами ``obj``, ``name``.

source: For certain sensitive attribute accesses, raises an :ref:`auditing event <auditing>` ``object.__getattr__`` with arguments ``obj`` and ``name``.
uk: Для доступу до певних конфіденційних атрибутів викликає :ref:`подію аудиту <auditing>` ``object.__getattr__`` з аргументами ``obj`` і ``name``.

source: Called when an attribute assignment is attempted. This is called instead of the normal mechanism (i.e. store the value in the instance dictionary). *name* is the attribute name, *value* is the value to be assigned to it.
uk: Викликається під час спроби призначення атрибута. Це викликається замість звичайного механізму (тобто збереження значення в словнику екземпляра). *name* — ім’я атрибута, *value* — значення, яке йому буде присвоєно.

source: If :meth:`__setattr__` wants to assign to an instance attribute, it should call the base class method with the same name, for example, ``object.__setattr__(self, name, value)``.
uk: Якщо :meth:`__setattr__` хоче призначити атрибут екземпляра, він повинен викликати метод базового класу з такою самою назвою, наприклад, ``object.__setattr__(self, name, value)``.

source: Raises an :ref:`auditing event <auditing>` ``object.__setattr__`` with arguments ``obj``, ``name``, ``value``.
uk: Викликає :ref:`подію аудиту <auditing>` ``object.__setattr__`` з аргументами ``obj``, ``name``, ``value``.

source: For certain sensitive attribute assignments, raises an :ref:`auditing event <auditing>` ``object.__setattr__`` with arguments ``obj``, ``name``, ``value``.
uk: Для певних конфіденційних призначень атрибутів створює :ref:`подію аудиту <auditing>` ``object.__setattr__`` з аргументами ``obj``, ``name``, ``value``.

source: Like :meth:`__setattr__` but for attribute deletion instead of assignment. This should only be implemented if ``del obj.name`` is meaningful for the object.
uk: Як :meth:`__setattr__`, але для видалення атрибута замість призначення. Це слід застосовувати, лише якщо ``del obj.name`` має значення для об’єкта.

source: Raises an :ref:`auditing event <auditing>` ``object.__delattr__`` with arguments ``obj``, ``name``.
uk: Викликає :ref:`подію аудиту <auditing>` ``object.__delattr__`` з аргументами ``obj``, ``name``.

source: For certain sensitive attribute deletions, raises an :ref:`auditing event <auditing>` ``object.__delattr__`` with arguments ``obj`` and ``name``.
uk: Для певних видалень конфіденційних атрибутів викликає :ref:`подію аудиту <auditing>` ``object.__delattr__`` з аргументами ``obj`` і ``name``.

source: Called when :func:`dir` is called on the object. A sequence must be returned. :func:`dir` converts the returned sequence to a list and sorts it.
uk: Викликається, коли :func:`dir` викликається для об’єкта. Необхідно повернути послідовність. :func:`dir` перетворює повернуту послідовність на список і сортує його.

source: Customizing module attribute access
uk: Налаштування доступу до атрибутів модуля

source: Special names ``__getattr__`` and ``__dir__`` can be also used to customize access to module attributes. The ``__getattr__`` function at the module level should accept one argument which is the name of an attribute and return the computed value or raise an :exc:`AttributeError`. If an attribute is not found on a module object through the normal lookup, i.e. :meth:`object.__getattribute__`, then ``__getattr__`` is searched in the module ``__dict__`` before raising an :exc:`AttributeError`. If found, it is called with the attribute name and the result is returned.
uk: Спеціальні імена ``__getattr__`` і ``__dir__`` також можна використовувати для налаштування доступу до атрибутів модуля. Функція ``__getattr__`` на рівні модуля повинна приймати один аргумент, який є назвою атрибута, і повертати обчислене значення або викликати :exc:`AttributeError`. Якщо атрибут не знайдено в об’єкті модуля за допомогою звичайного пошуку, тобто :meth:`object.__getattribute__`, тоді ``__getattr__`` шукається в модулі ``__dict__`` перед тим, як викликати :exc:`AttributeError` . Якщо знайдено, воно викликається з назвою атрибута та повертає результат.

source: The ``__dir__`` function should accept no arguments, and return a sequence of strings that represents the names accessible on module. If present, this function overrides the standard :func:`dir` search on a module.
uk: Функція ``__dir__`` не повинна приймати аргументів і повертати послідовність рядків, яка представляє імена, доступні в модулі. Якщо присутня, ця функція замінює стандартний пошук :func:`dir` у модулі.

source: For a more fine grained customization of the module behavior (setting attributes, properties, etc.), one can set the ``__class__`` attribute of a module object to a subclass of :class:`types.ModuleType`. For example::
uk: Для більш точного налаштування поведінки модуля (встановлення атрибутів, властивостей тощо) можна встановити атрибут ``__class__`` об’єкта модуля до підкласу :class:`types.ModuleType`. Наприклад::

source: Defining module ``__getattr__`` and setting module ``__class__`` only affect lookups made using the attribute access syntax -- directly accessing the module globals (whether by code within the module, or via a reference to the module's globals dictionary) is unaffected.
uk: Визначення модуля ``__getattr__`` і налаштування модуля ``__class__`` впливають лише на пошуки, зроблені за допомогою синтаксису доступу до атрибутів – прямий доступ до глобалів модуля (чи то за допомогою коду в модулі, чи через посилання на словник глобалів модуля) не впливає.

source: ``__class__`` module attribute is now writable.
uk: Атрибут модуля ``__class__`` тепер доступний для запису.

source: ``__getattr__`` and ``__dir__`` module attributes.
uk: Атрибути модуля ``__getattr__`` і ``__dir__``.

source: :pep:`562` - Module __getattr__ and __dir__
uk: :pep:`562` - Модуль __getattr__ і __dir__

source: Describes the ``__getattr__`` and ``__dir__`` functions on modules.
uk: Описує функції ``__getattr__`` і ``__dir__`` для модулів.

source: Implementing Descriptors
uk: Реалізація дескрипторів

source: The following methods only apply when an instance of the class containing the method (a so-called *descriptor* class) appears in an *owner* class (the descriptor must be in either the owner's class dictionary or in the class dictionary for one of its parents). In the examples below, "the attribute" refers to the attribute whose name is the key of the property in the owner class' :attr:`~object.__dict__`.
uk: Наступні методи застосовуються лише тоді, коли екземпляр класу, що містить метод (так званий клас *descriptor*), з’являється в класі *owner* (дескриптор має бути або в словнику класу власника, або в словнику класу для одного з його батьки). У наведених нижче прикладах "атрибут" відноситься до атрибута, ім’я якого є ключем властивості в класі власника :attr:`~object.__dict__`.

source: Called to get the attribute of the owner class (class attribute access) or of an instance of that class (instance attribute access). The optional *owner* argument is the owner class, while *instance* is the instance that the attribute was accessed through, or ``None`` when the attribute is accessed through the *owner*.
uk: Викликається, щоб отримати атрибут класу власника (доступ до атрибуту класу) або екземпляра цього класу (доступ до атрибуту екземпляра). Необов’язковий аргумент *owner* — це клас власника, тоді як *instance* — це екземпляр, через який був доступ до атрибута, або ``None``, коли доступ до атрибута здійснюється через *owner*.

source: This method should return the computed attribute value or raise an :exc:`AttributeError` exception.
uk: Цей метод має повертати обчислене значення атрибута або викликати виняток :exc:`AttributeError`.

source: :PEP:`252` specifies that :meth:`__get__` is callable with one or two arguments. Python's own built-in descriptors support this specification; however, it is likely that some third-party tools have descriptors that require both arguments. Python's own :meth:`__getattribute__` implementation always passes in both arguments whether they are required or not.
uk: :PEP:`252` вказує, що :meth:`__get__` можна викликати за допомогою одного або двох аргументів. Власні вбудовані дескриптори Python підтримують цю специфікацію; проте ймовірно, що деякі інструменти сторонніх розробників мають дескриптори, які потребують обох аргументів. Власна реалізація :meth:`__getattribute__` Python завжди передає обидва аргументи незалежно від того, потрібні вони чи ні.

source: Called to set the attribute on an instance *instance* of the owner class to a new value, *value*.
uk: Викликається, щоб встановити атрибуту екземпляра *екземпляру* класу власника нове значення *value*.

source: Note, adding :meth:`__set__` or :meth:`__delete__` changes the kind of descriptor to a "data descriptor". See :ref:`descriptor-invocation` for more details.
uk: Зверніть увагу: додавання :meth:`__set__` або :meth:`__delete__` змінює тип дескриптора на "дескриптор даних". Перегляньте :ref:`descriptor-invocation` для отримання додаткової інформації.

source: Called to delete the attribute on an instance *instance* of the owner class.
uk: Викликається для видалення атрибута екземпляра *екземпляра* класу власника.

source: The attribute :attr:`__objclass__` is interpreted by the :mod:`inspect` module as specifying the class where this object was defined (setting this appropriately can assist in runtime introspection of dynamic class attributes). For callables, it may indicate that an instance of the given type (or a subclass) is expected or required as the first positional argument (for example, CPython sets this attribute for unbound methods that are implemented in C).
uk: Атрибут :attr:`__objclass__` інтерпретується модулем :mod:`inspect` як визначення класу, де було визначено цей об’єкт (встановлення цього належним чином може допомогти під час інтроспекції динамічних атрибутів класу). Для callables це може вказувати на те, що екземпляр заданого типу (або підкласу) очікується або вимагається як перший позиційний аргумент (наприклад, CPython встановлює цей атрибут для незв’язаних методів, реалізованих у C).

source: Invoking Descriptors
uk: Виклик дескрипторів

source: In general, a descriptor is an object attribute with "binding behavior", one whose attribute access has been overridden by methods in the descriptor protocol: :meth:`~object.__get__`, :meth:`~object.__set__`, and :meth:`~object.__delete__`. If any of those methods are defined for an object, it is said to be a descriptor.
uk: Загалом, дескриптор — це атрибут об’єкта з "зв’язуючою поведінкою", доступ до атрибутів якого перевизначено методами в протоколі дескриптора: :meth:`~object.__get__`, :meth:`~object.__set__` і :meth:`~object.__delete__`. Якщо будь-який із цих методів визначено для об’єкта, він називається дескриптором.
