Repository: seanpm2001/python-docs-uk
Catalog: reference/datamodel.po
Languages: uk

source: Accessing ``tb_frame`` raises an :ref:`auditing event <auditing>` ``object.__getattr__`` with arguments ``obj`` and ``"tb_frame"``.
uk: Доступ до tb_frame викликає :ref:`подію аудиту <auditing>` ``object.__getattr__`` з аргументами ``obj`` і ``"tb_frame"``.

source: Special writable attribute: :attr:`tb_next` is the next level in the stack trace (towards the frame where the exception occurred), or ``None`` if there is no next level.
uk: Спеціальний атрибут, доступний для запису: :attr:`tb_next` — це наступний рівень трасування стека (до кадру, де сталася виняток), або ``None``, якщо наступного рівня немає.

source: Traceback objects can now be explicitly instantiated from Python code, and the ``tb_next`` attribute of existing instances can be updated.
uk: Об’єкти відстеження тепер можна явно створювати з коду Python, а атрибут ``tb_next`` існуючих екземплярів можна оновлювати.

source: Slice objects
uk: Розрізати об'єкти

source: Slice objects are used to represent slices for :meth:`~object.__getitem__` methods. They are also created by the built-in :func:`slice` function.
uk: Об’єкти фрагментів використовуються для представлення фрагментів для методів :meth:`~object.__getitem__`. Вони також створюються за допомогою вбудованої функції :func:`slice`.

source: Special read-only attributes: :attr:`~slice.start` is the lower bound; :attr:`~slice.stop` is the upper bound; :attr:`~slice.step` is the step value; each is ``None`` if omitted. These attributes can have any type.
uk: Спеціальні атрибути лише для читання: :attr:`~slice.start` нижня межа; :attr:`~slice.stop` є верхньою межею; :attr:`~slice.step` — значення кроку; якщо опущено, кожен має значення ``None``. Ці атрибути можуть мати будь-який тип.

source: Slice objects support one method:
uk: Об'єкти Slice підтримують один метод:

source: This method takes a single integer argument *length* and computes information about the slice that the slice object would describe if applied to a sequence of *length* items. It returns a tuple of three integers; respectively these are the *start* and *stop* indices and the *step* or stride length of the slice. Missing or out-of-bounds indices are handled in a manner consistent with regular slices.
uk: Цей метод приймає єдиний цілочисельний аргумент *length* і обчислює інформацію про зріз, який описав би об’єкт slice, якщо його застосувати до послідовності елементів *length*. Він повертає кортеж із трьох цілих чисел; відповідно, це індекси *start* і *stop* і *крок* або довжина кроку зрізу. Відсутні індекси або індекси, що виходять за межі, обробляються відповідно до звичайних фрагментів.

source: Static method objects
uk: Об’єкти статичних методів

source: Static method objects provide a way of defeating the transformation of function objects to method objects described above. A static method object is a wrapper around any other object, usually a user-defined method object. When a static method object is retrieved from a class or a class instance, the object actually returned is the wrapped object, which is not subject to any further transformation. Static method objects are also callable. Static method objects are created by the built-in :func:`staticmethod` constructor.
uk: Об’єкти статичних методів забезпечують спосіб відмови від перетворення об’єктів функції в об’єкти методів, описані вище. Статичний об’єкт методу є обгорткою навколо будь-якого іншого об’єкта, зазвичай об’єкта методу, визначеного користувачем. Коли об’єкт статичного методу отримується з класу або екземпляра класу, фактично повернутий об’єкт є об’єктом-огорткою, який не підлягає подальшому перетворенню. Об’єкти статичних методів також можна викликати. Об’єкти статичних методів створюються за допомогою вбудованого конструктора :func:`staticmethod`.

source: Class method objects
uk: Об’єкти методу класу

source: A class method object, like a static method object, is a wrapper around another object that alters the way in which that object is retrieved from classes and class instances. The behaviour of class method objects upon such retrieval is described above, under "User-defined methods". Class method objects are created by the built-in :func:`classmethod` constructor.
uk: Об’єкт методу класу, як і статичний об’єкт методу, є оболонкою навколо іншого об’єкта, яка змінює спосіб, у який цей об’єкт отримується з класів та екземплярів класу. Поведінка об’єктів методу класу після такого отримання описана вище, у розділі "Визначені користувачем методи". Об’єкти методу класу створюються за допомогою вбудованого конструктора :func:`classmethod`.

source: Special method names
uk: Назви спеціальних методів

source: A class can implement certain operations that are invoked by special syntax (such as arithmetic operations or subscripting and slicing) by defining methods with special names. This is Python's approach to :dfn:`operator overloading`, allowing classes to define their own behavior with respect to language operators. For instance, if a class defines a method named :meth:`~object.__getitem__`, and ``x`` is an instance of this class, then ``x[i]`` is roughly equivalent to ``type(x).__getitem__(x, i)``. Except where mentioned, attempts to execute an operation raise an exception when no appropriate method is defined (typically :exc:`AttributeError` or :exc:`TypeError`).
uk: Клас може реалізувати певні операції, які викликаються спеціальним синтаксисом (такі як арифметичні операції або індексування та зрізання), визначаючи методи зі спеціальними іменами. Це підхід Python до :dfn:`operator overloading`, що дозволяє класам визначати власну поведінку щодо операторів мови. Наприклад, якщо клас визначає метод із назвою :meth:`~object.__getitem__`, а ``x`` є екземпляром цього класу, то ``x[i]`` приблизно еквівалентний ``type( x).__getitem__(x, i)``. Якщо не зазначено вище, спроби виконати операцію викликають виняток, якщо відповідний метод не визначено (зазвичай :exc:`AttributeError` або :exc:`TypeError`).

source: Setting a special method to ``None`` indicates that the corresponding operation is not available. For example, if a class sets :meth:`~object.__iter__` to ``None``, the class is not iterable, so calling :func:`iter` on its instances will raise a :exc:`TypeError` (without falling back to :meth:`~object.__getitem__`). [#]_
uk: Встановлення для спеціального методу значення ``None`` означає, що відповідна операція недоступна. Наприклад, якщо клас встановлює :meth:`~object.__iter__` на ``None``, клас не піддається ітерації, тому виклик :func:`iter` у його екземплярах викличе :exc:`TypeError` ( не повертаючись до :meth:`~object.__getitem__`). [#]_

source: When implementing a class that emulates any built-in type, it is important that the emulation only be implemented to the degree that it makes sense for the object being modelled. For example, some sequences may work well with retrieval of individual elements, but extracting a slice may not make sense. (One example of this is the :class:`~xml.dom.NodeList` interface in the W3C's Document Object Model.)
uk: При реалізації класу, який емулює будь-який вбудований тип, важливо, щоб емуляція була реалізована лише в тій мірі, в якій це має сенс для об’єкта, що моделюється. Наприклад, деякі послідовності можуть добре працювати з отриманням окремих елементів, але вилучення фрагмента може не мати сенсу. (Одним із прикладів цього є інтерфейс :class:`~xml.dom.NodeList` в об’єктній моделі документа W3C.)

source: Basic customization
uk: Базове налаштування

source: Called to create a new instance of class *cls*. :meth:`__new__` is a static method (special-cased so you need not declare it as such) that takes the class of which an instance was requested as its first argument. The remaining arguments are those passed to the object constructor expression (the call to the class). The return value of :meth:`__new__` should be the new object instance (usually an instance of *cls*).
uk: Викликається для створення нового екземпляра класу *cls*. :meth:`__new__` — це статичний метод (з особливим регістром, тому вам не потрібно оголошувати його як такий), який приймає клас, екземпляр якого був запитаний, як свій перший аргумент. Решта аргументів передаються у вираз конструктора об’єкта (виклик класу). Поверненим значенням :meth:`__new__` має бути новий екземпляр об’єкта (зазвичай це екземпляр *cls*).

source: If :meth:`__new__` is invoked during object construction and it returns an instance of *cls*, then the new instance’s :meth:`__init__` method will be invoked like ``__init__(self[, ...])``, where *self* is the new instance and the remaining arguments are the same as were passed to the object constructor.
uk: Якщо :meth:`__new__` викликається під час побудови об’єкта і повертає екземпляр *cls*, тоді новий метод :meth:`__init__` буде викликано як ``__init__(self[, ...])``, де *self* — це новий екземпляр, а решта аргументів ті самі, що були передані конструктору об’єкта.

source: If :meth:`__new__` does not return an instance of *cls*, then the new instance's :meth:`__init__` method will not be invoked.
uk: Якщо :meth:`__new__` не повертає екземпляр *cls*, то метод :meth:`__init__` нового екземпляра не буде викликано.

source: :meth:`__new__` is intended mainly to allow subclasses of immutable types (like int, str, or tuple) to customize instance creation. It is also commonly overridden in custom metaclasses in order to customize class creation.
uk: :meth:`__new__` призначений головним чином для того, щоб дозволити підкласам незмінних типів (наприклад, int, str або tuple) налаштовувати створення екземплярів. Його також зазвичай перевизначають у власних метакласах, щоб налаштувати створення класу.

source: Called after the instance has been created (by :meth:`__new__`), but before it is returned to the caller. The arguments are those passed to the class constructor expression. If a base class has an :meth:`__init__` method, the derived class's :meth:`__init__` method, if any, must explicitly call it to ensure proper initialization of the base class part of the instance; for example: ``super().__init__([args...])``.
uk: Викликається після створення екземпляра (за допомогою :meth:`__new__`), але до того, як його буде повернено до викликаючого. Аргументи передаються у вираз конструктора класу. Якщо базовий клас має метод :meth:`__init__`, метод :meth:`__init__` похідного класу, якщо такий є, повинен явно викликати його, щоб забезпечити правильну ініціалізацію частини базового класу примірника; наприклад: ``super().__init__([args...])``.

source: Because :meth:`__new__` and :meth:`__init__` work together in constructing objects (:meth:`__new__` to create it, and :meth:`__init__` to customize it), no non-``None`` value may be returned by :meth:`__init__`; doing so will cause a :exc:`TypeError` to be raised at runtime.
uk: Оскільки :meth:`__new__` і :meth:`__init__` працюють разом у створенні об’єктів (:meth:`__new__`, щоб створити його, і :meth:`__init__`, щоб налаштувати його), немає не-``None`` значення може повертати :meth:`__init__`; це призведе до появи :exc:`TypeError` під час виконання.

source: Called when the instance is about to be destroyed. This is also called a finalizer or (improperly) a destructor. If a base class has a :meth:`__del__` method, the derived class's :meth:`__del__` method, if any, must explicitly call it to ensure proper deletion of the base class part of the instance.
uk: Викликається, коли примірник збирається знищити. Це також називається фіналізатором або (неправильно) деструктором. Якщо базовий клас має метод :meth:`__del__`, метод :meth:`__del__` похідного класу, якщо такий є, повинен явно викликати його, щоб забезпечити належне видалення частини базового класу екземпляра.

source: It is possible (though not recommended!) for the :meth:`__del__` method to postpone destruction of the instance by creating a new reference to it. This is called object *resurrection*. It is implementation-dependent whether :meth:`__del__` is called a second time when a resurrected object is about to be destroyed; the current :term:`CPython` implementation only calls it once.
uk: Метод :meth:`__del__` може (хоча і не рекомендується!) відкласти знищення екземпляра шляхом створення нового посилання на нього. Це називається *воскресіння* об'єкта. Це залежить від реалізації, чи :meth:`__del__` викликається вдруге, коли воскреслий об’єкт збирається знищити; поточна реалізація :term:`CPython` викликає його лише один раз.

source: It is not guaranteed that :meth:`__del__` methods are called for objects that still exist when the interpreter exits.
uk: Не гарантується, що методи :meth:`__del__` викликаються для об’єктів, які все ще існують, коли інтерпретатор завершує роботу.

source: ``del x`` doesn't directly call ``x.__del__()`` --- the former decrements the reference count for ``x`` by one, and the latter is only called when ``x``'s reference count reaches zero.
uk: ``del x`` не викликає напряму ``x.__del__()`` --- перший зменшує кількість посилань для ``x`` на одиницю, а останній викликається лише тоді, коли ``x`` кількість посилань досягає нуля.

source: Documentation for the :mod:`gc` module.
uk: Документація для модуля :mod:`gc`.

source: Due to the precarious circumstances under which :meth:`__del__` methods are invoked, exceptions that occur during their execution are ignored, and a warning is printed to ``sys.stderr`` instead. In particular:
uk: Через ненадійні обставини, за яких викликаються методи :meth:`__del__`, винятки, що виникають під час їх виконання, ігноруються, а попередження друкується в ``sys.stderr``. Зокрема:

source: :meth:`__del__` can be invoked when arbitrary code is being executed, including from any arbitrary thread. If :meth:`__del__` needs to take a lock or invoke any other blocking resource, it may deadlock as the resource may already be taken by the code that gets interrupted to execute :meth:`__del__`.
uk: :meth:`__del__` можна викликати, коли виконується довільний код, у тому числі з будь-якого довільного потоку. Якщо :meth:`__del__` потрібно заблокувати або викликати будь-який інший блокуючий ресурс, це може призвести до блокування, оскільки ресурс може вже бути зайнятий кодом, який переривається для виконання :meth:`__del__`.

source: :meth:`__del__` can be executed during interpreter shutdown. As a consequence, the global variables it needs to access (including other modules) may already have been deleted or set to ``None``. Python guarantees that globals whose name begins with a single underscore are deleted from their module before other globals are deleted; if no other references to such globals exist, this may help in assuring that imported modules are still available at the time when the :meth:`__del__` method is called.
uk: :meth:`__del__` можна виконати під час завершення роботи інтерпретатора. Як наслідок, глобальні змінні, до яких він має отримати доступ (включно з іншими модулями), можливо, уже були видалені або встановлені на ``None``. Python гарантує, що глобальні елементи, ім’я яких починається з одного підкреслення, будуть видалені з їхнього модуля перед видаленням інших глобальних елементів; якщо немає інших посилань на такі глобали, це може допомогти впевнитися, що імпортовані модулі все ще доступні під час виклику методу :meth:`__del__`.

source: Called by the :func:`repr` built-in function to compute the "official" string representation of an object. If at all possible, this should look like a valid Python expression that could be used to recreate an object with the same value (given an appropriate environment). If this is not possible, a string of the form ``<...some useful description...>`` should be returned. The return value must be a string object. If a class defines :meth:`__repr__` but not :meth:`__str__`, then :meth:`__repr__` is also used when an "informal" string representation of instances of that class is required.
uk: Викликається вбудованою функцією :func:`repr` для обчислення "офіційного" рядкового представлення об’єкта. Якщо це взагалі можливо, це має виглядати як дійсний вираз Python, який можна використати для відтворення об’єкта з тим самим значенням (за умови відповідного середовища). Якщо це неможливо, слід повернути рядок у формі ``<...some useful description...>``. Повернене значення має бути рядковим об’єктом. Якщо клас визначає :meth:`__repr__`, але не :meth:`__str__`, тоді :meth:`__repr__` також використовується, коли потрібне "неформальне" рядкове представлення екземплярів цього класу.

source: This is typically used for debugging, so it is important that the representation is information-rich and unambiguous.
uk: Це зазвичай використовується для налагодження, тому важливо, щоб представлення було насиченим інформацією та однозначним.

source: Called by :func:`str(object) <str>` and the built-in functions :func:`format` and :func:`print` to compute the "informal" or nicely printable string representation of an object. The return value must be a :ref:`string <textseq>` object.
uk: Викликається :func:`str(object) <str>` і вбудованими функціями :func:`format` і :func:`print` для обчислення "неформального" або зручного для друку рядкового представлення об’єкта. Повернене значення має бути об’єктом :ref:`string <textseq>`.

source: This method differs from :meth:`object.__repr__` in that there is no expectation that :meth:`__str__` return a valid Python expression: a more convenient or concise representation can be used.
uk: Цей метод відрізняється від :meth:`object.__repr__` тим, що не очікується, що :meth:`__str__` поверне дійсний вираз Python: можна використовувати більш зручне або стисле представлення.

source: The default implementation defined by the built-in type :class:`object` calls :meth:`object.__repr__`.
uk: Стандартна реалізація, визначена вбудованим типом :class:`object`, викликає :meth:`object.__repr__`.

source: Called by :ref:`bytes <func-bytes>` to compute a byte-string representation of an object. This should return a :class:`bytes` object.
uk: Викликається :ref:`bytes <func-bytes>` для обчислення байтового представлення об’єкта. Це має повернути об’єкт :class:`bytes`.

source: Called by the :func:`format` built-in function, and by extension, evaluation of :ref:`formatted string literals <f-strings>` and the :meth:`str.format` method, to produce a "formatted" string representation of an object. The *format_spec* argument is a string that contains a description of the formatting options desired. The interpretation of the *format_spec* argument is up to the type implementing :meth:`__format__`, however most classes will either delegate formatting to one of the built-in types, or use a similar formatting option syntax.
uk: Викликається вбудованою функцією :func:`format` і за допомогою розширення обчислення :ref:`форматованих рядкових літералів <f-strings>` і методу :meth:`str.format`, щоб створити "відформатований" рядковий представлення об'єкт. Аргумент *format_spec* — це рядок, який містить опис бажаних параметрів форматування. Інтерпретація аргументу *format_spec* залежить від типу, що реалізує :meth:`__format__`, проте більшість класів або делегують форматування одному з вбудованих типів, або використовують подібний синтаксис параметрів форматування.

source: See :ref:`formatspec` for a description of the standard formatting syntax.
uk: Перегляньте :ref:`formatspec` для опису стандартного синтаксису форматування.

source: The return value must be a string object.
uk: Повернене значення має бути рядковим об’єктом.

source: The __format__ method of ``object`` itself raises a :exc:`TypeError` if passed any non-empty string.
uk: Сам метод __format__ ``object`` викликає :exc:`TypeError`, якщо передати будь-який непорожній рядок.

source: ``object.__format__(x, '')`` is now equivalent to ``str(x)`` rather than ``format(str(x), '')``.
uk: ``object.__format__(x, '')`` тепер еквівалентний ``str(x)``, а не ``format(str(x), '')``.

source: These are the so-called "rich comparison" methods. The correspondence between operator symbols and method names is as follows: ``x<y`` calls ``x.__lt__(y)``, ``x<=y`` calls ``x.__le__(y)``, ``x==y`` calls ``x.__eq__(y)``, ``x!=y`` calls ``x.__ne__(y)``, ``x>y`` calls ``x.__gt__(y)``, and ``x>=y`` calls ``x.__ge__(y)``.
uk: Це так звані методи "багатого порівняння". Відповідність між символами оператора та назвами методів така: ``x <y`` calls ``x.__lt__(y)``, ``x<=y`` calls ``x.__le__(y)``, ``x==y`` calls ``x.__eq__(y)``, ``x!=y`` calls ``x.__ne__(y)``, ``x> y`` викликає ``x.__gt__(y)``, а ``x>=y`` викликає ``x.__ge__(y)``.

source: A rich comparison method may return the singleton ``NotImplemented`` if it does not implement the operation for a given pair of arguments. By convention, ``False`` and ``True`` are returned for a successful comparison. However, these methods can return any value, so if the comparison operator is used in a Boolean context (e.g., in the condition of an ``if`` statement), Python will call :func:`bool` on the value to determine if the result is true or false.
uk: Розширений метод порівняння може повертати синглтон ``NotImplemented``, якщо він не реалізує операцію для заданої пари аргументів. Згідно з домовленістю, для успішного порівняння повертаються ``False`` і ``True``. Однак ці методи можуть повертати будь-яке значення, тому, якщо оператор порівняння використовується в логічному контексті (наприклад, в умові оператора if), Python викличе :func:`bool` для значення, щоб визначити якщо результат істинний або хибний.

source: By default, ``object`` implements :meth:`__eq__` by using ``is``, returning ``NotImplemented`` in the case of a false comparison: ``True if x is y else NotImplemented``. For :meth:`__ne__`, by default it delegates to :meth:`__eq__` and inverts the result unless it is ``NotImplemented``. There are no other implied relationships among the comparison operators or default implementations; for example, the truth of ``(x<y or x==y)`` does not imply ``x<=y``. To automatically generate ordering operations from a single root operation, see :func:`functools.total_ordering`.
uk: За замовчуванням ``object`` реалізує :meth:`__eq__` за допомогою ``is``, повертаючи ``NotImplemented`` у випадку хибного порівняння: ``True if x is y else NotImplemented``. Для :meth:`__ne__` за замовчуванням він делегує :meth:`__eq__` та інвертує результат, якщо він не ``NotImplemented``. Серед операторів порівняння чи реалізацій за замовчуванням немає інших припущених зв’язків; наприклад, істинність ``(x<y або x==y)`` не означає ``x<=y``. Щоб автоматично генерувати операції впорядкування з однієї кореневої операції, перегляньте :func:`functools.total_ordering`.

source: See the paragraph on :meth:`__hash__` for some important notes on creating :term:`hashable` objects which support custom comparison operations and are usable as dictionary keys.
uk: Перегляньте параграф про :meth:`__hash__` для деяких важливих приміток щодо створення об’єктів :term:`hashable`, які підтримують спеціальні операції порівняння та використовуються як ключі словника.
