Repository: seanpm2001/python-docs-uk
Catalog: reference/datamodel.po
Languages: uk

source: The items of a list are arbitrary Python objects. Lists are formed by placing a comma-separated list of expressions in square brackets. (Note that there are no special cases needed to form lists of length 0 or 1.)
uk: Елементи списку є довільними об’єктами Python. Списки формуються шляхом розміщення списку виразів, розділених комами, у квадратних дужках. (Зауважте, що для формування списків довжиною 0 або 1 не потрібні особливі випадки.)

source: Byte Arrays
uk: Байтові масиви

source: A bytearray object is a mutable array. They are created by the built-in :func:`bytearray` constructor. Aside from being mutable (and hence unhashable), byte arrays otherwise provide the same interface and functionality as immutable :class:`bytes` objects.
uk: Об’єкт bytearray є змінним масивом. Вони створюються за допомогою вбудованого конструктора :func:`bytearray`. Крім того, що байтові масиви є змінними (і, отже, нехешованими), байтові масиви забезпечують той самий інтерфейс і функціональність, що й незмінні об’єкти :class:`bytes`.

source: The extension module :mod:`array` provides an additional example of a mutable sequence type, as does the :mod:`collections` module.
uk: Модуль розширення :mod:`array` надає додатковий приклад змінного типу послідовності, як і модуль :mod:`collections`.

source: Set types
uk: Встановити типи

source: These represent unordered, finite sets of unique, immutable objects. As such, they cannot be indexed by any subscript. However, they can be iterated over, and the built-in function :func:`len` returns the number of items in a set. Common uses for sets are fast membership testing, removing duplicates from a sequence, and computing mathematical operations such as intersection, union, difference, and symmetric difference.
uk: Вони представляють невпорядковані, кінцеві набори унікальних, незмінних об’єктів. Таким чином, вони не можуть бути індексовані жодним індексом. Однак їх можна повторювати, а вбудована функція :func:`len` повертає кількість елементів у наборі. Набори зазвичай використовують для швидкого тестування членства, видалення дублікатів із послідовності та обчислення математичних операцій, таких як перетин, об’єднання, різниця та симетрична різниця.

source: For set elements, the same immutability rules apply as for dictionary keys. Note that numeric types obey the normal rules for numeric comparison: if two numbers compare equal (e.g., ``1`` and ``1.0``), only one of them can be contained in a set.
uk: Для елементів набору застосовуються ті ж правила незмінності, що й для ключів словника. Зауважте, що числові типи підкоряються звичайним правилам числового порівняння: якщо два числа порівнюються (наприклад, ``1`` і ``1.0``), лише одне з них може міститися в наборі.

source: There are currently two intrinsic set types:
uk: Наразі існує два типи внутрішніх наборів:

source: Sets
uk: Набори

source: These represent a mutable set. They are created by the built-in :func:`set` constructor and can be modified afterwards by several methods, such as :meth:`~set.add`.
uk: Вони представляють змінний набір. Вони створюються за допомогою вбудованого конструктора :func:`set` і можуть бути змінені згодом кількома методами, наприклад :meth:`~set.add`.

source: Frozen sets
uk: Заморожені набори

source: These represent an immutable set. They are created by the built-in :func:`frozenset` constructor. As a frozenset is immutable and :term:`hashable`, it can be used again as an element of another set, or as a dictionary key.
uk: Вони являють собою незмінний набір. Вони створюються за допомогою вбудованого конструктора :func:`frozenset`. Оскільки заморожений набір є незмінним і :term:`hashable`, його можна знову використовувати як елемент іншого набору або як ключ словника.

source: Mappings
uk: Відображення

source: These represent finite sets of objects indexed by arbitrary index sets. The subscript notation ``a[k]`` selects the item indexed by ``k`` from the mapping ``a``; this can be used in expressions and as the target of assignments or :keyword:`del` statements. The built-in function :func:`len` returns the number of items in a mapping.
uk: Вони представляють кінцеві набори об'єктів, індексованих довільними наборами індексів. Підрядкова нотація ``a[k]`` вибирає елемент з індексом ``k`` із відображення ``a``; це можна використовувати у виразах і як ціль присвоєння або операторів :keyword:`del`. Вбудована функція :func:`len` повертає кількість елементів у відображенні.

source: There is currently a single intrinsic mapping type:
uk: Наразі існує єдиний внутрішній тип відображення:

source: Dictionaries
uk: словники

source: These represent finite sets of objects indexed by nearly arbitrary values. The only types of values not acceptable as keys are values containing lists or dictionaries or other mutable types that are compared by value rather than by object identity, the reason being that the efficient implementation of dictionaries requires a key's hash value to remain constant. Numeric types used for keys obey the normal rules for numeric comparison: if two numbers compare equal (e.g., ``1`` and ``1.0``) then they can be used interchangeably to index the same dictionary entry.
uk: Вони представляють кінцеві набори об'єктів, індексованих майже довільними значеннями. Єдиними типами значень, неприйнятними як ключі, є значення, що містять списки, словники чи інші змінні типи, які порівнюються за значенням, а не за ідентичністю об’єкта, тому що для ефективної реалізації словників необхідно, щоб хеш-значення ключа залишалося постійним. Числові типи, що використовуються для ключів, підкоряються звичайним правилам для числового порівняння: якщо два числа порівнюються (наприклад, ``1`` і ``1.0``), тоді їх можна використовувати як взаємозамінні для індексування тієї самої статті словника.

source: Dictionaries preserve insertion order, meaning that keys will be produced in the same order they were added sequentially over the dictionary. Replacing an existing key does not change the order, however removing a key and re-inserting it will add it to the end instead of keeping its old place.
uk: Словники зберігають порядок вставки, тобто ключі створюватимуться в тому самому порядку, у якому вони були послідовно додані до словника. Заміна існуючого ключа не змінює порядок, однак видалення ключа та його повторне вставлення додасть його в кінець замість збереження старого місця.

source: Dictionaries are mutable; they can be created by the ``{...}`` notation (see section :ref:`dict`).
uk: Словники змінні; їх можна створити за допомогою нотації ``{...}`` (див. розділ :ref:`dict`).

source: The extension modules :mod:`dbm.ndbm` and :mod:`dbm.gnu` provide additional examples of mapping types, as does the :mod:`collections` module.
uk: Модулі розширення :mod:`dbm.ndbm` і :mod:`dbm.gnu` надають додаткові приклади типів зіставлення, як і модуль :mod:`collections`.

source: Dictionaries did not preserve insertion order in versions of Python before 3.6. In CPython 3.6, insertion order was preserved, but it was considered an implementation detail at that time rather than a language guarantee.
uk: Словники не зберігали порядок вставки у версіях Python до 3.6. У CPython 3.6 порядок вставки було збережено, але в той час це вважалося деталлю реалізації, а не гарантією мови.

source: Callable types
uk: Викличні типи

source: These are the types to which the function call operation (see section :ref:`calls`) can be applied:
uk: Це типи, до яких можна застосувати операцію виклику функції (див. розділ :ref:`calls`):

source: User-defined functions
uk: Визначені користувачем функції

source: A user-defined function object is created by a function definition (see section :ref:`function`). It should be called with an argument list containing the same number of items as the function's formal parameter list.
uk: Визначений користувачем об’єкт функції створюється визначенням функції (див. розділ :ref:`function`). Її слід викликати зі списком аргументів, що містить таку саму кількість елементів, як і формальний список параметрів функції.

source: Special attributes:
uk: Особливі атрибути:

source: Attribute
uk: Атрибут

source: Meaning
uk: Значення

source: The function's documentation string, or ``None`` if unavailable; not inherited by subclasses.
uk: Рядок документації функції або ``None``, якщо недоступний; не успадковується підкласами.

source: Writable
uk: Можливість запису

source: :attr:`~definition.\ __name__`
uk: :attr:`~визначення.\ __ім'я__`

source: The function's name.
uk: Ім'я функції.

source: :attr:`~definition.\ __qualname__`
uk: :attr:`~визначення.\ __qualname__`

source: The function's :term:`qualified name`.
uk: :term:`qualified name` функції.

source: The name of the module the function was defined in, or ``None`` if unavailable.
uk: Назва модуля, у якому була визначена функція, або "Немає", якщо вона недоступна.

source: A tuple containing default argument values for those arguments that have defaults, or ``None`` if no arguments have a default value.
uk: Кортеж, що містить значення аргументів за замовчуванням для тих аргументів, які мають значення за замовчуванням, або ``None``, якщо жоден аргумент не має значення за замовчуванням.

source: The code object representing the compiled function body.
uk: Об’єкт коду, що представляє скомпільоване тіло функції.

source: A reference to the dictionary that holds the function's global variables --- the global namespace of the module in which the function was defined.
uk: Посилання на словник, який містить глобальні змінні функції --- глобальний простір імен модуля, у якому було визначено функцію.

source: Read-only
uk: Лише для читання

source: :attr:`~object.__dict__`
uk: :attr:`~об’єкт.__dict__`

source: The namespace supporting arbitrary function attributes.
uk: Простір імен, що підтримує довільні атрибути функції.

source: ``None`` or a tuple of cells that contain bindings for the function's free variables. See below for information on the ``cell_contents`` attribute.
uk: ``None`` або кортеж клітинок, які містять зв’язки для вільних змінних функції. Дивіться нижче інформацію про атрибут ``cell_contents``.

source: A dict containing annotations of parameters. The keys of the dict are the parameter names, and ``'return'`` for the return annotation, if provided. For more information on working with this attribute, see :ref:`annotations-howto`.
uk: Dict, що містить анотації параметрів. Ключі dict — це назви параметрів і ``'return'`` для анотації повернення, якщо є. Для отримання додаткової інформації про роботу з цим атрибутом перегляньте :ref:`annotations-howto`.

source: A dict containing defaults for keyword-only parameters.
uk: Dict, що містить параметри за замовчуванням лише для ключових слів.

source: Most of the attributes labelled "Writable" check the type of the assigned value.
uk: Більшість атрибутів із позначкою "Writable" перевіряють тип присвоєного значення.

source: Function objects also support getting and setting arbitrary attributes, which can be used, for example, to attach metadata to functions. Regular attribute dot-notation is used to get and set such attributes. *Note that the current implementation only supports function attributes on user-defined functions. Function attributes on built-in functions may be supported in the future.*
uk: Функціональні об’єкти також підтримують отримання та встановлення довільних атрибутів, які можна використовувати, наприклад, для додавання метаданих до функцій. Для отримання та встановлення таких атрибутів використовується звичайна крапкова нотація. *Зауважте, що поточна реалізація підтримує лише атрибути функцій для визначених користувачем функцій. Атрибути вбудованих функцій можуть підтримуватися в майбутньому.*

source: A cell object has the attribute ``cell_contents``. This can be used to get the value of the cell, as well as set the value.
uk: Об’єкт клітинки має атрибут ``cell_contents``. Це можна використовувати для отримання значення комірки, а також для встановлення значення.

source: Additional information about a function's definition can be retrieved from its code object; see the description of internal types below. The :data:`cell <types.CellType>` type can be accessed in the :mod:`types` module.
uk: Додаткову інформацію про визначення функції можна отримати з її об’єкта коду; дивіться опис внутрішніх типів нижче. Доступ до типу :data:`cell <types.CellType>` можна отримати в модулі :mod:`types`.

source: Instance methods
uk: Методи екземплярів

source: An instance method object combines a class, a class instance and any callable object (normally a user-defined function).
uk: Об’єкт методу екземпляра поєднує в собі клас, екземпляр класу та будь-який об’єкт, що викликається (зазвичай це функція, визначена користувачем).

source: Special read-only attributes: :attr:`__self__` is the class instance object, :attr:`__func__` is the function object; :attr:`__doc__` is the method's documentation (same as ``__func__.__doc__``); :attr:`~definition.__name__` is the method name (same as ``__func__.__name__``); :attr:`__module__` is the name of the module the method was defined in, or ``None`` if unavailable.
uk: Спеціальні атрибути лише для читання: :attr:`__self__` — об’єкт екземпляра класу, :attr:`__func__` — об’єкт функції; :attr:`__doc__` — це документація методу (те саме, що ``__func__.__doc__``); :attr:`~definition.__name__` — назва методу (те саме, що ``__func__.__name__``); :attr:`__module__` — це назва модуля, у якому було визначено метод, або ``None``, якщо воно недоступне.

source: Methods also support accessing (but not setting) the arbitrary function attributes on the underlying function object.
uk: Методи також підтримують доступ (але не встановлення) довільних атрибутів функції на базовому об’єкті функції.

source: User-defined method objects may be created when getting an attribute of a class (perhaps via an instance of that class), if that attribute is a user-defined function object or a class method object.
uk: Визначені користувачем об’єкти методу можуть бути створені під час отримання атрибута класу (можливо, через екземпляр цього класу), якщо цей атрибут є визначеним користувачем об’єктом функції або об’єктом методу класу.

source: When an instance method object is created by retrieving a user-defined function object from a class via one of its instances, its :attr:`__self__` attribute is the instance, and the method object is said to be bound. The new method's :attr:`__func__` attribute is the original function object.
uk: Коли об’єкт методу екземпляра створюється шляхом отримання визначеного користувачем об’єкта функції з класу через один із його екземплярів, його атрибут :attr:`__self__` є екземпляром, а об’єкт методу вважається зв’язаним. Атрибут :attr:`__func__` нового методу є оригінальним об’єктом функції.

source: When an instance method object is created by retrieving a class method object from a class or instance, its :attr:`__self__` attribute is the class itself, and its :attr:`__func__` attribute is the function object underlying the class method.
uk: Коли об’єкт методу екземпляра створюється шляхом отримання об’єкта методу класу з класу або екземпляра, його атрибут :attr:`__self__` є самим класом, а його атрибут :attr:`__func__` є об’єктом функції, що лежить в основі методу класу.

source: When an instance method object is called, the underlying function (:attr:`__func__`) is called, inserting the class instance (:attr:`__self__`) in front of the argument list. For instance, when :class:`C` is a class which contains a definition for a function :meth:`f`, and ``x`` is an instance of :class:`C`, calling ``x.f(1)`` is equivalent to calling ``C.f(x, 1)``.
uk: Коли викликається об’єкт методу екземпляра, викликається базова функція (:attr:`__func__`), вставляючи екземпляр класу (:attr:`__self__`) перед списком аргументів. Наприклад, коли :class:`C` є класом, який містить визначення для функції :meth:`f`, а ``x`` є екземпляром :class:`C`, виклик ``x.f(1 )`` еквівалентно виклику ``C.f(x, 1)``.

source: When an instance method object is derived from a class method object, the "class instance" stored in :attr:`__self__` will actually be the class itself, so that calling either ``x.f(1)`` or ``C.f(1)`` is equivalent to calling ``f(C,1)`` where ``f`` is the underlying function.
uk: Коли об’єкт методу екземпляра походить від об’єкта методу класу, "примірник класу", який зберігається в :attr:`__self__`, фактично буде самим класом, тому виклик x.f(1) або C.f( 1)`` еквівалентно виклику ``f(C,1)``, де ``f`` є основною функцією.

source: Note that the transformation from function object to instance method object happens each time the attribute is retrieved from the instance. In some cases, a fruitful optimization is to assign the attribute to a local variable and call that local variable. Also notice that this transformation only happens for user-defined functions; other callable objects (and all non-callable objects) are retrieved without transformation. It is also important to note that user-defined functions which are attributes of a class instance are not converted to bound methods; this *only* happens when the function is an attribute of the class.
uk: Зауважте, що перетворення з об’єкта функції в об’єкт методу екземпляра відбувається щоразу, коли атрибут отримується з екземпляра. У деяких випадках плідною оптимізацією є призначення атрибута локальній змінній і виклик цієї локальної змінної. Також зауважте, що це перетворення відбувається лише для визначених користувачем функцій; інші викликані об'єкти (і всі невикликові об'єкти) витягуються без перетворення. Також важливо відзначити, що визначені користувачем функції, які є атрибутами примірника класу, не перетворюються на зв’язані методи; це *тільки* трапляється, коли функція є атрибутом класу.

source: Generator functions
uk: Функції генератора

source: A function or method which uses the :keyword:`yield` statement (see section :ref:`yield`) is called a :dfn:`generator function`. Such a function, when called, always returns an :term:`iterator` object which can be used to execute the body of the function: calling the iterator's :meth:`iterator.__next__` method will cause the function to execute until it provides a value using the :keyword:`!yield` statement. When the function executes a :keyword:`return` statement or falls off the end, a :exc:`StopIteration` exception is raised and the iterator will have reached the end of the set of values to be returned.
uk: Функція або метод, який використовує оператор :keyword:`yield` (див. розділ :ref:`yield`), називається :dfn:`функцією-генератором`. Під час виклику така функція завжди повертає об’єкт :term:`iterator`, який можна використовувати для виконання тіла функції: виклик методу :meth:`iterator.__next__` ітератора призведе до виконання функції, доки вона не надасть значення за допомогою оператора :keyword:`!yield`. Коли функція виконує оператор :keyword:`return` або виходить з кінця, виникає виняток :exc:`StopIteration`, і ітератор досягне кінця набору значень, які потрібно повернути.

source: Coroutine functions
uk: Функції співпрограми

source: A function or method which is defined using :keyword:`async def` is called a :dfn:`coroutine function`. Such a function, when called, returns a :term:`coroutine` object. It may contain :keyword:`await` expressions, as well as :keyword:`async with` and :keyword:`async for` statements. See also the :ref:`coroutine-objects` section.
uk: Функція або метод, визначений за допомогою :keyword:`async def`, називається :dfn:`coroutine function`. Така функція під час виклику повертає об’єкт :term:`coroutine`. Він може містити вирази :keyword:`await`, а також оператори :keyword:`async with` і :keyword:`async for`. Дивіться також розділ :ref:`coroutine-objects`.

source: Asynchronous generator functions
uk: Функції асинхронного генератора

source: A function or method which is defined using :keyword:`async def` and which uses the :keyword:`yield` statement is called a :dfn:`asynchronous generator function`. Such a function, when called, returns an :term:`asynchronous iterator` object which can be used in an :keyword:`async for` statement to execute the body of the function.
uk: Функція або метод, визначений за допомогою :keyword:`async def` і який використовує оператор :keyword:`yield`, називається :dfn:`функцією асинхронного генератора`. Під час виклику така функція повертає об’єкт :term:`asynchronous iterator`, який можна використовувати в операторі :keyword:`async for` для виконання тіла функції.

source: Calling the asynchronous iterator's :meth:`aiterator.__anext__ <object.__anext__>` method will return an :term:`awaitable` which when awaited will execute until it provides a value using the :keyword:`yield` expression. When the function executes an empty :keyword:`return` statement or falls off the end, a :exc:`StopAsyncIteration` exception is raised and the asynchronous iterator will have reached the end of the set of values to be yielded.
uk: Виклик методу :meth:`aiterator.__anext__ <object.__anext__>` асинхронного ітератора поверне :term:`awaitable`, який у разі очікування виконуватиметься, доки не надасть значення за допомогою виразу :keyword:`yield`. Коли функція виконує порожній оператор :keyword:`return` або виходить за межі кінця, виникає виняткова ситуація :exc:`StopAsyncIteration`, і асинхронний ітератор досягне кінця набору значень, які потрібно отримати.

source: Built-in functions
uk: Вбудовані функції

source: A built-in function object is a wrapper around a C function. Examples of built-in functions are :func:`len` and :func:`math.sin` (:mod:`math` is a standard built-in module). The number and type of the arguments are determined by the C function. Special read-only attributes: :attr:`__doc__` is the function's documentation string, or ``None`` if unavailable; :attr:`~definition.__name__` is the function's name; :attr:`__self__` is set to ``None`` (but see the next item); :attr:`__module__` is the name of the module the function was defined in or ``None`` if unavailable.
uk: Вбудований об’єкт функції є оболонкою навколо функції C. Прикладами вбудованих функцій є :func:`len` і :func:`math.sin` (:mod:`math` є стандартним вбудованим модулем). Кількість і тип аргументів визначається функцією C. Спеціальні атрибути лише для читання: :attr:`__doc__` — рядок документації функції або ``None``, якщо він недоступний; :attr:`~definition.__name__` це ім'я функції; :attr:`__self__` має значення ``None`` (але дивіться наступний пункт); :attr:`__module__` — це ім’я модуля, у якому була визначена функція, або ``None``, якщо воно недоступне.

source: Built-in methods
uk: Вбудовані методи

source: This is really a different disguise of a built-in function, this time containing an object passed to the C function as an implicit extra argument. An example of a built-in method is ``alist.append()``, assuming *alist* is a list object. In this case, the special read-only attribute :attr:`__self__` is set to the object denoted by *alist*.
uk: Це дійсно інше маскування вбудованої функції, цього разу містить об’єкт, переданий у функцію C як неявний додатковий аргумент. Прикладом вбудованого методу є ``alist.append()``, припускаючи, що *alist* є об’єктом списку. У цьому випадку спеціальний атрибут лише для читання :attr:`__self__` встановлюється для об’єкта, позначеного *alist*.

source: Classes
uk: Заняття
