Repository: seanpm2001/python-docs-uk
Catalog: reference/datamodel.po
Languages: uk

source: Data model
uk: Модель даних

source: Objects, values and types
uk: Об'єкти, значення та типи

source: :dfn:`Objects` are Python's abstraction for data. All data in a Python program is represented by objects or by relations between objects. (In a sense, and in conformance to Von Neumann's model of a "stored program computer", code is also represented by objects.)
uk: :dfn:`Об’єкти` — це абстракція Python для даних. Усі дані в програмі Python представлені об’єктами або зв’язками між об’єктами. (У певному сенсі та відповідно до моделі фон Неймана "комп’ютера зі збереженою програмою" код також представлений об’єктами.)

source: Every object has an identity, a type and a value. An object's *identity* never changes once it has been created; you may think of it as the object's address in memory. The ':keyword:`is`' operator compares the identity of two objects; the :func:`id` function returns an integer representing its identity.
uk: Кожен об’єкт має ідентифікатор, тип і значення. *Ідентичність* об'єкта ніколи не змінюється після його створення; ви можете думати про це як про адресу об'єкта в пам'яті. Оператор ':keyword:`is`' порівнює ідентичність двох об'єктів; функція :func:`id` повертає ціле число, що представляє його ідентифікатор.

source: For CPython, ``id(x)`` is the memory address where ``x`` is stored.
uk: Для CPython ``id(x)`` — це адреса пам’яті, де зберігається ``x``.

source: An object's type determines the operations that the object supports (e.g., "does it have a length?") and also defines the possible values for objects of that type. The :func:`type` function returns an object's type (which is an object itself). Like its identity, an object's :dfn:`type` is also unchangeable. [#]_
uk: Тип об’єкта визначає операції, які об’єкт підтримує (наприклад, "чи має він довжину?"), а також визначає можливі значення для об’єктів цього типу. Функція :func:`type` повертає тип об’єкта (який сам є об’єктом). Як і його ідентифікатор, :dfn:`type` об’єкта також не змінюється. [#]_

source: The *value* of some objects can change. Objects whose value can change are said to be *mutable*; objects whose value is unchangeable once they are created are called *immutable*. (The value of an immutable container object that contains a reference to a mutable object can change when the latter's value is changed; however the container is still considered immutable, because the collection of objects it contains cannot be changed. So, immutability is not strictly the same as having an unchangeable value, it is more subtle.) An object's mutability is determined by its type; for instance, numbers, strings and tuples are immutable, while dictionaries and lists are mutable.
uk: *Значення* деяких об'єктів може змінюватися. Об'єкти, чиє значення може змінюватися, називаються *змінними*; об'єкти, значення яких не змінюються після їх створення, називаються *незмінними*. (Значення незмінного об’єкта-контейнера, що містить посилання на змінний об’єкт, може змінюватися, коли змінюється значення останнього; однак контейнер усе ще вважається незмінним, оскільки набір об’єктів, який він містить, не можна змінити. Таким чином, незмінність не є строго те саме, що має незмінне значення, воно більш тонке.) Змінність об'єкта визначається його типом; наприклад, числа, рядки та кортежі незмінні, тоді як словники та списки змінні.

source: Objects are never explicitly destroyed; however, when they become unreachable they may be garbage-collected. An implementation is allowed to postpone garbage collection or omit it altogether --- it is a matter of implementation quality how garbage collection is implemented, as long as no objects are collected that are still reachable.
uk: Об'єкти ніколи не знищуються явно; однак, коли вони стають недоступними, вони можуть бути зібрані сміттям. Реалізації дозволено відкладати збирання сміття або взагалі опускати його --- це питання якості реалізації, як реалізовано збирання сміття, доки не збираються об’єкти, які все ще доступні.

source: CPython currently uses a reference-counting scheme with (optional) delayed detection of cyclically linked garbage, which collects most objects as soon as they become unreachable, but is not guaranteed to collect garbage containing circular references. See the documentation of the :mod:`gc` module for information on controlling the collection of cyclic garbage. Other implementations act differently and CPython may change. Do not depend on immediate finalization of objects when they become unreachable (so you should always close files explicitly).
uk: Наразі CPython використовує схему підрахунку посилань із (необов’язковим) відкладеним виявленням циклічно пов’язаного сміття, яка збирає більшість об’єктів, щойно вони стають недоступними, але не гарантовано збирає сміття, що містить циклічні посилання. Перегляньте документацію модуля :mod:`gc` для отримання інформації про керування збиранням циклічного сміття. Інші реалізації діють інакше, і CPython може змінитися. Не покладайтеся на негайну фіналізацію об’єктів, коли вони стають недоступними (тому ви завжди повинні явно закривати файли).

source: Note that the use of the implementation's tracing or debugging facilities may keep objects alive that would normally be collectable. Also note that catching an exception with a ':keyword:`try`...\ :keyword:`except`' statement may keep objects alive.
uk: Зауважте, що використання засобів трасування або налагодження реалізації може зберегти живими об’єкти, які зазвичай можна зібрати. Також зауважте, що перехоплення винятку за допомогою оператора ':keyword:`try`...\ :keyword:`except`' може зберегти об'єкти живими.

source: Some objects contain references to "external" resources such as open files or windows. It is understood that these resources are freed when the object is garbage-collected, but since garbage collection is not guaranteed to happen, such objects also provide an explicit way to release the external resource, usually a :meth:`close` method. Programs are strongly recommended to explicitly close such objects. The ':keyword:`try`...\ :keyword:`finally`' statement and the ':keyword:`with`' statement provide convenient ways to do this.
uk: Деякі об’єкти містять посилання на "зовнішні" ресурси, такі як відкриті файли або вікна. Зрозуміло, що ці ресурси звільняються, коли об’єкт збирає сміття, але оскільки збір сміття не гарантовано відбудеться, такі об’єкти також надають явний спосіб звільнити зовнішній ресурс, як правило, метод :meth:`close`. Програмам настійно рекомендується явно закривати такі об’єкти. Оператор ':keyword:`try`...\ :keyword:`finally`' і оператор ':keyword:`with`' пропонують зручні способи зробити це.

source: Some objects contain references to other objects; these are called *containers*. Examples of containers are tuples, lists and dictionaries. The references are part of a container's value. In most cases, when we talk about the value of a container, we imply the values, not the identities of the contained objects; however, when we talk about the mutability of a container, only the identities of the immediately contained objects are implied. So, if an immutable container (like a tuple) contains a reference to a mutable object, its value changes if that mutable object is changed.
uk: Деякі об'єкти містять посилання на інші об'єкти; вони називаються *контейнерами*. Прикладами контейнерів є кортежі, списки та словники. Посилання є частиною значення контейнера. У більшості випадків, коли ми говоримо про значення контейнера, ми маємо на увазі значення, а не ідентифікацію об’єктів, що містяться; однак, коли ми говоримо про мінливість контейнера, мається на увазі лише ідентичність об’єктів, які безпосередньо містяться. Отже, якщо незмінний контейнер (наприклад, кортеж) містить посилання на змінний об’єкт, його значення змінюється, якщо змінюється цей змінний об’єкт.

source: Types affect almost all aspects of object behavior. Even the importance of object identity is affected in some sense: for immutable types, operations that compute new values may actually return a reference to any existing object with the same type and value, while for mutable objects this is not allowed. E.g., after ``a = 1; b = 1``, ``a`` and ``b`` may or may not refer to the same object with the value one, depending on the implementation, but after ``c = []; d = []``, ``c`` and ``d`` are guaranteed to refer to two different, unique, newly created empty lists. (Note that ``c = d = []`` assigns the same object to both ``c`` and ``d``.)
uk: Типи впливають майже на всі аспекти поведінки об'єктів. Навіть важливість ідентичності об’єкта в певному сенсі вплинула: для незмінних типів операції, які обчислюють нові значення, можуть фактично повернути посилання на будь-який існуючий об’єкт з тим самим типом і значенням, тоді як для змінних об’єктів це неприпустимо. Наприклад, після ``a = 1; b = 1``, ``a`` і ``b`` можуть або не можуть посилатися на той самий об’єкт зі значенням один, залежно від реалізації, але після ``c = []; d = []``, ``c`` і ``d`` гарантовано посилаються на два різні, унікальні, щойно створені порожні списки. (Зверніть увагу, що ``c = d = []`` призначає той самий об’єкт як ``c``, так і ``d``.)

source: The standard type hierarchy
uk: Стандартна ієрархія типів

source: Below is a list of the types that are built into Python. Extension modules (written in C, Java, or other languages, depending on the implementation) can define additional types. Future versions of Python may add types to the type hierarchy (e.g., rational numbers, efficiently stored arrays of integers, etc.), although such additions will often be provided via the standard library instead.
uk: Нижче наведено список типів, вбудованих у Python. Модулі розширення (написані мовами C, Java або іншими мовами, залежно від реалізації) можуть визначати додаткові типи. Майбутні версії Python можуть додавати типи до ієрархії типів (наприклад, раціональні числа, ефективно збережені масиви цілих чисел тощо), хоча такі доповнення часто надаватимуться через стандартну бібліотеку.

source: Some of the type descriptions below contain a paragraph listing 'special attributes.' These are attributes that provide access to the implementation and are not intended for general use. Their definition may change in the future.
uk: Деякі з наведених нижче описів типів містять абзац із переліком "спеціальних атрибутів". Це атрибути, які надають доступ до реалізації і не призначені для загального використання. У майбутньому їх визначення може змінитися.

source: None
uk: Жодного

source: This type has a single value. There is a single object with this value. This object is accessed through the built-in name ``None``. It is used to signify the absence of a value in many situations, e.g., it is returned from functions that don't explicitly return anything. Its truth value is false.
uk: Цей тип має єдине значення. Існує єдиний об’єкт із таким значенням. Доступ до цього об’єкта здійснюється через вбудоване ім’я ``None``. Він використовується для позначення відсутності значення в багатьох ситуаціях, наприклад, його повертають функції, які явно нічого не повертають. Його значення істинності є хибним.

source: NotImplemented
uk: Не впроваджений

source: This type has a single value. There is a single object with this value. This object is accessed through the built-in name ``NotImplemented``. Numeric methods and rich comparison methods should return this value if they do not implement the operation for the operands provided. (The interpreter will then try the reflected operation, or some other fallback, depending on the operator.) It should not be evaluated in a boolean context.
uk: Цей тип має єдине значення. Існує єдиний об’єкт із таким значенням. Доступ до цього об’єкта здійснюється через вбудовану назву ``NotImplemented``. Числові методи та методи насиченого порівняння повинні повертати це значення, якщо вони не реалізують операцію для наданих операндів. (Тоді інтерпретатор спробує відображену операцію або інший резервний варіант, залежно від оператора.) Його не слід оцінювати в логічному контексті.

source: See :ref:`implementing-the-arithmetic-operations` for more details.
uk: Перегляньте :ref:`implementing-the-arithmetic-operations` для отримання додаткової інформації.

source: Evaluating ``NotImplemented`` in a boolean context is deprecated. While it currently evaluates as true, it will emit a :exc:`DeprecationWarning`. It will raise a :exc:`TypeError` in a future version of Python.
uk: Оцінка ``NotImplemented`` у логічному контексті застаріла. Хоча наразі він оцінюється як істинний, він видасть :exc:`DeprecationWarning`. Це викличе :exc:`TypeError` у наступній версії Python.

source: Ellipsis
uk: Еліпсис

source: This type has a single value. There is a single object with this value. This object is accessed through the literal ``...`` or the built-in name ``Ellipsis``. Its truth value is true.
uk: Цей тип має єдине значення. Існує єдиний об’єкт із таким значенням. Доступ до цього об’єкта здійснюється за допомогою літералу ``...`` або вбудованої назви ``Ellipsis``. Його істинна цінність є істинною.

source: These are created by numeric literals and returned as results by arithmetic operators and arithmetic built-in functions. Numeric objects are immutable; once created their value never changes. Python numbers are of course strongly related to mathematical numbers, but subject to the limitations of numerical representation in computers.
uk: Вони створюються за допомогою числових літералів і повертаються як результати арифметичними операторами та арифметичними вбудованими функціями. Числові об'єкти незмінні; після створення їхня цінність ніколи не змінюється. Числа Python, звичайно, тісно пов’язані з математичними числами, але підлягають обмеженням числового представлення в комп’ютерах.

source: The string representations of the numeric classes, computed by :meth:`~object.__repr__` and :meth:`~object.__str__`, have the following properties:
uk: Рядкові представлення числових класів, обчислені за допомогою :meth:`~object.__repr__` і :meth:`~object.__str__`, мають такі властивості:

source: They are valid numeric literals which, when passed to their class constructor, produce an object having the value of the original numeric.
uk: Це дійсні числові літерали, які, коли їх передають конструктору класу, створюють об’єкт, що має значення вихідного числа.

source: The representation is in base 10, when possible.
uk: Представлення в базі 10, коли це можливо.

source: Leading zeros, possibly excepting a single zero before a decimal point, are not shown.
uk: Початкові нулі, можливо, за винятком одного нуля перед десятковою комою, не показані.

source: Trailing zeros, possibly excepting a single zero after a decimal point, are not shown.
uk: Кінцеві нулі, можливо, за винятком одного нуля після коми, не відображаються.

source: A sign is shown only when the number is negative.
uk: Знак відображається лише тоді, коли число від’ємне.

source: Python distinguishes between integers, floating point numbers, and complex numbers:
uk: Python розрізняє цілі числа, числа з плаваючою комою та комплексні числа:

source: :class:`numbers.Integral`
uk: :class:`числа.Інтеграл`

source: These represent elements from the mathematical set of integers (positive and negative).
uk: Вони представляють елементи з математичного набору цілих чисел (додатних і від’ємних).

source: There are two types of integers:
uk: Є два типи цілих чисел:

source: Integers (:class:`int`)
uk: Цілі числа (:class:`int`)

source: These represent numbers in an unlimited range, subject to available (virtual) memory only. For the purpose of shift and mask operations, a binary representation is assumed, and negative numbers are represented in a variant of 2's complement which gives the illusion of an infinite string of sign bits extending to the left.
uk: Вони представляють числа в необмеженому діапазоні, що залежить лише від доступної (віртуальної) пам’яті. Для цілей операцій зсуву та маски передбачається двійкове представлення, а від’ємні числа представлені у варіанті доповнення до 2, що створює ілюзію нескінченного рядка знакових бітів, що тягнеться вліво.

source: Booleans (:class:`bool`)
uk: Логічні значення (:class:`bool`)

source: These represent the truth values False and True. The two objects representing the values ``False`` and ``True`` are the only Boolean objects. The Boolean type is a subtype of the integer type, and Boolean values behave like the values 0 and 1, respectively, in almost all contexts, the exception being that when converted to a string, the strings ``"False"`` or ``"True"`` are returned, respectively.
uk: Вони представляють істинні значення False і True. Два об’єкти, що представляють значення ``False`` і ``True``, є єдиними логічними об’єктами. Логічний тип є підтипом цілочисельного типу, а логічні значення поводяться як значення 0 і 1 відповідно майже в усіх контекстах, за винятком того, що при перетворенні на рядок рядки ``"False"`` або ``"True"`` повертаються відповідно.

source: The rules for integer representation are intended to give the most meaningful interpretation of shift and mask operations involving negative integers.
uk: Правила подання цілих чисел мають на меті дати найбільш змістовну інтерпретацію операцій зсуву та маски, що включають від’ємні цілі числа.

source: These represent machine-level double precision floating point numbers. You are at the mercy of the underlying machine architecture (and C or Java implementation) for the accepted range and handling of overflow. Python does not support single-precision floating point numbers; the savings in processor and memory usage that are usually the reason for using these are dwarfed by the overhead of using objects in Python, so there is no reason to complicate the language with two kinds of floating point numbers.
uk: Вони представляють числа з плаваючою комою подвійної точності на рівні машини. Ви залежите від базової архітектури машини (і реалізації C або Java) щодо прийнятного діапазону та обробки переповнення. Python не підтримує числа з плаваючою комою одинарної точності; економія використання процесора та пам’яті, яка зазвичай є причиною їх використання, є меншою за накладні витрати на використання об’єктів у Python, тому немає причин ускладнювати мову двома видами чисел з плаваючою комою.

source: These represent complex numbers as a pair of machine-level double precision floating point numbers. The same caveats apply as for floating point numbers. The real and imaginary parts of a complex number ``z`` can be retrieved through the read-only attributes ``z.real`` and ``z.imag``.
uk: Вони представляють комплексні числа як пару чисел з плаваючою комою подвійної точності на рівні машини. Застосовуються ті самі застереження, що й для чисел з плаваючою комою. Дійсні та уявні частини комплексного числа ``z`` можна отримати за допомогою атрибутів ``z.real`` і ``z.imag``, доступних лише для читання.

source: Sequences
uk: Послідовності

source: These represent finite ordered sets indexed by non-negative numbers. The built-in function :func:`len` returns the number of items of a sequence. When the length of a sequence is *n*, the index set contains the numbers 0, 1, ..., *n*-1. Item *i* of sequence *a* is selected by ``a[i]``.
uk: Вони представляють скінченні впорядковані набори, проіндексовані невід’ємними числами. Вбудована функція :func:`len` повертає кількість елементів послідовності. Якщо довжина послідовності дорівнює *n*, набір індексів містить числа 0, 1, ..., *n*-1. Елемент *i* послідовності *a* вибрано за допомогою ``a[i]``.

source: Sequences also support slicing: ``a[i:j]`` selects all items with index *k* such that *i* ``<=`` *k* ``<`` *j*. When used as an expression, a slice is a sequence of the same type. This implies that the index set is renumbered so that it starts at 0.
uk: Послідовності також підтримують нарізку: ``a[i:j]`` вибирає всі елементи з індексом *k* так, що *i* ``<=`` *k* ``<`` *j*. Коли використовується як вираз, фрагмент є послідовністю одного типу. Це означає, що набір індексів перенумеровано так, що він починається з 0.

source: Some sequences also support "extended slicing" with a third "step" parameter: ``a[i:j:k]`` selects all items of *a* with index *x* where ``x = i + n*k``, *n* ``>=`` ``0`` and *i* ``<=`` *x* ``<`` *j*.
uk: Деякі послідовності також підтримують "розширене нарізання" з третім параметром "кроку": ``a[i:j:k]`` вибирає всі елементи *a* з індексом *x*, де ``x = i + n*k ``, *n* ``>=`` ``0`` і *i* ``<=`` *x* ``<`` *j*.

source: Sequences are distinguished according to their mutability:
uk: Послідовності розрізняють відповідно до їх мінливості:

source: Immutable sequences
uk: Незмінні послідовності

source: An object of an immutable sequence type cannot change once it is created. (If the object contains references to other objects, these other objects may be mutable and may be changed; however, the collection of objects directly referenced by an immutable object cannot change.)
uk: Об’єкт типу незмінної послідовності не може змінюватися після створення. (Якщо об’єкт містить посилання на інші об’єкти, ці інші об’єкти можуть бути змінними та змінюватися; однак набір об’єктів, на який безпосередньо посилається незмінний об’єкт, не може змінитися.)

source: The following types are immutable sequences:
uk: Наступні типи є незмінними послідовностями:

source: Strings
uk: рядки

source: Tuples
uk: Кортежі

source: The items of a tuple are arbitrary Python objects. Tuples of two or more items are formed by comma-separated lists of expressions. A tuple of one item (a 'singleton') can be formed by affixing a comma to an expression (an expression by itself does not create a tuple, since parentheses must be usable for grouping of expressions). An empty tuple can be formed by an empty pair of parentheses.
uk: Елементи кортежу є довільними об’єктами Python. Кортежі з двох або більше елементів утворюються списками виразів, розділених комами. Кортеж з одного елемента ("синглтон") може бути сформований шляхом додавання коми до виразу (вираз сам по собі не створює кортеж, оскільки дужки повинні використовуватися для групування виразів). Порожній кортеж може бути утворений пустою парою круглих дужок.

source: Bytes
uk: Байти

source: A bytes object is an immutable array. The items are 8-bit bytes, represented by integers in the range 0 <= x < 256. Bytes literals (like ``b'abc'``) and the built-in :func:`bytes()` constructor can be used to create bytes objects. Also, bytes objects can be decoded to strings via the :meth:`~bytes.decode` method.
uk: Об’єкт bytes є незмінним масивом. Елементи є 8-бітовими байтами, представленими цілими числами в діапазоні 0 <= x < 256. Байтові літерали (наприклад, ``b'abc``) і вбудований конструктор :func:`bytes()` можуть бути використовується для створення об'єктів bytes. Крім того, об’єкти bytes можна декодувати в рядки за допомогою методу :meth:`~bytes.decode`.

source: Mutable sequences
uk: Змінні послідовності

source: Mutable sequences can be changed after they are created. The subscription and slicing notations can be used as the target of assignment and :keyword:`del` (delete) statements.
uk: Змінні послідовності можна змінювати після їх створення. Нотації підписки та зрізу можна використовувати як ціль операторів призначення та :keyword:`del` (видалити).

source: There are currently two intrinsic mutable sequence types:
uk: На даний момент існує два типи внутрішніх змінних послідовностей:

source: Lists
uk: списки
