Repository: seanpm2001/python-docs-uk
Catalog: reference/datamodel.po
Languages: uk

source: The default behavior for attribute access is to get, set, or delete the attribute from an object's dictionary. For instance, ``a.x`` has a lookup chain starting with ``a.__dict__['x']``, then ``type(a).__dict__['x']``, and continuing through the base classes of ``type(a)`` excluding metaclasses.
uk: Поведінка за умовчанням для доступу до атрибутів полягає в отриманні, установці або видаленні атрибута зі словника об’єкта. Наприклад, ``a.x`` має ланцюжок пошуку, який починається з ``a.__dict__['x']``, потім ``type(a).__dict__['x']`` і продовжується через базові класи типу ``type(a)``, за винятком метакласів.

source: However, if the looked-up value is an object defining one of the descriptor methods, then Python may override the default behavior and invoke the descriptor method instead. Where this occurs in the precedence chain depends on which descriptor methods were defined and how they were called.
uk: Проте, якщо шукане значення є об’єктом, що визначає один із методів дескриптора, тоді Python може замінити поведінку за замовчуванням і замість цього викликати метод дескриптора. Де це відбувається в ланцюжку пріоритетів, залежить від того, які методи дескриптора були визначені та як вони були викликані.

source: The starting point for descriptor invocation is a binding, ``a.x``. How the arguments are assembled depends on ``a``:
uk: Початковою точкою для виклику дескриптора є прив’язка, ``a.x``. Спосіб збирання аргументів залежить від ``a``:

source: Direct Call
uk: Прямий дзвінок

source: The simplest and least common call is when user code directly invokes a descriptor method: ``x.__get__(a)``.
uk: Найпростіший і найменш поширений виклик — це коли код користувача безпосередньо викликає метод дескриптора: ``x.__get__(a)``.

source: Instance Binding
uk: Прив'язка екземпляра

source: If binding to an object instance, ``a.x`` is transformed into the call: ``type(a).__dict__['x'].__get__(a, type(a))``.
uk: У разі прив’язки до екземпляра об’єкта ``a.x`` перетворюється на виклик: ``type(a).__dict__['x'].__get__(a, type(a))``.

source: Class Binding
uk: Прив'язка класу

source: If binding to a class, ``A.x`` is transformed into the call: ``A.__dict__['x'].__get__(None, A)``.
uk: Якщо прив’язується до класу, ``A.x`` перетворюється на виклик: ``A.__dict__['x'].__get__(None, A)``.

source: Super Binding
uk: Супер прив'язка

source: For instance bindings, the precedence of descriptor invocation depends on which descriptor methods are defined. A descriptor can define any combination of :meth:`~object.__get__`, :meth:`~object.__set__` and :meth:`~object.__delete__`. If it does not define :meth:`__get__`, then accessing the attribute will return the descriptor object itself unless there is a value in the object's instance dictionary. If the descriptor defines :meth:`__set__` and/or :meth:`__delete__`, it is a data descriptor; if it defines neither, it is a non-data descriptor. Normally, data descriptors define both :meth:`__get__` and :meth:`__set__`, while non-data descriptors have just the :meth:`__get__` method. Data descriptors with :meth:`__get__` and :meth:`__set__` (and/or :meth:`__delete__`) defined always override a redefinition in an instance dictionary. In contrast, non-data descriptors can be overridden by instances.
uk: Наприклад, прив’язки, пріоритет виклику дескриптора залежить від того, які методи дескриптора визначено. Дескриптор може визначати будь-яку комбінацію :meth:`~object.__get__`, :meth:`~object.__set__` та :meth:`~object.__delete__`. Якщо він не визначає :meth:`__get__`, тоді доступ до атрибута поверне сам об’єкт дескриптора, якщо немає значення в словнику екземплярів об’єкта. Якщо дескриптор визначає :meth:`__set__` та/або :meth:`__delete__`, це дескриптор даних; якщо він не визначає жодного, це дескриптор не даних. Зазвичай дескриптори даних визначають і :meth:`__get__`, і :meth:`__set__`, тоді як дескриптори без даних мають лише метод :meth:`__get__`. Дескриптори даних із визначеними :meth:`__get__` і :meth:`__set__` (і/або :meth:`__delete__`) завжди замінюють перевизначення в словнику екземпляра. Навпаки, дескриптори, не пов’язані з даними, можуть бути перевизначені екземплярами.

source: Python methods (including those decorated with :func:`@staticmethod <staticmethod>` and :func:`@classmethod <classmethod>`) are implemented as non-data descriptors. Accordingly, instances can redefine and override methods. This allows individual instances to acquire behaviors that differ from other instances of the same class.
uk: Методи Python (включаючи ті, що прикрашені :func:`@staticmethod <staticmethod>` і :func:`@classmethod <classmethod>`) реалізовані як дескриптори не даних. Відповідно, екземпляри можуть перевизначати та замінювати методи. Це дозволяє окремим примірникам набувати поведінки, яка відрізняється від інших примірників того самого класу.

source: The :func:`property` function is implemented as a data descriptor. Accordingly, instances cannot override the behavior of a property.
uk: Функція :func:`property` реалізована як дескриптор даних. Відповідно, екземпляри не можуть перевизначати поведінку властивості.

source: *__slots__* allow us to explicitly declare data members (like properties) and deny the creation of :attr:`~object.__dict__` and *__weakref__* (unless explicitly declared in *__slots__* or available in a parent.)
uk: *__slots__* дозволяє нам явно оголошувати елементи даних (наприклад, властивості) і забороняти створення :attr:`~object.__dict__` і *__weakref__* (якщо це явно не оголошено в *__slots__* або доступно в батьківському).

source: The space saved over using :attr:`~object.__dict__` can be significant. Attribute lookup speed can be significantly improved as well.
uk: Місце, збережене за допомогою :attr:`~object.__dict__` може бути значним. Швидкість пошуку атрибутів також можна значно покращити.

source: This class variable can be assigned a string, iterable, or sequence of strings with variable names used by instances. *__slots__* reserves space for the declared variables and prevents the automatic creation of :attr:`~object.__dict__` and *__weakref__* for each instance.
uk: Цій змінній класу можна призначити рядок, ітерацію або послідовність рядків з іменами змінних, які використовуються екземплярами. *__slots__* резервує місце для оголошених змінних і запобігає автоматичному створенню :attr:`~object.__dict__` і *__weakref__* для кожного екземпляра.

source: Notes on using *__slots__*
uk: Примітки щодо використання *__slots__*

source: When inheriting from a class without *__slots__*, the :attr:`~object.__dict__` and *__weakref__* attribute of the instances will always be accessible.
uk: При успадкуванні від класу без *__slots__* атрибути :attr:`~object.__dict__` і *__weakref__* екземплярів завжди будуть доступними.

source: Without a :attr:`~object.__dict__` variable, instances cannot be assigned new variables not listed in the *__slots__* definition. Attempts to assign to an unlisted variable name raises :exc:`AttributeError`. If dynamic assignment of new variables is desired, then add ``'__dict__'`` to the sequence of strings in the *__slots__* declaration.
uk: Без змінної :attr:`~object.__dict__` екземплярам не можна призначати нові змінні, не вказані у визначенні *__slots__*. Спроби призначити змінній, яка не вказана в списку, викликають помилку :exc:`AttributeError`. Якщо потрібне динамічне призначення нових змінних, тоді додайте ``'__dict__'`` до послідовності рядків у декларації *__slots__*.

source: Without a *__weakref__* variable for each instance, classes defining *__slots__* do not support :mod:`weak references <weakref>` to its instances. If weak reference support is needed, then add ``'__weakref__'`` to the sequence of strings in the *__slots__* declaration.
uk: Без змінної *__weakref__* для кожного екземпляра класи, що визначають *__slots__*, не підтримують :mod:`слабкі посилання <weakref>` на його екземпляри. Якщо необхідна підтримка слабких посилань, додайте ``'__weakref__'`` до послідовності рядків у декларації *__slots__*.

source: *__slots__* are implemented at the class level by creating :ref:`descriptors <descriptors>` for each variable name. As a result, class attributes cannot be used to set default values for instance variables defined by *__slots__*; otherwise, the class attribute would overwrite the descriptor assignment.
uk: *__slots__* реалізуються на рівні класу шляхом створення :ref:`дескрипторів <descriptors>` для кожної назви змінної. Як результат, атрибути класу не можна використовувати для встановлення значень за замовчуванням для змінних екземплярів, визначених *__slots__*; інакше атрибут класу перезапише призначення дескриптора.

source: The action of a *__slots__* declaration is not limited to the class where it is defined. *__slots__* declared in parents are available in child classes. However, child subclasses will get a :attr:`~object.__dict__` and *__weakref__* unless they also define *__slots__* (which should only contain names of any *additional* slots).
uk: Дія оголошення *__slots__* не обмежується класом, де воно визначено. *__slots__*, оголошені в батьківських класах, доступні в дочірніх класах. Однак дочірні підкласи отримають :attr:`~object.__dict__` і *__weakref__*, якщо вони також не визначають *__slots__* (які мають містити лише назви будь-яких *додаткових* слотів).

source: If a class defines a slot also defined in a base class, the instance variable defined by the base class slot is inaccessible (except by retrieving its descriptor directly from the base class). This renders the meaning of the program undefined. In the future, a check may be added to prevent this.
uk: Якщо клас визначає слот, також визначений у базовому класі, змінна екземпляра, визначена слотом базового класу, недоступна (за винятком отримання її дескриптора безпосередньо з базового класу). Це робить значення програми невизначеним. У майбутньому для запобігання цьому може бути додана перевірка.

source: Nonempty *__slots__* does not work for classes derived from "variable-length" built-in types such as :class:`int`, :class:`bytes` and :class:`tuple`.
uk: Nonempty *__slots__* не працює для класів, похідних від вбудованих типів "змінної довжини", таких як :class:`int`, :class:`bytes` і :class:`tuple`.

source: Any non-string :term:`iterable` may be assigned to *__slots__*.
uk: Будь-який нерядковий :term:`iterable` може бути призначений *__slots__*.

source: If a :class:`dictionary <dict>` is used to assign *__slots__*, the dictionary keys will be used as the slot names. The values of the dictionary can be used to provide per-attribute docstrings that will be recognised by :func:`inspect.getdoc` and displayed in the output of :func:`help`.
uk: Якщо :class:`dictionary <dict>` використовується для призначення *__slots__*, ключі словника будуть використані як імена слотів. Значення словника можна використовувати для надання рядків документів для кожного атрибута, які розпізнаються :func:`inspect.getdoc` і відображаються у виводі :func:`help`.

source: :attr:`~instance.__class__` assignment works only if both classes have the same *__slots__*.
uk: :attr:`~instance.__class__` призначення працює, лише якщо обидва класи мають однакові *__slots__*.

source: :ref:`Multiple inheritance <tut-multiple>` with multiple slotted parent classes can be used, but only one parent is allowed to have attributes created by slots (the other bases must have empty slot layouts) - violations raise :exc:`TypeError`.
uk: :ref:`Множинне успадкування <tut-multiple>` з кількома батьківськими класами зі слотами можна використовувати, але лише одному з батьківських класів дозволено мати атрибути, створені слотами (інші бази повинні мати порожні макети слотів) - порушення викликають :exc:`TypeError`.

source: If an :term:`iterator` is used for *__slots__* then a :term:`descriptor` is created for each of the iterator's values. However, the *__slots__* attribute will be an empty iterator.
uk: Якщо :term:`iterator` використовується для *__slots__*, то :term:`descriptor` створюється для кожного значення ітератора. Однак атрибут *__slots__* буде порожнім ітератором.

source: Customizing class creation
uk: Налаштування створення класу

source: Whenever a class inherits from another class, :meth:`~object.__init_subclass__` is called on the parent class. This way, it is possible to write classes which change the behavior of subclasses. This is closely related to class decorators, but where class decorators only affect the specific class they're applied to, ``__init_subclass__`` solely applies to future subclasses of the class defining the method.
uk: Щоразу, коли клас успадковує інший клас, :meth:`~object.__init_subclass__` викликається в батьківському класі. Таким чином можна писати класи, які змінюють поведінку підкласів. Це тісно пов’язане з декораторами класів, але де декоратори класів впливають лише на конкретний клас, до якого вони застосовані, ``__init_subclass__`` застосовується виключно до майбутніх підкласів класу, що визначає метод.

source: This method is called whenever the containing class is subclassed. *cls* is then the new subclass. If defined as a normal instance method, this method is implicitly converted to a class method.
uk: Цей метод викликається кожного разу, коли клас, що містить, є підкласом. Тоді *cls* є новим підкласом. Якщо визначено як звичайний метод екземпляра, цей метод неявно перетворюється на метод класу.

source: Keyword arguments which are given to a new class are passed to the parent's class ``__init_subclass__``. For compatibility with other classes using ``__init_subclass__``, one should take out the needed keyword arguments and pass the others over to the base class, as in::
uk: Аргументи ключових слів, надані новому класу, передаються до батьківського класу ``__init_subclass__``. Для сумісності з іншими класами, які використовують ``__init_subclass__``, слід вилучити необхідні ключові аргументи та передати інші до базового класу, як у::

source: The default implementation ``object.__init_subclass__`` does nothing, but raises an error if it is called with any arguments.
uk: Реалізація за замовчуванням ``object.__init_subclass__`` нічого не робить, але викликає помилку, якщо вона викликається з будь-якими аргументами.

source: The metaclass hint ``metaclass`` is consumed by the rest of the type machinery, and is never passed to ``__init_subclass__`` implementations. The actual metaclass (rather than the explicit hint) can be accessed as ``type(cls)``.
uk: Підказка метакласу ``metaclass`` споживається рештою механізму типів і ніколи не передається реалізаціям ``__init_subclass__``. Фактичний метаклас (а не явна підказка) можна отримати як ``type(cls)``.

source: When a class is created, :meth:`type.__new__` scans the class variables and makes callbacks to those with a :meth:`~object.__set_name__` hook.
uk: Коли клас створюється, :meth:`type.__new__` сканує змінні класу та виконує зворотні виклики до тих, що мають хук :meth:`~object.__set_name__`.

source: Automatically called at the time the owning class *owner* is created. The object has been assigned to *name* in that class::
uk: Автоматично викликається під час створення класу власника *owner*. Об’єкту було призначено *name* у цьому класі::

source: If the class variable is assigned after the class is created, :meth:`__set_name__` will not be called automatically. If needed, :meth:`__set_name__` can be called directly::
uk: Якщо змінна класу призначається після створення класу, :meth:`__set_name__` не буде викликатися автоматично. За потреби :meth:`__set_name__` можна викликати безпосередньо::

source: See :ref:`class-object-creation` for more details.
uk: Дивіться :ref:`class-object-creation` для отримання додаткової інформації.

source: Metaclasses
uk: Метакласи

source: By default, classes are constructed using :func:`type`. The class body is executed in a new namespace and the class name is bound locally to the result of ``type(name, bases, namespace)``.
uk: За замовчуванням класи створюються за допомогою :func:`type`. Тіло класу виконується в новому просторі імен, а ім’я класу прив’язується локально до результату ``type(name, bases, namespace)``.

source: The class creation process can be customized by passing the ``metaclass`` keyword argument in the class definition line, or by inheriting from an existing class that included such an argument. In the following example, both ``MyClass`` and ``MySubclass`` are instances of ``Meta``::
uk: Процес створення класу можна налаштувати, передавши аргумент ключового слова ``metaclass`` у рядку визначення класу або успадкувавши від існуючого класу, який містив такий аргумент. У наступному прикладі і ``MyClass``, і ``MySubclass`` є екземплярами ``Meta``::

source: Any other keyword arguments that are specified in the class definition are passed through to all metaclass operations described below.
uk: Будь-які інші ключові аргументи, указані у визначенні класу, передаються до всіх операцій метакласу, описаних нижче.

source: When a class definition is executed, the following steps occur:
uk: Коли виконується визначення класу, відбуваються наступні кроки:

source: MRO entries are resolved;
uk: Записи MRO вирішено;

source: the appropriate metaclass is determined;
uk: визначається відповідний метаклас;

source: the class namespace is prepared;
uk: підготовлено простір імен класу;

source: the class body is executed;
uk: виконується тіло класу;

source: the class object is created.
uk: створюється об'єкт класу.

source: Resolving MRO entries
uk: Вирішення записів MRO

source: If a base that appears in class definition is not an instance of :class:`type`, then an ``__mro_entries__`` method is searched on it. If found, it is called with the original bases tuple. This method must return a tuple of classes that will be used instead of this base. The tuple may be empty, in such case the original base is ignored.
uk: Якщо база, яка з’являється у визначенні класу, не є екземпляром :class:`type`, тоді на ній виконується пошук методу ``__mro_entries__``. Якщо знайдено, воно викликається з вихідним базовим кортежем. Цей метод повинен повертати кортеж класів, які будуть використовуватися замість цієї бази. Кортеж може бути порожнім, у такому випадку вихідна база ігнорується.

source: :pep:`560` - Core support for typing module and generic types
uk: :pep:`560` - Основна підтримка модуля введення та загальних типів

source: Determining the appropriate metaclass
uk: Визначення відповідного метакласу

source: The appropriate metaclass for a class definition is determined as follows:
uk: Відповідний метаклас для визначення класу визначається таким чином:

source: if no bases and no explicit metaclass are given, then :func:`type` is used;
uk: якщо не вказано жодних баз і явного метакласу, то використовується :func:`type`;

source: if an explicit metaclass is given and it is *not* an instance of :func:`type`, then it is used directly as the metaclass;
uk: якщо задано явний метаклас і він *не* є екземпляром :func:`type`, тоді він використовується безпосередньо як метаклас;

source: if an instance of :func:`type` is given as the explicit metaclass, or bases are defined, then the most derived metaclass is used.
uk: якщо екземпляр :func:`type` задано як явний метаклас або визначено основи, то використовується найбільш похідний метаклас.

source: The most derived metaclass is selected from the explicitly specified metaclass (if any) and the metaclasses (i.e. ``type(cls)``) of all specified base classes. The most derived metaclass is one which is a subtype of *all* of these candidate metaclasses. If none of the candidate metaclasses meets that criterion, then the class definition will fail with ``TypeError``.
uk: Найбільш похідний метаклас вибирається з явно визначеного метакласу (якщо такий є) і метакласів (тобто ``type(cls)``) усіх указаних базових класів. Найбільш похідним метакласом є той, який є підтипом *усіх* цих метакласів-кандидатів. Якщо жоден із метакласів-кандидатів не відповідає цьому критерію, визначення класу буде невдалим із ``TypeError``.

source: Preparing the class namespace
uk: Підготовка простору імен класу

source: Once the appropriate metaclass has been identified, then the class namespace is prepared. If the metaclass has a ``__prepare__`` attribute, it is called as ``namespace = metaclass.__prepare__(name, bases, **kwds)`` (where the additional keyword arguments, if any, come from the class definition). The ``__prepare__`` method should be implemented as a :func:`classmethod <classmethod>`. The namespace returned by ``__prepare__`` is passed in to ``__new__``, but when the final class object is created the namespace is copied into a new ``dict``.
uk: Після визначення відповідного метакласу готується простір імен класу. Якщо метаклас має атрибут ``__prepare__``, він викликається як ``namespace = metaclass.__prepare__(name, bases, **kwds)`` (де додаткові ключові аргументи, якщо такі є, надходять із визначення класу) . Метод ``__prepare__`` має бути реалізований як :func:`classmethod <classmethod>`. Простір імен, повернутий ``__prepare__``, передається в ``__new__``, але коли створюється останній об’єкт класу, простір імен копіюється в новий ``dict``.

source: If the metaclass has no ``__prepare__`` attribute, then the class namespace is initialised as an empty ordered mapping.
uk: Якщо метаклас не має атрибута ``__prepare__``, тоді простір імен класу ініціалізується як порожнє впорядковане відображення.

source: :pep:`3115` - Metaclasses in Python 3000
uk: :pep:`3115` - Метакласи в Python 3000

source: Introduced the ``__prepare__`` namespace hook
uk: Представлено хук простору імен ``__prepare__``

source: Executing the class body
uk: Виконання тіла класу

source: The class body is executed (approximately) as ``exec(body, globals(), namespace)``. The key difference from a normal call to :func:`exec` is that lexical scoping allows the class body (including any methods) to reference names from the current and outer scopes when the class definition occurs inside a function.
uk: Тіло класу виконується (приблизно) як ``exec(body, globals(), namespace)``. Ключова відмінність від звичайного виклику :func:`exec` полягає в тому, що лексична область видимості дозволяє тілу класу (включаючи будь-які методи) посилатися на імена з поточної та зовнішньої областей, коли визначення класу відбувається всередині функції.

source: However, even when the class definition occurs inside the function, methods defined inside the class still cannot see names defined at the class scope. Class variables must be accessed through the first parameter of instance or class methods, or through the implicit lexically scoped ``__class__`` reference described in the next section.
uk: Однак, навіть коли визначення класу відбувається всередині функції, методи, визначені всередині класу, все одно не можуть бачити імена, визначені в області класу. Доступ до змінних класу має здійснюватися через перший параметр екземпляра або методів класу, або через неявне посилання ``__class__`` з лексичною областю, описане в наступному розділі.

source: Creating the class object
uk: Створення об'єкта класу

source: Once the class namespace has been populated by executing the class body, the class object is created by calling ``metaclass(name, bases, namespace, **kwds)`` (the additional keywords passed here are the same as those passed to ``__prepare__``).
uk: Коли простір імен класу заповнено виконанням тіла класу, об’єкт класу створюється шляхом виклику ``metaclass(name, bases, namespace, **kwds)`` (додаткові ключові слова, передані тут, такі самі, як ті, що передані` `__prepare__``).
