Repository: seanpm2001/python-docs-uk
Catalog: reference/datamodel.po
Languages: uk

source: When :ref:`subscripting<subscriptions>` a *class*, the special class method :meth:`~object.__class_getitem__` may be called instead of ``__getitem__()``. See :ref:`classgetitem-versus-getitem` for more details.
uk: Коли :ref:`індексує <subscriptions>` *клас*, спеціальний метод класу :meth:`~object.__class_getitem__` може викликатися замість ``__getitem__()``. Перегляньте :ref:`classgetitem-versus-getitem` для отримання додаткової інформації.

source: Called to implement assignment to ``self[key]``. Same note as for :meth:`__getitem__`. This should only be implemented for mappings if the objects support changes to the values for keys, or if new keys can be added, or for sequences if elements can be replaced. The same exceptions should be raised for improper *key* values as for the :meth:`__getitem__` method.
uk: Викликається для реалізації призначення ``self[key]``. Така сама примітка, як і для :meth:`__getitem__`. Це має бути реалізовано лише для відображень, якщо об’єкти підтримують зміни значень для ключів, або якщо можна додати нові ключі, або для послідовностей, якщо елементи можна замінити. Для неправильних значень *key* мають бути викликані ті самі винятки, що й для методу :meth:`__getitem__`.

source: Called to implement deletion of ``self[key]``. Same note as for :meth:`__getitem__`. This should only be implemented for mappings if the objects support removal of keys, or for sequences if elements can be removed from the sequence. The same exceptions should be raised for improper *key* values as for the :meth:`__getitem__` method.
uk: Викликається для реалізації видалення ``self[key]``. Така сама примітка, як і для :meth:`__getitem__`. Це слід застосовувати лише для відображень, якщо об’єкти підтримують видалення ключів, або для послідовностей, якщо елементи можна видалити з послідовності. Для неправильних значень *key* мають бути викликані ті самі винятки, що й для методу :meth:`__getitem__`.

source: Called by :class:`dict`\ .\ :meth:`__getitem__` to implement ``self[key]`` for dict subclasses when key is not in the dictionary.
uk: Викликається :class:`dict`\ .\ :meth:`__getitem__` для реалізації ``self[key]`` для підкласів dict, коли ключа немає в словнику.

source: This method is called when an :term:`iterator` is required for a container. This method should return a new iterator object that can iterate over all the objects in the container. For mappings, it should iterate over the keys of the container.
uk: Цей метод викликається, коли для контейнера потрібен :term:`iterator`. Цей метод має повертати новий об’єкт-ітератор, який може виконувати ітерацію по всіх об’єктах у контейнері. Для зіставлення він повинен перебирати ключі контейнера.

source: Called (if present) by the :func:`reversed` built-in to implement reverse iteration. It should return a new iterator object that iterates over all the objects in the container in reverse order.
uk: Викликається (якщо є) вбудованим :func:`reversed` для реалізації зворотної ітерації. Він має повернути новий об’єкт-ітератор, який обходить усі об’єкти в контейнері у зворотному порядку.

source: If the :meth:`__reversed__` method is not provided, the :func:`reversed` built-in will fall back to using the sequence protocol (:meth:`__len__` and :meth:`__getitem__`). Objects that support the sequence protocol should only provide :meth:`__reversed__` if they can provide an implementation that is more efficient than the one provided by :func:`reversed`.
uk: Якщо метод :meth:`__reversed__` не надано, вбудований :func:`reversed` повернеться до використання протоколу послідовності (:meth:`__len__` і :meth:`__getitem__`). Об’єкти, які підтримують протокол послідовності, повинні надавати лише :meth:`__reversed__`, якщо вони можуть забезпечити ефективнішу реалізацію, ніж та, яку надає :func:`reversed`.

source: The membership test operators (:keyword:`in` and :keyword:`not in`) are normally implemented as an iteration through a container. However, container objects can supply the following special method with a more efficient implementation, which also does not require the object be iterable.
uk: Оператори перевірки членства (:keyword:`in` і :keyword:`not in`) зазвичай реалізуються як ітерація через контейнер. Однак об’єкти-контейнери можуть надавати наступний спеціальний метод з більш ефективною реалізацією, яка також не вимагає, щоб об’єкт був повторюваним.

source: Called to implement membership test operators. Should return true if *item* is in *self*, false otherwise. For mapping objects, this should consider the keys of the mapping rather than the values or the key-item pairs.
uk: Викликано реалізувати оператори перевірки членства. Має повертати true, якщо *item* знаходиться в *self*, і false в іншому випадку. Для відображення об’єктів це має враховувати ключі відображення, а не значення або пари ключ-елемент.

source: For objects that don't define :meth:`__contains__`, the membership test first tries iteration via :meth:`__iter__`, then the old sequence iteration protocol via :meth:`__getitem__`, see :ref:`this section in the language reference <membership-test-details>`.
uk: Для об’єктів, які не визначають :meth:`__contains__`, тест на приналежність спочатку намагається виконати ітерацію через :meth:`__iter__`, потім старий протокол ітерації послідовності через :meth:`__getitem__`, див. :ref:`цей розділ у посилання на мову <membership-test-details>`.

source: Emulating numeric types
uk: Емуляція числових типів

source: The following methods can be defined to emulate numeric objects. Methods corresponding to operations that are not supported by the particular kind of number implemented (e.g., bitwise operations for non-integral numbers) should be left undefined.
uk: Наступні методи можна визначити для емуляції числових об’єктів. Методи, що відповідають операціям, які не підтримуються конкретним видом реалізованого числа (наприклад, побітові операції для нецілісних чисел), слід залишити невизначеними.

source: If one of those methods does not support the operation with the supplied arguments, it should return ``NotImplemented``.
uk: Якщо один із цих методів не підтримує операцію з наданими аргументами, він має повернути ``NotImplemented``.

source: Note that ternary :func:`pow` will not try calling :meth:`__rpow__` (the coercion rules would become too complicated).
uk: Зауважте, що тернарний :func:`pow` не намагатиметься викликати :meth:`__rpow__` (правила примусу стануть надто складними).

source: If the right operand's type is a subclass of the left operand's type and that subclass provides a different implementation of the reflected method for the operation, this method will be called before the left operand's non-reflected method. This behavior allows subclasses to override their ancestors' operations.
uk: Якщо тип правого операнда є підкласом типу лівого операнда і цей підклас забезпечує іншу реалізацію відображеного методу для операції, цей метод буде викликаний перед невідображеним методом лівого операнда. Така поведінка дозволяє підкласам перевизначати операції своїх предків.

source: These methods are called to implement the augmented arithmetic assignments (``+=``, ``-=``, ``*=``, ``@=``, ``/=``, ``//=``, ``%=``, ``**=``, ``<<=``, ``>>=``, ``&=``, ``^=``, ``|=``). These methods should attempt to do the operation in-place (modifying *self*) and return the result (which could be, but does not have to be, *self*). If a specific method is not defined, the augmented assignment falls back to the normal methods. For instance, if *x* is an instance of a class with an :meth:`__iadd__` method, ``x += y`` is equivalent to ``x = x.__iadd__(y)`` . Otherwise, ``x.__add__(y)`` and ``y.__radd__(x)`` are considered, as with the evaluation of ``x + y``. In certain situations, augmented assignment can result in unexpected errors (see :ref:`faq-augmented-assignment-tuple-error`), but this behavior is in fact part of the data model.
uk: Ці методи викликаються для реалізації розширених арифметичних присвоювань (``+=``, ``-=``, ``*=``, ``@=``, ``/=``, ``// =``, ``%=``, ``**=``, ``<<=``, ``>>=``, ``&=``, ``^=``, ``|=``). Ці методи мають спробувати виконати операцію на місці (змінюючи *self*) і повернути результат (який може бути, але не обов’язково, *self*). Якщо конкретний метод не визначено, доповнене призначення повертається до звичайних методів. Наприклад, якщо *x* є екземпляром класу з методом :meth:`__iadd__`, ``x += y`` еквівалентно ``x = x.__iadd__(y)``. В іншому випадку ``x.__add__(y)`` і ``y.__radd__(x)`` розглядаються, як і з оцінкою ``x + y``. У певних ситуаціях доповнене призначення може призвести до неочікуваних помилок (див. :ref:`faq-augmented-assignment-tuple-error`), але така поведінка насправді є частиною моделі даних.

source: Called to implement the unary arithmetic operations (``-``, ``+``, :func:`abs` and ``~``).
uk: Викликається для реалізації унарних арифметичних операцій (``-``, ``+``, :func:`abs` і ``~``).

source: Called to implement the built-in functions :func:`complex`, :func:`int` and :func:`float`. Should return a value of the appropriate type.
uk: Викликається для реалізації вбудованих функцій :func:`complex`, :func:`int` і :func:`float`. Має повертати значення відповідного типу.

source: Called to implement :func:`operator.index`, and whenever Python needs to losslessly convert the numeric object to an integer object (such as in slicing, or in the built-in :func:`bin`, :func:`hex` and :func:`oct` functions). Presence of this method indicates that the numeric object is an integer type. Must return an integer.
uk: Викликається для реалізації :func:`operator.index` і кожного разу, коли Python потребує без втрат перетворити числовий об’єкт у цілочисельний об’єкт (наприклад, у зрізі або у вбудованих :func:`bin`, :func:`hex` і :func:`oct`). Наявність цього методу вказує на те, що числовий об'єкт є цілим типом. Має повертати ціле число.

source: If :meth:`__int__`, :meth:`__float__` and :meth:`__complex__` are not defined then corresponding built-in functions :func:`int`, :func:`float` and :func:`complex` fall back to :meth:`__index__`.
uk: Якщо :meth:`__int__`, :meth:`__float__` і :meth:`__complex__` не визначено, то відповідні вбудовані функції :func:`int`, :func:`float` і :func:`complex` повернутися до :meth:`__index__`.

source: Called to implement the built-in function :func:`round` and :mod:`math` functions :func:`~math.trunc`, :func:`~math.floor` and :func:`~math.ceil`. Unless *ndigits* is passed to :meth:`!__round__` all these methods should return the value of the object truncated to an :class:`~numbers.Integral` (typically an :class:`int`).
uk: Викликається для реалізації вбудованої функції :func:`round` і :mod:`math` функції :func:`~math.trunc`, :func:`~math.floor` і :func:`~math.ceil`. Якщо *ndigits* не передано в :meth:`!__round__`, усі ці методи повинні повертати значення об’єкта, усічене до :class:`~numbers.Integral` (зазвичай :class:`int`).

source: The built-in function :func:`int` falls back to :meth:`__trunc__` if neither :meth:`__int__` nor :meth:`__index__` is defined.
uk: Вбудована функція :func:`int` повертається до :meth:`__trunc__`, якщо не визначено ні :meth:`__int__`, ні :meth:`__index__`.

source: With Statement Context Managers
uk: З менеджерами контексту операторів

source: A :dfn:`context manager` is an object that defines the runtime context to be established when executing a :keyword:`with` statement. The context manager handles the entry into, and the exit from, the desired runtime context for the execution of the block of code. Context managers are normally invoked using the :keyword:`!with` statement (described in section :ref:`with`), but can also be used by directly invoking their methods.
uk: :dfn:`context manager` — це об’єкт, який визначає контекст виконання, який буде встановлено під час виконання оператора :keyword:`with`. Менеджер контексту керує входом і виходом з потрібного контексту виконання для виконання блоку коду. Менеджери контексту зазвичай викликаються за допомогою оператора :keyword:`!with` (описаного в розділі :ref:`with`), але їх також можна використовувати шляхом безпосереднього виклику їхніх методів.

source: Typical uses of context managers include saving and restoring various kinds of global state, locking and unlocking resources, closing opened files, etc.
uk: Типове використання контекстних менеджерів включає збереження та відновлення різних видів глобального стану, блокування та розблокування ресурсів, закриття відкритих файлів тощо.

source: For more information on context managers, see :ref:`typecontextmanager`.
uk: Для отримання додаткової інформації про контекстні менеджери див. :ref:`typecontextmanager`.

source: Enter the runtime context related to this object. The :keyword:`with` statement will bind this method's return value to the target(s) specified in the :keyword:`!as` clause of the statement, if any.
uk: Введіть контекст виконання, пов’язаний із цим об’єктом. Оператор :keyword:`with` прив’яже значення, що повертається цим методом, до цілей(ів), указаних у пункті :keyword:`!as` оператора, якщо такий є.

source: Exit the runtime context related to this object. The parameters describe the exception that caused the context to be exited. If the context was exited without an exception, all three arguments will be :const:`None`.
uk: Вийти з контексту виконання, пов’язаного з цим об’єктом. Параметри описують виняток, який спричинив вихід із контексту. Якщо контекст вийшов без винятку, усі три аргументи будуть :const:`None`.

source: If an exception is supplied, and the method wishes to suppress the exception (i.e., prevent it from being propagated), it should return a true value. Otherwise, the exception will be processed normally upon exit from this method.
uk: Якщо надається виняток, і метод хоче придушити виняток (тобто запобігти його розповсюдженню), він повинен повернути істинне значення. В іншому випадку виняток буде оброблено звичайним чином після виходу з цього методу.

source: Note that :meth:`__exit__` methods should not reraise the passed-in exception; this is the caller's responsibility.
uk: Зверніть увагу, що методи :meth:`__exit__` не повинні повторно викликати переданий виняток; це відповідальність абонента.

source: :pep:`343` - The "with" statement
uk: :pep:`343` - оператор "з".

source: The specification, background, and examples for the Python :keyword:`with` statement.
uk: Специфікація, передумови та приклади оператора Python :keyword:`with`.

source: Customizing positional arguments in class pattern matching
uk: Налаштування позиційних аргументів у відповідності шаблону класу

source: When using a class name in a pattern, positional arguments in the pattern are not allowed by default, i.e. ``case MyClass(x, y)`` is typically invalid without special support in ``MyClass``. To be able to use that kind of patterns, the class needs to define a *__match_args__* attribute.
uk: Під час використання назви класу в шаблоні позиційні аргументи в шаблоні не дозволені за замовчуванням, тобто ``case MyClass(x, y)`` зазвичай недійсний без спеціальної підтримки в ``MyClass``. Щоб мати можливість використовувати такі шаблони, клас повинен визначити атрибут *__match_args__*.

source: This class variable can be assigned a tuple of strings. When this class is used in a class pattern with positional arguments, each positional argument will be converted into a keyword argument, using the corresponding value in *__match_args__* as the keyword. The absence of this attribute is equivalent to setting it to ``()``.
uk: Цій змінній класу можна призначити кортеж рядків. Коли цей клас використовується в шаблоні класу з позиційними аргументами, кожен позиційний аргумент буде перетворено в аргумент ключового слова, використовуючи відповідне значення в *__match_args__* як ключове слово. Відсутність цього атрибута еквівалентна встановленню для нього значення ``()``.

source: For example, if ``MyClass.__match_args__`` is ``("left", "center", "right")`` that means that ``case MyClass(x, y)`` is equivalent to ``case MyClass(left=x, center=y)``. Note that the number of arguments in the pattern must be smaller than or equal to the number of elements in *__match_args__*; if it is larger, the pattern match attempt will raise a :exc:`TypeError`.
uk: Наприклад, якщо ``MyClass.__match_args__`` є ``("left", "center", "right")``, це означає, що ``case MyClass(x, y)`` еквівалентний ``case MyClass (ліворуч=x, центр=y)``. Зверніть увагу, що кількість аргументів у шаблоні має бути меншою або дорівнювати кількості елементів у *__match_args__*; якщо він більший, спроба збігу шаблону викличе :exc:`TypeError`.

source: :pep:`634` - Structural Pattern Matching
uk: :pep:`634` - зіставлення структурних шаблонів

source: The specification for the Python ``match`` statement.
uk: Специфікація оператора ``match`` Python.

source: Special method lookup
uk: Спеціальний метод пошуку

source: For custom classes, implicit invocations of special methods are only guaranteed to work correctly if defined on an object's type, not in the object's instance dictionary. That behaviour is the reason why the following code raises an exception::
uk: Для користувальницьких класів неявні виклики спеціальних методів гарантовано працюють правильно, лише якщо вони визначені для типу об’єкта, а не в словнику екземплярів об’єкта. Така поведінка є причиною того, що наступний код викликає виняток::

source: The rationale behind this behaviour lies with a number of special methods such as :meth:`~object.__hash__` and :meth:`~object.__repr__` that are implemented by all objects, including type objects. If the implicit lookup of these methods used the conventional lookup process, they would fail when invoked on the type object itself::
uk: Обґрунтування такої поведінки полягає в ряді спеціальних методів, таких як :meth:`~object.__hash__` і :meth:`~object.__repr__`, які реалізуються всіма об’єктами, включаючи об’єкти типу. Якби неявний пошук цих методів використовував звичайний процес пошуку, вони зазнали б помилки під час виклику в самому об’єкті типу:

source: Incorrectly attempting to invoke an unbound method of a class in this way is sometimes referred to as 'metaclass confusion', and is avoided by bypassing the instance when looking up special methods::
uk: Неправильна спроба викликати незв’язаний метод класу таким чином іноді називається "плутаниною метакласу", і її можна уникнути шляхом обходу екземпляра під час пошуку спеціальних методів:

source: In addition to bypassing any instance attributes in the interest of correctness, implicit special method lookup generally also bypasses the :meth:`~object.__getattribute__` method even of the object's metaclass::
uk: Окрім обходу будь-яких атрибутів екземпляра в інтересах коректності, неявний пошук спеціального методу зазвичай також обходить метод :meth:`~object.__getattribute__` навіть метакласу об’єкта::

source: Bypassing the :meth:`~object.__getattribute__` machinery in this fashion provides significant scope for speed optimisations within the interpreter, at the cost of some flexibility in the handling of special methods (the special method *must* be set on the class object itself in order to be consistently invoked by the interpreter).
uk: Обхід механізму :meth:`~object.__getattribute__` у такий спосіб забезпечує значні можливості для оптимізації швидкості в інтерпретаторі за рахунок певної гнучкості в обробці спеціальних методів (спеціальний метод *має* бути встановлений на об’єкті класу сам для того, щоб бути послідовно викликаним інтерпретатором).

source: Coroutines
uk: Співпрограми

source: Awaitable Objects
uk: Очікувані об'єкти

source: An :term:`awaitable` object generally implements an :meth:`~object.__await__` method. :term:`Coroutine objects <coroutine>` returned from :keyword:`async def` functions are awaitable.
uk: Об’єкт :term:`awaitable` зазвичай реалізує метод :meth:`~object.__await__`. :term:`Очікуються об’єкти співпрограми <coroutine>`, повернуті функціями :keyword:`async def`.

source: Must return an :term:`iterator`. Should be used to implement :term:`awaitable` objects. For instance, :class:`asyncio.Future` implements this method to be compatible with the :keyword:`await` expression.
uk: Має повертати :term:`iterator`. Слід використовувати для реалізації об’єктів :term:`awaitable`. Наприклад, :class:`asyncio.Future` реалізує цей метод для сумісності з виразом :keyword:`await`.

source: :pep:`492` for additional information about awaitable objects.
uk: :pep:`492` для додаткової інформації про очікувані об’єкти.

source: Coroutine Objects
uk: Об’єкти співпрограми

source: :term:`Coroutine objects <coroutine>` are :term:`awaitable` objects. A coroutine's execution can be controlled by calling :meth:`~object.__await__` and iterating over the result. When the coroutine has finished executing and returns, the iterator raises :exc:`StopIteration`, and the exception's :attr:`~StopIteration.value` attribute holds the return value. If the coroutine raises an exception, it is propagated by the iterator. Coroutines should not directly raise unhandled :exc:`StopIteration` exceptions.
uk: :term:`Об’єкти співпрограми <coroutine>` є :term:`awaitable` об’єктами. Виконання співпрограми можна контролювати викликом :meth:`~object.__await__` і повторенням результату. Коли співпрограма завершує виконання та повертається, ітератор викликає :exc:`StopIteration`, а атрибут винятку :attr:`~StopIteration.value` зберігає значення, що повертається. Якщо співпрограма викликає виключення, воно поширюється ітератором. Співпрограми не повинні безпосередньо викликати необроблені винятки :exc:`StopIteration`.

source: Coroutines also have the methods listed below, which are analogous to those of generators (see :ref:`generator-methods`). However, unlike generators, coroutines do not directly support iteration.
uk: Співпрограми також мають наведені нижче методи, аналогічні генераторам (див. :ref:`generator-methods`). Однак, на відміну від генераторів, співпрограми безпосередньо не підтримують ітерацію.

source: It is a :exc:`RuntimeError` to await on a coroutine more than once.
uk: Це :exc:`RuntimeError`, якщо очікувати в співпрограмі більше одного разу.

source: Starts or resumes execution of the coroutine. If *value* is ``None``, this is equivalent to advancing the iterator returned by :meth:`~object.__await__`. If *value* is not ``None``, this method delegates to the :meth:`~generator.send` method of the iterator that caused the coroutine to suspend. The result (return value, :exc:`StopIteration`, or other exception) is the same as when iterating over the :meth:`__await__` return value, described above.
uk: Починає або відновлює виконання співпрограми. Якщо *value* дорівнює ``None``, це еквівалентно просуванню ітератора, який повертає :meth:`~object.__await__`. Якщо *value* не є ``None``, цей метод делегує метод :meth:`~generator.send` ітератора, який викликав призупинення співпрограми. Результат (повернене значення, :exc:`StopIteration` або інший виняток) такий самий, як і під час ітерації по поверненому значенню :meth:`__await__`, описаному вище.
