Repository: seanpm2001/python-docs-uk
Catalog: library/asyncio-llapi-index.po
Languages: uk

source: Low-level API Index
uk: Індекс API низького рівня

source: This page lists all low-level asyncio APIs.
uk: На цій сторінці перераховано всі асинхронні API низького рівня.

source: Obtaining the Event Loop
uk: Отримання циклу подій

source: The **preferred** function to get the running event loop.
uk: **Переважна** функція для отримання запущеного циклу подій.

source: Get an event loop instance (current or via the policy).
uk: Отримати екземпляр циклу подій (поточний або через політику).

source: Set the event loop as current via the current policy.
uk: Установіть цикл подій як поточний за допомогою поточної політики.

source: Create a new event loop.
uk: Створіть новий цикл подій.

source: Examples
uk: Приклади

source: :ref:`Using asyncio.get_running_loop() <asyncio_example_future>`.
uk: :ref:`Використання asyncio.get_running_loop() <asyncio_example_future>`.

source: Event Loop Methods
uk: Методи циклу подій

source: Lifecycle
uk: Життєвий цикл

source: Run a Future/Task/awaitable until complete.
uk: Запустіть Future/Task/waitable до завершення.

source: Run the event loop forever.
uk: Запустити цикл подій назавжди.

source: Stop the event loop.
uk: Зупиніть цикл подій.

source: Close the event loop.
uk: Закрийте цикл подій.

source: Return ``True`` if the event loop is running.
uk: Повертає ``True``, якщо запущено цикл подій.

source: Return ``True`` if the event loop is closed.
uk: Повертає ``True``, якщо цикл події закрито.

source: ``await`` :meth:`loop.shutdown_asyncgens`
uk: ``чекати`` :meth:`loop.shutdown_asyncgens`

source: Close asynchronous generators.
uk: Закрити асинхронні генератори.

source: Debugging
uk: Налагодження

source: Enable or disable the debug mode.
uk: Увімкніть або вимкніть режим налагодження.

source: Get the current debug mode.
uk: Отримати поточний режим налагодження.

source: Scheduling Callbacks
uk: Планування зворотних викликів

source: Invoke a callback soon.
uk: Незабаром викликайте зворотний дзвінок.

source: A thread-safe variant of :meth:`loop.call_soon`.
uk: Потоково-безпечний варіант :meth:`loop.call_soon`.

source: Invoke a callback *after* the given time.
uk: Викликати зворотний виклик *після* вказаного часу.

source: Invoke a callback *at* the given time.
uk: Викликати зворотний виклик *у* вказаний час.

source: Thread/Process Pool
uk: Пул потоків/процесів

source: ``await`` :meth:`loop.run_in_executor`
uk: ``чекати`` :meth:`loop.run_in_executor`

source: Run a CPU-bound or other blocking function in a :mod:`concurrent.futures` executor.
uk: Запустіть пов’язану з ЦП функцію або іншу функцію блокування у виконавці :mod:`concurrent.futures`.

source: Set the default executor for :meth:`loop.run_in_executor`.
uk: Встановити виконавця за замовчуванням для :meth:`loop.run_in_executor`.

source: Tasks and Futures
uk: Завдання та майбутнє

source: Create a :class:`Future` object.
uk: Створіть об’єкт :class:`Future`.

source: Schedule coroutine as a :class:`Task`.
uk: Розклад співпрограми як :class:`Task`.

source: Set a factory used by :meth:`loop.create_task` to create :class:`Tasks <Task>`.
uk: Установіть фабрику, яку використовує :meth:`loop.create_task` для створення :class:`Tasks <Task>`.

source: Get the factory :meth:`loop.create_task` uses to create :class:`Tasks <Task>`.
uk: Отримайте фабрику, яку :meth:`loop.create_task` використовує для створення :class:`Tasks <Task>`.

source: ``await`` :meth:`loop.getaddrinfo`
uk: ``чекати`` :meth:`loop.getaddrinfo`

source: Asynchronous version of :meth:`socket.getaddrinfo`.
uk: Асинхронна версія :meth:`socket.getaddrinfo`.

source: ``await`` :meth:`loop.getnameinfo`
uk: ``чекати`` :meth:`loop.getnameinfo`

source: Asynchronous version of :meth:`socket.getnameinfo`.
uk: Асинхронна версія :meth:`socket.getnameinfo`.

source: Networking and IPC
uk: Мережа та IPC

source: ``await`` :meth:`loop.create_connection`
uk: ``чекати`` :meth:`loop.create_connection`

source: Open a TCP connection.
uk: Відкрийте TCP-з'єднання.

source: ``await`` :meth:`loop.create_server`
uk: ``чекати`` :meth:`loop.create_server`

source: Create a TCP server.
uk: Створіть сервер TCP.

source: ``await`` :meth:`loop.create_unix_connection`
uk: ``чекати`` :meth:`loop.create_unix_connection`

source: Open a Unix socket connection.
uk: Відкрийте підключення сокета Unix.

source: ``await`` :meth:`loop.create_unix_server`
uk: ``чекати`` :meth:`loop.create_unix_server`

source: Create a Unix socket server.
uk: Створіть сокет-сервер Unix.

source: ``await`` :meth:`loop.connect_accepted_socket`
uk: ``чекати`` :meth:`loop.connect_accepted_socket`

source: Wrap a :class:`~socket.socket` into a ``(transport, protocol)`` pair.
uk: Оберніть :class:`~socket.socket` в пару ``(транспорт, протокол)``.

source: ``await`` :meth:`loop.create_datagram_endpoint`
uk: ``чекати`` :meth:`loop.create_datagram_endpoint`

source: Open a datagram (UDP) connection.
uk: Відкрийте з'єднання дейтаграми (UDP).

source: ``await`` :meth:`loop.sendfile`
uk: ``чекати`` :meth:`loop.sendfile`

source: Send a file over a transport.
uk: Надіслати файл через транспорт.

source: ``await`` :meth:`loop.start_tls`
uk: ``чекати`` :meth:`loop.start_tls`

source: Upgrade an existing connection to TLS.
uk: Оновіть наявне підключення до TLS.

source: ``await`` :meth:`loop.connect_read_pipe`
uk: ``чекати`` :meth:`loop.connect_read_pipe`

source: Wrap a read end of a pipe into a ``(transport, protocol)`` pair.
uk: Оберніть зчитований кінець каналу в пару ``(транспорт, протокол)``.

source: ``await`` :meth:`loop.connect_write_pipe`
uk: ``чекати`` :meth:`loop.connect_write_pipe`

source: Wrap a write end of a pipe into a ``(transport, protocol)`` pair.
uk: Оберніть кінець каналу для запису в пару ``(транспорт, протокол)``.

source: Sockets
uk: Сокети

source: ``await`` :meth:`loop.sock_recv`
uk: ``чекати`` :meth:`loop.sock_recv`

source: Receive data from the :class:`~socket.socket`.
uk: Отримувати дані з :class:`~socket.socket`.

source: ``await`` :meth:`loop.sock_recv_into`
uk: ``чекати`` :meth:`loop.sock_recv_into`

source: Receive data from the :class:`~socket.socket` into a buffer.
uk: Отримувати дані з :class:`~socket.socket` в буфер.

source: ``await`` :meth:`loop.sock_sendall`
uk: ``чекати`` :meth:`loop.sock_sendall`

source: Send data to the :class:`~socket.socket`.
uk: Надсилайте дані до :class:`~socket.socket`.

source: ``await`` :meth:`loop.sock_connect`
uk: ``чекати`` :meth:`loop.sock_connect`

source: Connect the :class:`~socket.socket`.
uk: Підключіть :class:`~socket.socket`.

source: ``await`` :meth:`loop.sock_accept`
uk: ``чекати`` :meth:`loop.sock_accept`

source: Accept a :class:`~socket.socket` connection.
uk: Прийміть підключення :class:`~socket.socket`.

source: ``await`` :meth:`loop.sock_sendfile`
uk: ``чекати`` :meth:`loop.sock_sendfile`

source: Send a file over the :class:`~socket.socket`.
uk: Надішліть файл через :class:`~socket.socket`.

source: Start watching a file descriptor for read availability.
uk: Почніть переглядати файловий дескриптор на наявність читання.

source: Stop watching a file descriptor for read availability.
uk: Припиніть перегляд дескриптора файлу на доступність читання.

source: Start watching a file descriptor for write availability.
uk: Почніть переглядати файловий дескриптор на доступність запису.

source: Stop watching a file descriptor for write availability.
uk: Припиніть стежити за доступністю запису в дескрипторі файлів.

source: Unix Signals
uk: Сигнали Unix

source: Add a handler for a :mod:`signal`.
uk: Додайте обробник для :mod:`signal`.

source: Remove a handler for a :mod:`signal`.
uk: Видаліть обробник для :mod:`signal`.

source: Subprocesses
uk: Підпроцеси

source: Spawn a subprocess.
uk: Створити підпроцес.

source: Spawn a subprocess from a shell command.
uk: Створити підпроцес із команди оболонки.

source: Error Handling
uk: Обробка помилок

source: Call the exception handler.
uk: Виклик обробника винятків.

source: Set a new exception handler.
uk: Встановити новий обробник винятків.

source: Get the current exception handler.
uk: Отримати поточний обробник винятків.

source: The default exception handler implementation.
uk: Реалізація обробника винятків за замовчуванням.

source: :ref:`Using loop.call_later() <asyncio_example_call_later>`.
uk: :ref:`Використання loop.call_later() <asyncio_example_call_later>`.

source: Using ``loop.create_connection()`` to implement :ref:`an echo-client <asyncio_example_tcp_echo_client_protocol>`.
uk: Використання ``loop.create_connection()`` для реалізації :ref:`ехо-клієнта <asyncio_example_tcp_echo_client_protocol>`.

source: Using ``loop.create_connection()`` to :ref:`connect a socket <asyncio_example_create_connection>`.
uk: Використання ``loop.create_connection()`` для :ref:`підключення сокета <asyncio_example_create_connection>`.

source: :ref:`Using add_reader() to watch an FD for read events <asyncio_example_watch_fd>`.
uk: :ref:`Використання add_reader() для перегляду FD для подій читання <asyncio_example_watch_fd>`.

source: :ref:`Using loop.add_signal_handler() <asyncio_example_unix_signals>`.
uk: :ref:`Використання loop.add_signal_handler() <asyncio_example_unix_signals>`.

source: :ref:`Using loop.subprocess_exec() <asyncio_example_subprocess_proto>`.
uk: :ref:`Використання loop.subprocess_exec() <asyncio_example_subprocess_proto>`.

source: Transports
uk: Транспорти

source: All transports implement the following methods:
uk: Усі транспорти реалізують такі методи:

source: Close the transport.
uk: Закрити транспорт.

source: Return ``True`` if the transport is closing or is closed.
uk: Повертає ``True``, якщо транспорт закривається або закритий.

source: Request for information about the transport.
uk: Запит інформації про транспорт.

source: Set a new protocol.
uk: Встановіть новий протокол.

source: Return the current protocol.
uk: Повернути поточний протокол.

source: Transports that can receive data (TCP and Unix connections, pipes, etc). Returned from methods like :meth:`loop.create_connection`, :meth:`loop.create_unix_connection`, :meth:`loop.connect_read_pipe`, etc:
uk: Транспорти, які можуть отримувати дані (з’єднання TCP і Unix, канали тощо). Повертається з таких методів, як :meth:`loop.create_connection`, :meth:`loop.create_unix_connection`, :meth:`loop.connect_read_pipe` тощо:

source: Read Transports
uk: Читайте Транспорт

source: Return ``True`` if the transport is receiving.
uk: Повертає ``True``, якщо транспорт отримує.

source: Pause receiving.
uk: Призупинити отримання.

source: Resume receiving.
uk: Відновити прийом.

source: Transports that can Send data (TCP and Unix connections, pipes, etc). Returned from methods like :meth:`loop.create_connection`, :meth:`loop.create_unix_connection`, :meth:`loop.connect_write_pipe`, etc:
uk: Транспорти, які можуть надсилати дані (з’єднання TCP і Unix, канали тощо). Повертається з таких методів, як :meth:`loop.create_connection`, :meth:`loop.create_unix_connection`, :meth:`loop.connect_write_pipe` тощо:

source: Write Transports
uk: Напишіть Транспорти

source: Write data to the transport.
uk: Записати дані в транспорт.

source: Write buffers to the transport.
uk: Записати буфери в транспорт.

source: Return :const:`True` if the transport supports sending EOF.
uk: Повертає :const:`True`, якщо транспорт підтримує надсилання EOF.

source: Close and send EOF after flushing buffered data.
uk: Закрийте та надішліть EOF після очищення буферизованих даних.

source: Close the transport immediately.
uk: Негайно закрити транспорт.

source: Return high and low water marks for write flow control.
uk: Повернути верхні та нижні водяні позначки для керування потоком запису.

source: Set new high and low water marks for write flow control.
uk: Встановіть нові позначки верхнього та нижнього рівня для контролю потоку запису.

source: Transports returned by :meth:`loop.create_datagram_endpoint`:
uk: Транспорти, повернуті :meth:`loop.create_datagram_endpoint`:

source: Datagram Transports
uk: Транспортування дейтаграм

source: Send data to the remote peer.
uk: Надсилати дані віддаленому одноранговому пристрою.

source: Low-level transport abstraction over subprocesses. Returned by :meth:`loop.subprocess_exec` and :meth:`loop.subprocess_shell`:
uk: Низькорівнева транспортна абстракція над підпроцесами. Повертається :meth:`loop.subprocess_exec` і :meth:`loop.subprocess_shell`:

source: Subprocess Transports
uk: Транспортування підпроцесів

source: Return the subprocess process id.
uk: Повернути ідентифікатор процесу підпроцесу.

source: Return the transport for the requested communication pipe (*stdin*, *stdout*, or *stderr*).
uk: Повернути транспорт для запитуваного каналу зв’язку (*stdin*, *stdout* або *stderr*).

source: Return the subprocess return code.
uk: Повернути код повернення підпроцесу.

source: Kill the subprocess.
uk: Закрийте підпроцес.

source: Send a signal to the subprocess.
uk: Надішліть сигнал підпроцесу.

source: Stop the subprocess.
uk: Зупиніть підпроцес.

source: Kill the subprocess and close all pipes.
uk: Закрийте підпроцес і закрийте всі канали.

source: Protocols
uk: Протоколи

source: Protocol classes can implement the following **callback methods**:
uk: Класи протоколів можуть реалізовувати такі **методи зворотного виклику**:

source: ``callback`` :meth:`connection_made() <BaseProtocol.connection_made>`
uk: ``зворотний виклик`` :meth:`connection_made() <BaseProtocol.connection_made>`

source: Called when a connection is made.
uk: Викликається, коли встановлено з'єднання.

source: ``callback`` :meth:`connection_lost() <BaseProtocol.connection_lost>`
uk: ``зворотний виклик`` :meth:`connection_lost() <BaseProtocol.connection_lost>`

source: Called when the connection is lost or closed.
uk: Викликається, коли з'єднання втрачено або закрито.

source: ``callback`` :meth:`pause_writing() <BaseProtocol.pause_writing>`
uk: ``зворотний виклик`` :meth:`pause_writing() <BaseProtocol.pause_writing>`

source: Called when the transport's buffer goes over the high water mark.
uk: Викликається, коли транспортний буфер перевищує позначку високої води.

source: ``callback`` :meth:`resume_writing() <BaseProtocol.resume_writing>`
uk: ``зворотний виклик`` :meth:`resume_writing() <BaseProtocol.resume_writing>`

source: Called when the transport's buffer drains below the low water mark.
uk: Викликається, коли буфер транспорту стікає нижче позначки низького рівня води.

source: Streaming Protocols (TCP, Unix Sockets, Pipes)
uk: Протоколи потокової передачі (TCP, Unix-сокети, канали)

source: ``callback`` :meth:`data_received() <Protocol.data_received>`
uk: ``зворотний виклик`` :meth:`data_received() <Protocol.data_received>`

source: Called when some data is received.
uk: Викликається при отриманні деяких даних.

source: ``callback`` :meth:`eof_received() <Protocol.eof_received>`
uk: ``зворотний виклик`` :meth:`eof_received() <Protocol.eof_received>`

source: Called when an EOF is received.
uk: Викликається, коли отримано EOF.

source: Buffered Streaming Protocols
uk: Буферизовані потокові протоколи

source: ``callback`` :meth:`get_buffer() <BufferedProtocol.get_buffer>`
uk: ``зворотний виклик`` :meth:`get_buffer() <BufferedProtocol.get_buffer>`

source: Called to allocate a new receive buffer.
uk: Викликається для виділення нового буфера отримання.

source: ``callback`` :meth:`buffer_updated() <BufferedProtocol.buffer_updated>`
uk: ``зворотний виклик`` :meth:`buffer_updated() <BufferedProtocol.buffer_updated>`

source: Called when the buffer was updated with the received data.
uk: Викликається, коли буфер оновлюється отриманими даними.

source: ``callback`` :meth:`eof_received() <BufferedProtocol.eof_received>`
uk: ``зворотний виклик`` :meth:`eof_received() <BufferedProtocol.eof_received>`

source: Datagram Protocols
uk: Протоколи дейтаграм

source: ``callback`` :meth:`datagram_received() <DatagramProtocol.datagram_received>`
uk: ``зворотний виклик`` :meth:`datagram_received() <DatagramProtocol.datagram_received>`

source: Called when a datagram is received.
uk: Викликається, коли отримано дейтаграму.

source: ``callback`` :meth:`error_received() <DatagramProtocol.error_received>`
uk: ``зворотний виклик`` :meth:`error_received() <DatagramProtocol.error_received>`

source: Called when a previous send or receive operation raises an :class:`OSError`.
uk: Викликається, коли попередня операція надсилання чи отримання викликає :class:`OSError`.

source: Subprocess Protocols
uk: Протоколи підпроцесів

source: ``callback`` :meth:`pipe_data_received() <SubprocessProtocol.pipe_data_received>`
uk: ``зворотний виклик`` :meth:`pipe_data_received() <SubprocessProtocol.pipe_data_received>`

source: Called when the child process writes data into its *stdout* or *stderr* pipe.
uk: Викликається, коли дочірній процес записує дані у свій канал *stdout* або *stderr*.

source: ``callback`` :meth:`pipe_connection_lost() <SubprocessProtocol.pipe_connection_lost>`
uk: ``зворотний виклик`` :meth:`pipe_connection_lost() <SubprocessProtocol.pipe_connection_lost>`

source: Called when one of the pipes communicating with the child process is closed.
uk: Викликається, коли одна з труб, що спілкуються з дочірнім процесом, закрита.

source: ``callback`` :meth:`process_exited() <SubprocessProtocol.process_exited>`
uk: ``зворотний виклик`` :meth:`process_exited() <SubprocessProtocol.process_exited>`

source: Called when the child process has exited.
uk: Викликається, коли дочірній процес вийшов.

source: Event Loop Policies
uk: Політики циклу подій

source: Policies is a low-level mechanism to alter the behavior of functions like :func:`asyncio.get_event_loop`. See also the main :ref:`policies section <asyncio-policies>` for more details.
uk: Політики — це механізм низького рівня для зміни поведінки таких функцій, як :func:`asyncio.get_event_loop`. Перегляньте також основний :ref:`розділ правил <asyncio-policies>` для отримання додаткової інформації.

source: Accessing Policies
uk: Доступ до політик

source: Return the current process-wide policy.
uk: Повернути поточну політику для всього процесу.

source: Set a new process-wide policy.
uk: Установіть нову політику для всього процесу.

source: Base class for policy objects.
uk: Базовий клас для об’єктів політики.
