Repository: seanpm2001/python-docs-uk
Catalog: library/asyncore.po
Languages: uk

source: :mod:`asyncore` --- Asynchronous socket handler
uk: :mod:`asyncore` --- обробник асинхронного сокета

source: **Source code:** :source:`Lib/asyncore.py`
uk: **Вихідний код:** :source:`Lib/asyncore.py`

source: This module exists for backwards compatibility only. For new code we recommend using :mod:`asyncio`.
uk: Цей модуль існує лише для зворотної сумісності. Для нового коду ми рекомендуємо використовувати :mod:`asyncio`.

source: This module provides the basic infrastructure for writing asynchronous socket service clients and servers.
uk: Цей модуль надає базову інфраструктуру для написання клієнтів і серверів служби асинхронних сокетів.

source: There are only two ways to have a program on a single processor do "more than one thing at a time." Multi-threaded programming is the simplest and most popular way to do it, but there is another very different technique, that lets you have nearly all the advantages of multi-threading, without actually using multiple threads. It's really only practical if your program is largely I/O bound. If your program is processor bound, then pre-emptive scheduled threads are probably what you really need. Network servers are rarely processor bound, however.
uk: Є лише два способи змусити програму на одному процесорі виконувати "більш ніж одну дію одночасно". Багатопотокове програмування є найпростішим і найпопулярнішим способом зробити це, але існує ще одна зовсім інша техніка, яка дає вам змогу отримати майже всі переваги багатопоточності без фактичного використання кількох потоків. Це дійсно практично, лише якщо ваша програма значною мірою пов’язана з вводом-виводом. Якщо ваша програма пов’язана з процесором, то вам справді потрібні потоки з випереджальним плануванням. Проте мережеві сервери рідко пов’язані з процесором.

source: If your operating system supports the :c:func:`select` system call in its I/O library (and nearly all do), then you can use it to juggle multiple communication channels at once; doing other work while your I/O is taking place in the "background." Although this strategy can seem strange and complex, especially at first, it is in many ways easier to understand and control than multi-threaded programming. The :mod:`asyncore` module solves many of the difficult problems for you, making the task of building sophisticated high-performance network servers and clients a snap. For "conversational" applications and protocols the companion :mod:`asynchat` module is invaluable.
uk: Якщо ваша операційна система підтримує системний виклик :c:func:`select` у своїй бібліотеці вводу-виводу (і майже всі так підтримує), ви можете використовувати її для жонглювання кількома каналами зв’язку одночасно; виконувати іншу роботу, поки ваш ввід/вивід виконується у "фоновому режимі". Хоча ця стратегія може здатися дивною та складною, особливо спочатку, її багато в чому легше зрозуміти та контролювати, ніж багатопотокове програмування. Модуль :mod:`asyncore` вирішує багато складних проблем, роблячи завдання побудови складних високопродуктивних мережевих серверів і клієнтів миттєвим. Для "розмовних" програм і протоколів супутній модуль :mod:`asynchat` є безцінним.

source: The basic idea behind both modules is to create one or more network *channels*, instances of class :class:`asyncore.dispatcher` and :class:`asynchat.async_chat`. Creating the channels adds them to a global map, used by the :func:`loop` function if you do not provide it with your own *map*.
uk: Основна ідея обох модулів полягає у створенні одного або кількох мережевих *каналів*, екземплярів класу :class:`asyncore.dispatcher` і :class:`asynchat.async_chat`. Створення каналів додає їх до глобальної карти, яка використовується функцією :func:`loop`, якщо ви не надаєте їй свою власну *карту*.

source: Once the initial channel(s) is(are) created, calling the :func:`loop` function activates channel service, which continues until the last channel (including any that have been added to the map during asynchronous service) is closed.
uk: Після створення початкового(их) каналу(ів) виклик функції :func:`loop` активує службу каналу, яка продовжується, доки не буде закрито останній канал (включаючи будь-який, який було додано до карти під час асинхронної служби).

source: Enter a polling loop that terminates after count passes or all open channels have been closed. All arguments are optional. The *count* parameter defaults to ``None``, resulting in the loop terminating only when all channels have been closed. The *timeout* argument sets the timeout parameter for the appropriate :func:`~select.select` or :func:`~select.poll` call, measured in seconds; the default is 30 seconds. The *use_poll* parameter, if true, indicates that :func:`~select.poll` should be used in preference to :func:`~select.select` (the default is ``False``).
uk: Введіть цикл опитування, який завершується після проходження підрахунку або закриття всіх відкритих каналів. Усі аргументи необов’язкові. Параметр *count* за замовчуванням має значення ``None``, що призводить до завершення циклу лише після закриття всіх каналів. Аргумент *timeout* встановлює параметр часу очікування для відповідного виклику :func:`~select.select` або :func:`~select.poll`, виміряний у секундах; за замовчуванням 30 секунд. Параметр *use_poll*, якщо він істинний, вказує, що :func:`~select.poll` слід використовувати замість :func:`~select.select` (за замовчуванням ``False``).

source: The *map* parameter is a dictionary whose items are the channels to watch. As channels are closed they are deleted from their map. If *map* is omitted, a global map is used. Channels (instances of :class:`asyncore.dispatcher`, :class:`asynchat.async_chat` and subclasses thereof) can freely be mixed in the map.
uk: Параметр *map* — це словник, елементи якого є каналами для перегляду. Коли канали закриваються, вони видаляються з карти. Якщо *map* опущено, використовується глобальна карта. Канали (екземпляри :class:`asyncore.dispatcher`, :class:`asynchat.async_chat` та їхні підкласи) можна вільно змішувати на карті.

source: The :class:`dispatcher` class is a thin wrapper around a low-level socket object. To make it more useful, it has a few methods for event-handling which are called from the asynchronous loop. Otherwise, it can be treated as a normal non-blocking socket object.
uk: Клас :class:`dispatcher` — це тонка обгортка навколо об’єкта сокета низького рівня. Щоб зробити його більш корисним, він має кілька методів для обробки подій, які викликаються з асинхронного циклу. В іншому випадку його можна розглядати як звичайний неблокуючий об’єкт сокета.

source: The firing of low-level events at certain times or in certain connection states tells the asynchronous loop that certain higher-level events have taken place. For example, if we have asked for a socket to connect to another host, we know that the connection has been made when the socket becomes writable for the first time (at this point you know that you may write to it with the expectation of success). The implied higher-level events are:
uk: Запуск подій низького рівня в певний час або в певних станах з’єднання повідомляє асинхронному циклу, що відбулися певні події вищого рівня. Наприклад, якщо ми запросили сокет для з’єднання з іншим хостом, ми знаємо, що з’єднання було встановлено, коли сокет стане доступним для запису вперше (на цьому етапі ви знаєте, що можете писати в нього з очікуванням успіху ). Передбачувані події вищого рівня:

source: Event
uk: Подія

source: Description
uk: опис

source: Implied by the first read or write event
uk: Передбачено першою подією читання або запису

source: Implied by a read event with no data available
uk: Означається подією читання без доступних даних

source: Implied by a read event on a listening socket
uk: Означається подією читання в сокеті, що прослуховує

source: During asynchronous processing, each mapped channel's :meth:`readable` and :meth:`writable` methods are used to determine whether the channel's socket should be added to the list of channels :c:func:`select`\ ed or :c:func:`poll`\ ed for read and write events.
uk: Під час асинхронної обробки методи кожного зіставленого каналу :meth:`readable` і :meth:`writable` використовуються для визначення того, чи слід додати сокет каналу до списку каналів :c:func:`select`\ ed або :c:func:`poll`\ для подій читання та запису.

source: Thus, the set of channel events is larger than the basic socket events. The full set of methods that can be overridden in your subclass follows:
uk: Таким чином, набір подій каналу більший, ніж подій основного сокета. Нижче наведено повний набір методів, які можна перевизначати у вашому підкласі:

source: Called when the asynchronous loop detects that a :meth:`read` call on the channel's socket will succeed.
uk: Викликається, коли асинхронний цикл виявляє, що виклик :meth:`read` для сокета каналу буде успішним.

source: Called when the asynchronous loop detects that a writable socket can be written. Often this method will implement the necessary buffering for performance. For example::
uk: Викликається, коли асинхронний цикл виявляє, що доступний для запису сокет можна записати. Часто цей метод реалізує необхідну буферизацію для продуктивності. Наприклад::

source: Called when there is out of band (OOB) data for a socket connection. This will almost never happen, as OOB is tenuously supported and rarely used.
uk: Викликається, коли для підключення до сокета є позасмугові (OOB) дані. Цього майже ніколи не станеться, оскільки OOB слабко підтримується і рідко використовується.

source: Called when the active opener's socket actually makes a connection. Might send a "welcome" banner, or initiate a protocol negotiation with the remote endpoint, for example.
uk: Викликається, коли активний сокет відкривача фактично встановлює з’єднання. Наприклад, може надіслати банер "вітання" або ініціювати узгодження протоколу з віддаленою кінцевою точкою.

source: Called when the socket is closed.
uk: Викликається, коли сокет закрито.

source: Called when an exception is raised and not otherwise handled. The default version prints a condensed traceback.
uk: Викликається, коли виникає виняток і не обробляється інакше. Версія за замовчуванням друкує скорочену трасування.

source: Called on listening channels (passive openers) when a connection can be established with a new remote endpoint that has issued a :meth:`connect` call for the local endpoint. Deprecated in version 3.2; use :meth:`handle_accepted` instead.
uk: Викликається на каналах прослуховування (пасивні відкривачі), коли можна встановити з’єднання з новою віддаленою кінцевою точкою, яка випустила виклик :meth:`connect` для локальної кінцевої точки. Застаріло у версії 3.2; замість цього використовуйте :meth:`handle_accepted`.

source: Called on listening channels (passive openers) when a connection has been established with a new remote endpoint that has issued a :meth:`connect` call for the local endpoint. *sock* is a *new* socket object usable to send and receive data on the connection, and *addr* is the address bound to the socket on the other end of the connection.
uk: Викликається на каналах прослуховування (пасивні відкривачі), коли встановлено з’єднання з новою віддаленою кінцевою точкою, яка випустила виклик :meth:`connect` для локальної кінцевої точки. *sock* — це *новий* об’єкт сокета, який можна використовувати для надсилання та отримання даних у з’єднанні, а *addr* — це адреса, прив’язана до сокета на іншому кінці з’єднання.

source: Called each time around the asynchronous loop to determine whether a channel's socket should be added to the list on which read events can occur. The default method simply returns ``True``, indicating that by default, all channels will be interested in read events.
uk: Викликається кожного разу в асинхронному циклі, щоб визначити, чи слід додавати сокет каналу до списку, у якому можуть відбуватися події читання. Метод за замовчуванням просто повертає ``True``, вказуючи, що за замовчуванням усі канали будуть зацікавлені в подіях читання.

source: Called each time around the asynchronous loop to determine whether a channel's socket should be added to the list on which write events can occur. The default method simply returns ``True``, indicating that by default, all channels will be interested in write events.
uk: Викликається кожного разу в асинхронному циклі, щоб визначити, чи слід додавати сокет каналу до списку, у якому можуть відбуватися події запису. Метод за замовчуванням просто повертає ``True``, вказуючи, що за замовчуванням усі канали будуть зацікавлені в подіях запису.

source: In addition, each channel delegates or extends many of the socket methods. Most of these are nearly identical to their socket partners.
uk: Крім того, кожен канал делегує або розширює багато методів сокетів. Більшість із них майже ідентичні своїм партнерам по сокетам.

source: This is identical to the creation of a normal socket, and will use the same options for creation. Refer to the :mod:`socket` documentation for information on creating sockets.
uk: Це ідентично створенню звичайного сокета та використовуватиме ті самі параметри для створення. Зверніться до документації :mod:`socket` для отримання інформації про створення сокетів.

source: *family* and *type* arguments can be omitted.
uk: Аргументи *сімейство* і *тип* можна опустити.

source: As with the normal socket object, *address* is a tuple with the first element the host to connect to, and the second the port number.
uk: Як і у випадку зі звичайним об’єктом сокета, *адреса* – це кортеж із першим елементом, до якого потрібно підключитися, а другим – номер порту.

source: Send *data* to the remote end-point of the socket.
uk: Надіслати *дані* до віддаленої кінцевої точки сокета.

source: Read at most *buffer_size* bytes from the socket's remote end-point. An empty bytes object implies that the channel has been closed from the other end.
uk: Читати щонайбільше *buffer_size* байтів із віддаленої кінцевої точки сокета. Порожній об’єкт bytes означає, що канал закрито з іншого боку.

source: Note that :meth:`recv` may raise :exc:`BlockingIOError` , even though :func:`select.select` or :func:`select.poll` has reported the socket ready for reading.
uk: Зверніть увагу, що :meth:`recv` може викликати :exc:`BlockingIOError`, навіть якщо :func:`select.select` або :func:`select.poll` повідомили, що сокет готовий для читання.

source: Listen for connections made to the socket. The *backlog* argument specifies the maximum number of queued connections and should be at least 1; the maximum value is system-dependent (usually 5).
uk: Прослухайте підключення до розетки. Аргумент *backlog* визначає максимальну кількість підключень у черзі та має бути принаймні 1; максимальне значення залежить від системи (зазвичай 5).

source: Bind the socket to *address*. The socket must not already be bound. (The format of *address* depends on the address family --- refer to the :mod:`socket` documentation for more information.) To mark the socket as re-usable (setting the :const:`SO_REUSEADDR` option), call the :class:`dispatcher` object's :meth:`set_reuse_addr` method.
uk: Прив’яжіть сокет до *адреси*. Розетка ще не повинна бути прив’язаною. (Формат *адреси* залежить від сімейства адрес --- зверніться до документації :mod:`socket` для отримання додаткової інформації.) Щоб позначити сокет як придатний для повторного використання (встановивши параметр :const:`SO_REUSEADDR`), викликати метод :meth:`set_reuse_addr` об'єкта :class:`dispatcher`.

source: Accept a connection. The socket must be bound to an address and listening for connections. The return value can be either ``None`` or a pair ``(conn, address)`` where *conn* is a *new* socket object usable to send and receive data on the connection, and *address* is the address bound to the socket on the other end of the connection. When ``None`` is returned it means the connection didn't take place, in which case the server should just ignore this event and keep listening for further incoming connections.
uk: Прийняти підключення. Сокет має бути прив’язаний до адреси та прослуховувати підключення. Поверненим значенням може бути ``None`` або пара ``(conn, address)``, де *conn* — це *новий* об’єкт сокета, який можна використовувати для надсилання та отримання даних під час з’єднання, а *address* — це адресу, прив’язану до сокета на іншому кінці з’єднання. Коли повертається "None", це означає, що з’єднання не відбулося, і в цьому випадку сервер повинен просто проігнорувати цю подію та продовжувати прослуховувати подальші вхідні з’єднання.

source: Close the socket. All future operations on the socket object will fail. The remote end-point will receive no more data (after queued data is flushed). Sockets are automatically closed when they are garbage-collected.
uk: Закрийте розетку. Усі майбутні операції над об’єктом сокета не вдадуться. Віддалена кінцева точка більше не отримуватиме даних (після видалення даних із черги). Сокети автоматично закриваються під час збирання сміття.

source: A :class:`dispatcher` subclass which adds simple buffered output capability, useful for simple clients. For more sophisticated usage use :class:`asynchat.async_chat`.
uk: Підклас :class:`dispatcher`, який додає просту можливість буферизованого виведення, корисну для простих клієнтів. Для більш складного використання використовуйте :class:`asynchat.async_chat`.

source: A file_dispatcher takes a file descriptor or :term:`file object` along with an optional map argument and wraps it for use with the :c:func:`poll` or :c:func:`loop` functions. If provided a file object or anything with a :c:func:`fileno` method, that method will be called and passed to the :class:`file_wrapper` constructor.
uk: File_dispatcher приймає дескриптор файлу або :term:`file object` разом із необов’язковим аргументом карти та обгортає його для використання з функціями :c:func:`poll` або :c:func:`loop`. Якщо надати файловий об’єкт або щось із методом :c:func:`fileno`, цей метод буде викликано та передано конструктору :class:`file_wrapper`.

source: :ref:`Availability <availability>`: Unix.
uk: :ref:`Наявність <availability>`: Unix.

source: A file_wrapper takes an integer file descriptor and calls :func:`os.dup` to duplicate the handle so that the original handle may be closed independently of the file_wrapper. This class implements sufficient methods to emulate a socket for use by the :class:`file_dispatcher` class.
uk: File_wrapper приймає цілочисельний файловий дескриптор і викликає :func:`os.dup`, щоб дублювати дескриптор, щоб вихідний дескриптор можна було закрити незалежно від file_wrapper. Цей клас реалізує достатньо методів для емуляції сокета для використання класом :class:`file_dispatcher`.

source: asyncore Example basic HTTP client
uk: asyncore Приклад базового клієнта HTTP

source: Here is a very basic HTTP client that uses the :class:`dispatcher` class to implement its socket handling::
uk: Ось простий клієнт HTTP, який використовує клас :class:`dispatcher` для реалізації обробки сокетів:

source: asyncore Example basic echo server
uk: asyncore Приклад базового сервера відлуння

source: Here is a basic echo server that uses the :class:`dispatcher` class to accept connections and dispatches the incoming connections to a handler::
uk: Ось базовий ехо-сервер, який використовує клас :class:`dispatcher` для прийняття з’єднань і відправляє вхідні з’єднання до обробника::
