Repository: seanpm2001/python-docs-uk
Catalog: library/asyncio-extending.po
Languages: uk

source: Extending
uk: Розширення

source: The main direction for :mod:`asyncio` extending is writing custom *event loop* classes. Asyncio has helpers that could be used to simplify this task.
uk: Основним напрямком розширення :mod:`asyncio` є написання спеціальних класів *циклу подій*. У Asyncio є помічники, які можна використати для спрощення цього завдання.

source: Third-parties should reuse existing asyncio code with caution, a new Python version is free to break backward compatibility in *internal* part of API.
uk: Третім сторонам слід обережно повторно використовувати існуючий асинхронний код, нова версія Python може порушити зворотну сумісність у *внутрішній* частині API.

source: Writing a Custom Event Loop
uk: Написання спеціального циклу подій

source: :class:`asyncio.AbstractEventLoop` declares very many methods. Implementing all them from scratch is a tedious job.
uk: :class:`asyncio.AbstractEventLoop` оголошує дуже багато методів. Впроваджувати їх усі з нуля – клопітка робота.

source: A loop can get many common methods implementation for free by inheriting from :class:`asyncio.BaseEventLoop`.
uk: Цикл може безкоштовно реалізувати багато поширених методів, успадкувавши від :class:`asyncio.BaseEventLoop`.

source: In turn, the successor should implement a bunch of *private* methods declared but not implemented in :class:`asyncio.BaseEventLoop`.
uk: У свою чергу, наступник повинен реалізувати купу *приватних* методів, оголошених, але не реалізованих у :class:`asyncio.BaseEventLoop`.

source: For example, ``loop.create_connection()`` checks arguments, resolves DNS addresses, and calls ``loop._make_socket_transport()`` that should be implemented by inherited class. The ``_make_socket_transport()`` method is not documented and is considered as an *internal* API.
uk: Наприклад, ``loop.create_connection()`` перевіряє аргументи, розпізнає адреси DNS і викликає ``loop._make_socket_transport()``, який має бути реалізований успадкованим класом. Метод ``_make_socket_transport()`` не задокументований і вважається *внутрішнім* API.

source: Future and Task private constructors
uk: Приватні конструктори "Майбутнє і Задача".

source: :class:`asyncio.Future` and :class:`asyncio.Task` should be never created directly, please use corresponding :meth:`loop.create_future` and :meth:`loop.create_task`, or :func:`asyncio.create_task` factories instead.
uk: :class:`asyncio.Future` і :class:`asyncio.Task` ніколи не слід створювати безпосередньо, Натомість використовуйте відповідні фабрики :meth:`loop.create_future` і :meth:`loop.create_task` або :func:`asyncio.create_task`.

source: However, third-party *event loops* may *reuse* built-in future and task implementations for the sake of getting a complex and highly optimized code for free.
uk: Проте сторонні *цикли подій* можуть *повторно використовувати* вбудовані майбутні реалізації та реалізації завдань заради безкоштовного отримання складного та високооптимізованого коду.

source: For this purpose the following, *private* constructors are listed:
uk: Для цього перераховані такі *приватні* конструктори:

source: Create a built-in future instance.
uk: Створіть вбудований майбутній екземпляр.

source: *loop* is an optional event loop instance.
uk: *loop* є необов’язковим екземпляром циклу подій.

source: Create a built-in task instance.
uk: Створіть вбудований екземпляр завдання.

source: *loop* is an optional event loop instance. The rest of arguments are described in :meth:`loop.create_task` description.
uk: *loop* є необов’язковим екземпляром циклу подій. Решта аргументів описано в описі :meth:`loop.create_task`.

source: *context* argument is added.
uk: додається аргумент *context*.

source: Return ``True`` if *future* is attached to the same loop as the task, ``False`` otherwise.
uk: Повертає ``True``, якщо *future* приєднано до того самого циклу, що й завдання, ``False`` інакше.

source: Task lifetime support
uk: Довічна підтримка завдання

source: A third party task implementation should call the following functions to keep a task visible by :func:`asyncio.get_tasks` and :func:`asyncio.current_task`:
uk: Реалізація завдання третьої сторони має викликати такі функції, щоб завдання залишалося видимим для :func:`asyncio.get_tasks` і :func:`asyncio.current_task`:

source: Register a new *task* as managed by *asyncio*.
uk: Зареєструйте нове *завдання* під керуванням *asyncio*.

source: Call the function from a task constructor.
uk: Виклик функції з конструктора завдань.

source: Unregister a *task* from *asyncio* internal structures.
uk: Скасувати реєстрацію *завдання* у внутрішніх структурах *asyncio*.

source: The function should be called when a task is about to finish.
uk: Функцію слід викликати, коли завдання майже завершено.

source: Switch the current task to the *task* argument.
uk: Перемкніть поточне завдання на аргумент *завдання*.

source: Call the function just before executing a portion of embedded *coroutine* (:meth:`coroutine.send` or :meth:`coroutine.throw`).
uk: Викликайте функцію безпосередньо перед виконанням частини вбудованої *coroutine* (:meth:`coroutine.send` або :meth:`coroutine.throw`).

source: Switch the current task back from *task* to ``None``.
uk: Повернути поточне завдання з *завдання* на ``None``.

source: Call the function just after :meth:`coroutine.send` or :meth:`coroutine.throw` execution.
uk: Викликайте функцію одразу після виконання :meth:`coroutine.send` або :meth:`coroutine.throw`.
