Repository: seanpm2001/python-docs-uk
Catalog: library/cgi.po
Languages: uk

source: There's one important rule: if you invoke an external program (via :func:`os.system`, :func:`os.popen` or other functions with similar functionality), make very sure you don't pass arbitrary strings received from the client to the shell. This is a well-known security hole whereby clever hackers anywhere on the web can exploit a gullible CGI script to invoke arbitrary shell commands. Even parts of the URL or field names cannot be trusted, since the request doesn't have to come from your form!
uk: Є одне важливе правило: якщо ви викликаєте зовнішню програму (через :func:`os.system`, :func:`os.popen` або інші функції з подібною функціональністю), переконайтеся, що ви не передаєте довільні рядки, отримані з клієнта до оболонки. Це добре відома діра в безпеці, через яку спритні хакери будь-де в Інтернеті можуть використовувати довірливий сценарій CGI для виклику довільних команд оболонки. Не можна довіряти навіть частинам URL-адреси чи імен полів, оскільки запит необов’язково надходить із вашої форми!

source: To be on the safe side, if you must pass a string gotten from a form to a shell command, you should make sure the string contains only alphanumeric characters, dashes, underscores, and periods.
uk: Щоб бути в безпеці, якщо вам потрібно передати рядок, отриманий із форми, до команди оболонки, ви повинні переконатися, що рядок містить лише буквено-цифрові символи, тире, підкреслення та крапки.

source: Installing your CGI script on a Unix system
uk: Встановлення сценарію CGI в систему Unix

source: Read the documentation for your HTTP server and check with your local system administrator to find the directory where CGI scripts should be installed; usually this is in a directory :file:`cgi-bin` in the server tree.
uk: Прочитайте документацію для вашого HTTP-сервера та зверніться до локального системного адміністратора, щоб знайти каталог, де слід інсталювати сценарії CGI; зазвичай це знаходиться в каталозі :file:`cgi-bin` у дереві сервера.

source: Make sure that your script is readable and executable by "others"; the Unix file mode should be ``0o755`` octal (use ``chmod 0755 filename``). Make sure that the first line of the script contains ``#!`` starting in column 1 followed by the pathname of the Python interpreter, for instance::
uk: Переконайтеся, що ваш сценарій доступний для читання та виконання "іншими"; режим файлу Unix має бути ``0o755`` вісімковий (використовуйте ``chmod 0755 ім'я файлу``). Переконайтеся, що перший рядок сценарію містить ``#!``, починаючи зі стовпця 1, за яким іде шлях до інтерпретатора Python, наприклад::

source: Make sure the Python interpreter exists and is executable by "others".
uk: Переконайтеся, що інтерпретатор Python існує та його можна виконати "іншими".

source: Make sure that any files your script needs to read or write are readable or writable, respectively, by "others" --- their mode should be ``0o644`` for readable and ``0o666`` for writable. This is because, for security reasons, the HTTP server executes your script as user "nobody", without any special privileges. It can only read (write, execute) files that everybody can read (write, execute). The current directory at execution time is also different (it is usually the server's cgi-bin directory) and the set of environment variables is also different from what you get when you log in. In particular, don't count on the shell's search path for executables (:envvar:`PATH`) or the Python module search path (:envvar:`PYTHONPATH`) to be set to anything interesting.
uk: Переконайтеся, що будь-які файли, які ваш сценарій має читати або писати, доступні для читання або запису, відповідно, "іншими" --- їхній режим має бути ``0o644`` для читання та ``0o666`` для запису. Це пояснюється тим, що з міркувань безпеки HTTP-сервер виконує ваш сценарій від імені користувача "nobody" без будь-яких спеціальних привілеїв. Він може лише читати (записувати, виконувати) файли, які можуть читати (записувати, виконувати) усі. Поточний каталог під час виконання також відрізняється (зазвичай це каталог cgi-bin сервера), і набір змінних середовища також відрізняється від того, що ви отримуєте під час входу. Зокрема, не розраховуйте на шлях пошуку оболонки для виконуваних файлів (:envvar:`PATH`) або шлях пошуку модуля Python (:envvar:`PYTHONPATH`) має бути встановлено будь-що цікаве.

source: If you need to load modules from a directory which is not on Python's default module search path, you can change the path in your script, before importing other modules. For example::
uk: Якщо вам потрібно завантажити модулі з каталогу, який не входить до стандартного шляху пошуку модулів Python, ви можете змінити шлях у своєму сценарії перед імпортом інших модулів. Наприклад::

source: (This way, the directory inserted last will be searched first!)
uk: (Таким чином спочатку буде здійснюватися пошук у каталозі, вставленому останньою!)

source: Instructions for non-Unix systems will vary; check your HTTP server's documentation (it will usually have a section on CGI scripts).
uk: Інструкції для не-Unix систем будуть різними; перевірте документацію вашого HTTP-сервера (зазвичай у ній є розділ про сценарії CGI).

source: Testing your CGI script
uk: Тестування вашого сценарію CGI

source: Unfortunately, a CGI script will generally not run when you try it from the command line, and a script that works perfectly from the command line may fail mysteriously when run from the server. There's one reason why you should still test your script from the command line: if it contains a syntax error, the Python interpreter won't execute it at all, and the HTTP server will most likely send a cryptic error to the client.
uk: На жаль, CGI-сценарій, як правило, не запускається, якщо ви намагаєтеся його запустити з командного рядка, а сценарій, який ідеально працює з командного рядка, може статися незрозумілим чином під час запуску з сервера. Є одна причина, чому вам усе одно слід протестувати свій сценарій з командного рядка: якщо він містить синтаксичну помилку, інтерпретатор Python взагалі не виконає його, а сервер HTTP, швидше за все, надішле клієнту загадкову помилку.

source: Assuming your script has no syntax errors, yet it does not work, you have no choice but to read the next section.
uk: Якщо припустити, що у вашому сценарії немає синтаксичних помилок, але він не працює, у вас немає іншого вибору, як прочитати наступний розділ.

source: Debugging CGI scripts
uk: Налагодження сценаріїв CGI

source: First of all, check for trivial installation errors --- reading the section above on installing your CGI script carefully can save you a lot of time. If you wonder whether you have understood the installation procedure correctly, try installing a copy of this module file (:file:`cgi.py`) as a CGI script. When invoked as a script, the file will dump its environment and the contents of the form in HTML format. Give it the right mode etc., and send it a request. If it's installed in the standard :file:`cgi-bin` directory, it should be possible to send it a request by entering a URL into your browser of the form:
uk: Перш за все, перевірте наявність тривіальних помилок інсталяції --- уважне читання розділу вище про інсталяцію сценарію CGI може заощадити вам багато часу. Якщо вам цікаво, чи правильно ви зрозуміли процедуру встановлення, спробуйте встановити копію цього файлу модуля (:file:`cgi.py`) як сценарій CGI. Коли файл викликається як сценарій, файл створить дамп свого середовища та вмісту форми у форматі HTML. Налаштуйте правильний режим тощо та надішліть запит. Якщо його встановлено в стандартному каталозі :file:`cgi-bin`, можна буде надіслати запит, ввівши URL-адресу у вашому браузері у формі:

source: If this gives an error of type 404, the server cannot find the script -- perhaps you need to install it in a different directory. If it gives another error, there's an installation problem that you should fix before trying to go any further. If you get a nicely formatted listing of the environment and form content (in this example, the fields should be listed as "addr" with value "At Home" and "name" with value "Joe Blow"), the :file:`cgi.py` script has been installed correctly. If you follow the same procedure for your own script, you should now be able to debug it.
uk: Якщо це дає помилку типу 404, сервер не може знайти сценарій - можливо, вам потрібно встановити його в інший каталог. Якщо видає іншу помилку, виникла проблема з інсталяцією, яку слід усунути, перш ніж продовжувати. Якщо ви отримаєте гарно відформатований список середовища та вмісту форми (у цьому прикладі поля мають бути вказані як "addr" зі значенням "At Home" та "name" зі значенням "Joe Blow"), :file:`cgi.py` скрипт встановлено правильно. Якщо ви виконаєте ту саму процедуру для власного сценарію, тепер ви зможете його налагодити.

source: The next step could be to call the :mod:`cgi` module's :func:`test` function from your script: replace its main code with the single statement ::
uk: Наступним кроком може бути виклик функції :func:`test` модуля :mod:`cgi` з вашого сценарію: замініть його основний код одним оператором ::

source: This should produce the same results as those gotten from installing the :file:`cgi.py` file itself.
uk: Це має призвести до тих самих результатів, що й після встановлення самого файлу :file:`cgi.py`.

source: When an ordinary Python script raises an unhandled exception (for whatever reason: of a typo in a module name, a file that can't be opened, etc.), the Python interpreter prints a nice traceback and exits. While the Python interpreter will still do this when your CGI script raises an exception, most likely the traceback will end up in one of the HTTP server's log files, or be discarded altogether.
uk: Коли звичайний сценарій Python викликає необроблений виняток (з будь-якої причини: помилка в назві модуля, файл, який не можна відкрити тощо), інтерпретатор Python друкує хорошу трасування та завершує роботу. Хоча інтерпретатор Python все одно зробить це, коли ваш сценарій CGI викликає виняток, найімовірніше, зворотне відстеження потрапить в один із файлів журналу HTTP-сервера або взагалі буде відкинуто.

source: Fortunately, once you have managed to get your script to execute *some* code, you can easily send tracebacks to the web browser using the :mod:`cgitb` module. If you haven't done so already, just add the lines::
uk: На щастя, коли вам вдалося змусити ваш сценарій виконати *деякий* код, ви можете легко надіслати відстеження до веб-браузера за допомогою модуля :mod:`cgitb`. Якщо ви ще цього не зробили, просто додайте рядки::

source: to the top of your script. Then try running it again; when a problem occurs, you should see a detailed report that will likely make apparent the cause of the crash.
uk: на початок вашого сценарію. Потім спробуйте запустити його знову; коли виникає проблема, ви повинні побачити докладний звіт, який, ймовірно, стане очевидною причиною збою.

source: If you suspect that there may be a problem in importing the :mod:`cgitb` module, you can use an even more robust approach (which only uses built-in modules)::
uk: Якщо ви підозрюєте, що може виникнути проблема з імпортом модуля :mod:`cgitb`, ви можете скористатися навіть більш надійним підходом (який використовує лише вбудовані модулі):

source: This relies on the Python interpreter to print the traceback. The content type of the output is set to plain text, which disables all HTML processing. If your script works, the raw HTML will be displayed by your client. If it raises an exception, most likely after the first two lines have been printed, a traceback will be displayed. Because no HTML interpretation is going on, the traceback will be readable.
uk: Це залежить від інтерпретатора Python для друку трасування. Тип вмісту виводу встановлено як звичайний текст, що вимикає всю обробку HTML. Якщо ваш сценарій працює, ваш клієнт відображатиме необроблений HTML. Якщо це викликає виняток, швидше за все, після того, як перші два рядки будуть надруковані, відобразиться зворотне трасування. Оскільки інтерпретація HTML не відбувається, трасування буде доступним для читання.

source: Common problems and solutions
uk: Поширені проблеми та рішення

source: Most HTTP servers buffer the output from CGI scripts until the script is completed. This means that it is not possible to display a progress report on the client's display while the script is running.
uk: Більшість HTTP-серверів буферизують вихідні дані сценаріїв CGI, доки сценарій не буде завершено. Це означає, що неможливо відобразити звіт про виконання на дисплеї клієнта під час виконання сценарію.

source: Check the installation instructions above.
uk: Перегляньте інструкції зі встановлення вище.

source: Check the HTTP server's log files. (``tail -f logfile`` in a separate window may be useful!)
uk: Перевірте файли журналу HTTP-сервера. (``tail -f logfile`` в окремому вікні може бути корисним!)

source: Always check a script for syntax errors first, by doing something like ``python script.py``.
uk: Завжди спочатку перевіряйте сценарій на синтаксичні помилки, виконавши щось на зразок ``python script.py``.

source: If your script does not have any syntax errors, try adding ``import cgitb; cgitb.enable()`` to the top of the script.
uk: Якщо ваш сценарій не має синтаксичних помилок, спробуйте додати ``import cgitb; cgitb.enable()`` у верхній частині сценарію.

source: When invoking external programs, make sure they can be found. Usually, this means using absolute path names --- :envvar:`PATH` is usually not set to a very useful value in a CGI script.
uk: Викликаючи зовнішні програми, переконайтеся, що їх можна знайти. Зазвичай це означає використання абсолютних назв шляхів --- :envvar:`PATH` зазвичай не має дуже корисного значення в сценарії CGI.

source: When reading or writing external files, make sure they can be read or written by the userid under which your CGI script will be running: this is typically the userid under which the web server is running, or some explicitly specified userid for a web server's ``suexec`` feature.
uk: Під час читання або запису зовнішніх файлів переконайтеся, що їх можна прочитати або записати за ідентифікатором користувача, під яким запускатиметься ваш сценарій CGI: зазвичай це ідентифікатор користувача, під яким запущено веб-сервер, або якийсь явно вказаний ідентифікатор користувача для` веб-сервера. функція `suexec``.

source: Don't try to give a CGI script a set-uid mode. This doesn't work on most systems, and is a security liability as well.
uk: Не намагайтеся надати сценарію CGI режим set-uid. Це не працює в більшості систем, а також є проблемою безпеки.

source: Footnotes
uk: Виноски

source: Note that some recent versions of the HTML specification do state what order the field values should be supplied in, but knowing whether a request was received from a conforming browser, or even from a browser at all, is tedious and error-prone.
uk: Зауважте, що в деяких нещодавніх версіях специфікації HTML зазначено, у якому порядку слід надавати значення полів, але знати, чи був отриманий запит від відповідного браузера, або навіть від браузера взагалі, є виснажливим і схильним до помилок.
