Repository: seanpm2001/python-docs-uk
Catalog: library/cgi.po
Languages: uk

source: :mod:`cgi` --- Common Gateway Interface support
uk: :mod:`cgi` --- Підтримка загального інтерфейсу шлюзу

source: **Source code:** :source:`Lib/cgi.py`
uk: **Вихідний код:** :source:`Lib/cgi.py`

source: The :mod:`cgi` module is deprecated (see :pep:`PEP 594 <594#cgi>` for details and alternatives).
uk: Модуль :mod:`cgi` є застарілим (перегляньте :pep:`PEP 594 <594#cgi>` для деталей та альтернатив).

source: Support module for Common Gateway Interface (CGI) scripts.
uk: Модуль підтримки для сценаріїв загального інтерфейсу шлюзу (CGI).

source: This module defines a number of utilities for use by CGI scripts written in Python.
uk: Цей модуль визначає низку утиліт для використання сценаріями CGI, написаними на Python.

source: Introduction
uk: Вступ

source: A CGI script is invoked by an HTTP server, usually to process user input submitted through an HTML ``<FORM>`` or ``<ISINDEX>`` element.
uk: Сценарій CGI викликається сервером HTTP, як правило, для обробки введених даних користувача через елемент HTML ``<FORM>`` або ``<ISINDEX>``.

source: Most often, CGI scripts live in the server's special :file:`cgi-bin` directory. The HTTP server places all sorts of information about the request (such as the client's hostname, the requested URL, the query string, and lots of other goodies) in the script's shell environment, executes the script, and sends the script's output back to the client.
uk: Найчастіше CGI-скрипти знаходяться в спеціальному каталозі сервера :file:`cgi-bin`. HTTP-сервер розміщує всіляку інформацію про запит (наприклад, ім’я хосту клієнта, запитувану URL-адресу, рядок запиту та багато інших корисностей) у середовищі оболонки сценарію, виконує сценарій і надсилає вихідні дані сценарію назад до клієнт.

source: The script's input is connected to the client too, and sometimes the form data is read this way; at other times the form data is passed via the "query string" part of the URL. This module is intended to take care of the different cases and provide a simpler interface to the Python script. It also provides a number of utilities that help in debugging scripts, and the latest addition is support for file uploads from a form (if your browser supports it).
uk: Вхідні дані сценарію також підключаються до клієнта, і іноді дані форми читаються таким чином; в інший час дані форми передаються через частину URL-адреси "рядок запиту". Цей модуль призначений для вирішення різних випадків і надання простішого інтерфейсу сценарію Python. Він також надає ряд утиліт, які допомагають у налагодженні сценаріїв, і останнє доповнення — це підтримка завантаження файлів із форми (якщо ваш браузер це підтримує).

source: The output of a CGI script should consist of two sections, separated by a blank line. The first section contains a number of headers, telling the client what kind of data is following. Python code to generate a minimal header section looks like this::
uk: Результат сценарію CGI має складатися з двох розділів, розділених порожнім рядком. Перший розділ містить кілька заголовків, які повідомляють клієнту, які дані слідують. Код Python для створення мінімального розділу заголовка виглядає так:

source: The second section is usually HTML, which allows the client software to display nicely formatted text with header, in-line images, etc. Here's Python code that prints a simple piece of HTML::
uk: Другий розділ – це зазвичай HTML, який дозволяє клієнтському програмному забезпеченню відображати гарно відформатований текст із заголовком, вбудованими зображеннями тощо. Ось код Python, який друкує простий фрагмент HTML::

source: Using the cgi module
uk: Використання модуля cgi

source: Begin by writing ``import cgi``.
uk: Почніть з написання ``import cgi``.

source: When you write a new script, consider adding these lines::
uk: Коли ви пишете новий сценарій, додайте такі рядки::

source: This activates a special exception handler that will display detailed reports in the web browser if any errors occur. If you'd rather not show the guts of your program to users of your script, you can have the reports saved to files instead, with code like this::
uk: Це активує спеціальний обробник винятків, який відображатиме докладні звіти у веб-браузері, якщо виникнуть будь-які помилки. Якщо ви не бажаєте показувати нутрощі вашої програми користувачам вашого сценарію, ви можете натомість зберегти звіти у файлах із таким кодом::

source: It's very helpful to use this feature during script development. The reports produced by :mod:`cgitb` provide information that can save you a lot of time in tracking down bugs. You can always remove the ``cgitb`` line later when you have tested your script and are confident that it works correctly.
uk: Дуже корисно використовувати цю функцію під час розробки сценарію. Звіти, створені :mod:`cgitb`, надають інформацію, яка може заощадити вам багато часу на пошук помилок. Ви завжди можете видалити рядок ``cgitb`` пізніше, коли ви протестуєте свій сценарій і переконаєтеся, що він працює правильно.

source: To get at submitted form data, use the :class:`FieldStorage` class. If the form contains non-ASCII characters, use the *encoding* keyword parameter set to the value of the encoding defined for the document. It is usually contained in the META tag in the HEAD section of the HTML document or by the :mailheader:`Content-Type` header. This reads the form contents from the standard input or the environment (depending on the value of various environment variables set according to the CGI standard). Since it may consume standard input, it should be instantiated only once.
uk: Щоб отримати надіслані дані форми, використовуйте клас :class:`FieldStorage`. Якщо форма містить символи, що не належать до ASCII, використовуйте параметр ключового слова *encoding* зі значенням кодування, визначеного для документа. Зазвичай він міститься в тегу META в розділі HEAD документа HTML або в заголовку :mailheader:`Content-Type`. Це зчитує вміст форми зі стандартного введення або середовища (залежно від значення різних змінних середовища, встановлених відповідно до стандарту CGI). Оскільки він може споживати стандартний ввід, його слід створити лише один раз.

source: The :class:`FieldStorage` instance can be indexed like a Python dictionary. It allows membership testing with the :keyword:`in` operator, and also supports the standard dictionary method :meth:`~dict.keys` and the built-in function :func:`len`. Form fields containing empty strings are ignored and do not appear in the dictionary; to keep such values, provide a true value for the optional *keep_blank_values* keyword parameter when creating the :class:`FieldStorage` instance.
uk: Екземпляр :class:`FieldStorage` можна індексувати як словник Python. Він дозволяє тестувати членство за допомогою оператора :keyword:`in`, а також підтримує стандартний метод словника :meth:`~dict.keys` і вбудовану функцію :func:`len`. Поля форми, що містять порожні рядки, ігноруються та не відображаються в словнику; щоб зберегти такі значення, укажіть справжнє значення для необов’язкового параметра ключового слова *keep_blank_values* під час створення екземпляра :class:`FieldStorage`.

source: For instance, the following code (which assumes that the :mailheader:`Content-Type` header and blank line have already been printed) checks that the fields ``name`` and ``addr`` are both set to a non-empty string::
uk: Наприклад, наступний код (який припускає, що заголовок :mailheader:`Content-Type` і порожній рядок уже надруковано) перевіряє, що поля ``name`` і ``addr`` мають значення не- порожній рядок::

source: Here the fields, accessed through ``form[key]``, are themselves instances of :class:`FieldStorage` (or :class:`MiniFieldStorage`, depending on the form encoding). The :attr:`~FieldStorage.value` attribute of the instance yields the string value of the field. The :meth:`~FieldStorage.getvalue` method returns this string value directly; it also accepts an optional second argument as a default to return if the requested key is not present.
uk: Тут поля, доступ до яких здійснюється через ``form[key]``, самі є екземплярами :class:`FieldStorage` (або :class:`MiniFieldStorage`, залежно від кодування форми). Атрибут :attr:`~FieldStorage.value` екземпляра дає рядкове значення поля. Метод :meth:`~FieldStorage.getvalue` повертає це значення рядка безпосередньо; він також приймає необов'язковий другий аргумент як типовий для повернення, якщо запитуваний ключ відсутній.

source: If the submitted form data contains more than one field with the same name, the object retrieved by ``form[key]`` is not a :class:`FieldStorage` or :class:`MiniFieldStorage` instance but a list of such instances. Similarly, in this situation, ``form.getvalue(key)`` would return a list of strings. If you expect this possibility (when your HTML form contains multiple fields with the same name), use the :meth:`~FieldStorage.getlist` method, which always returns a list of values (so that you do not need to special-case the single item case). For example, this code concatenates any number of username fields, separated by commas::
uk: Якщо надіслані дані форми містять більше одного поля з однаковою назвою, об’єкт, отриманий ``form[key]``, не є екземпляром :class:`FieldStorage` або :class:`MiniFieldStorage`, а списком таких екземплярів . Подібним чином у цій ситуації ``form.getvalue(key)`` поверне список рядків. Якщо ви очікуєте такої можливості (якщо ваша HTML-форма містить кілька полів з однаковою назвою), використовуйте метод :meth:`~FieldStorage.getlist`, який завжди повертає список значень (тобто вам не потрібно вводити спеціальний регістр одиничний випадок). Наприклад, цей код об’єднує будь-яку кількість полів імені користувача, розділених комами:

source: If a field represents an uploaded file, accessing the value via the :attr:`~FieldStorage.value` attribute or the :meth:`~FieldStorage.getvalue` method reads the entire file in memory as bytes. This may not be what you want. You can test for an uploaded file by testing either the :attr:`~FieldStorage.filename` attribute or the :attr:`~FieldStorage.file` attribute. You can then read the data from the :attr:`!file` attribute before it is automatically closed as part of the garbage collection of the :class:`FieldStorage` instance (the :func:`~io.RawIOBase.read` and :func:`~io.IOBase.readline` methods will return bytes)::
uk: Якщо поле представляє завантажений файл, доступ до значення через атрибут :attr:`~FieldStorage.value` або метод :meth:`~FieldStorage.getvalue` зчитує весь файл у пам’яті як байти. Це може бути не те, що ви хочете. Ви можете перевірити наявність завантаженого файлу, протестувавши атрибут :attr:`~FieldStorage.filename` або :attr:`~FieldStorage.file`. Потім ви можете прочитати дані з атрибута :attr:`!file`, перш ніж він автоматично закриється як частина збірки сміття екземпляра :class:`FieldStorage` (:func:`~io.RawIOBase.read` і :func:`~io.IOBase.readline` методи повертатимуть байти)::

source: :class:`FieldStorage` objects also support being used in a :keyword:`with` statement, which will automatically close them when done.
uk: Об’єкти :class:`FieldStorage` також підтримують використання в операторі :keyword:`with`, який автоматично закриє їх після завершення.

source: If an error is encountered when obtaining the contents of an uploaded file (for example, when the user interrupts the form submission by clicking on a Back or Cancel button) the :attr:`~FieldStorage.done` attribute of the object for the field will be set to the value -1.
uk: Якщо під час отримання вмісту завантаженого файлу виникає помилка (наприклад, коли користувач перериває надсилання форми, натиснувши кнопку "Назад" або "Скасувати"), атрибут :attr:`~FieldStorage.done` об’єкта для поля буде встановлено значення -1.

source: The file upload draft standard entertains the possibility of uploading multiple files from one field (using a recursive :mimetype:`multipart/\*` encoding). When this occurs, the item will be a dictionary-like :class:`FieldStorage` item. This can be determined by testing its :attr:`!type` attribute, which should be :mimetype:`multipart/form-data` (or perhaps another MIME type matching :mimetype:`multipart/\*`). In this case, it can be iterated over recursively just like the top-level form object.
uk: Проект стандарту завантаження файлів передбачає можливість завантаження кількох файлів з одного поля (з використанням рекурсивного кодування :mimetype:`multipart/\*`). Коли це станеться, елемент буде схожий на словник :class:`FieldStorage`. Це можна визначити, перевіривши його атрибут :attr:`!type`, який має бути :mimetype:`multipart/form-data` (або, можливо, інший тип MIME, що відповідає :mimetype:`multipart/\*`). У цьому випадку його можна повторювати рекурсивно, як і об’єкт форми верхнього рівня.

source: When a form is submitted in the "old" format (as the query string or as a single data part of type :mimetype:`application/x-www-form-urlencoded`), the items will actually be instances of the class :class:`MiniFieldStorage`. In this case, the :attr:`!list`, :attr:`!file`, and :attr:`filename` attributes are always ``None``.
uk: Коли форму надсилають у "старому" форматі (як рядок запиту або як окрему частину даних типу :mimetype:`application/x-www-form-urlencoded`), елементи фактично будуть екземплярами класу :class:`MiniFieldStorage`. У цьому випадку атрибути :attr:`!list`, :attr:`!file` і :attr:`filename` завжди мають значення ``None``.

source: A form submitted via POST that also has a query string will contain both :class:`FieldStorage` and :class:`MiniFieldStorage` items.
uk: Форма, надіслана через POST, яка також містить рядок запиту, міститиме елементи :class:`FieldStorage` і :class:`MiniFieldStorage`.

source: The :attr:`~FieldStorage.file` attribute is automatically closed upon the garbage collection of the creating :class:`FieldStorage` instance.
uk: Атрибут :attr:`~FieldStorage.file` автоматично закривається після збирання сміття створюваного екземпляра :class:`FieldStorage`.

source: Added support for the context management protocol to the :class:`FieldStorage` class.
uk: Додано підтримку протоколу керування контекстом до класу :class:`FieldStorage`.

source: Higher Level Interface
uk: Інтерфейс вищого рівня

source: The previous section explains how to read CGI form data using the :class:`FieldStorage` class. This section describes a higher level interface which was added to this class to allow one to do it in a more readable and intuitive way. The interface doesn't make the techniques described in previous sections obsolete --- they are still useful to process file uploads efficiently, for example.
uk: У попередньому розділі пояснюється, як читати дані форми CGI за допомогою класу :class:`FieldStorage`. У цьому розділі описано інтерфейс вищого рівня, який було додано до цього класу, щоб зробити це більш зрозумілим та інтуїтивно зрозумілим способом. Інтерфейс не робить методи, описані в попередніх розділах, застарілими --- вони все ще корисні для ефективної обробки завантаження файлів, наприклад.

source: The interface consists of two simple methods. Using the methods you can process form data in a generic way, without the need to worry whether only one or more values were posted under one name.
uk: Інтерфейс складається з двох простих методів. Використовуючи методи, ви можете обробляти дані форми у загальний спосіб, не турбуючись про те, чи лише одне чи кілька значень було опубліковано під одним іменем.

source: In the previous section, you learned to write following code anytime you expected a user to post more than one value under one name::
uk: У попередньому розділі ви навчилися писати такий код щоразу, коли очікували, що користувач опублікує більше одного значення під одним іменем:

source: This situation is common for example when a form contains a group of multiple checkboxes with the same name::
uk: Така ситуація типова, наприклад, коли форма містить групу кількох прапорців з однаковою назвою::

source: In most situations, however, there's only one form control with a particular name in a form and then you expect and need only one value associated with this name. So you write a script containing for example this code::
uk: Однак у більшості ситуацій у формі є лише один елемент керування з певним ім’ям, і тоді ви очікуєте та потребуєте лише одного значення, пов’язаного з цим ім’ям. Отже, ви пишете сценарій, який містить, наприклад, цей код::

source: The problem with the code is that you should never expect that a client will provide valid input to your scripts. For example, if a curious user appends another ``user=foo`` pair to the query string, then the script would crash, because in this situation the ``getvalue("user")`` method call returns a list instead of a string. Calling the :meth:`~str.upper` method on a list is not valid (since lists do not have a method of this name) and results in an :exc:`AttributeError` exception.
uk: Проблема з кодом полягає в тому, що ви ніколи не повинні очікувати, що клієнт надасть правильні вхідні дані для ваших сценаріїв. Наприклад, якщо цікавий користувач додає іншу пару ``user=foo`` до рядка запиту, тоді сценарій аварійно завершує роботу, оскільки в цій ситуації виклик методу ``getvalue("user")`` повертає список замість рядок. Виклик методу :meth:`~str.upper` для списку є недійсним (оскільки списки не мають методу з такою назвою) і призводить до виключення :exc:`AttributeError`.

source: Therefore, the appropriate way to read form data values was to always use the code which checks whether the obtained value is a single value or a list of values. That's annoying and leads to less readable scripts.
uk: Тому відповідним способом читання значень даних форми було завжди використовувати код, який перевіряє, чи є отримане значення одним значенням чи списком значень. Це дратує та призводить до менш читабельних сценаріїв.

source: A more convenient approach is to use the methods :meth:`~FieldStorage.getfirst` and :meth:`~FieldStorage.getlist` provided by this higher level interface.
uk: Зручнішим підходом є використання методів :meth:`~FieldStorage.getfirst` і :meth:`~FieldStorage.getlist`, які надаються цим інтерфейсом вищого рівня.

source: This method always returns only one value associated with form field *name*. The method returns only the first value in case that more values were posted under such name. Please note that the order in which the values are received may vary from browser to browser and should not be counted on. [#]_ If no such form field or value exists then the method returns the value specified by the optional parameter *default*. This parameter defaults to ``None`` if not specified.
uk: Цей метод завжди повертає лише одне значення, пов’язане з полем форми *name*. Метод повертає лише перше значення у випадку, якщо під такою назвою було опубліковано більше значень. Зауважте, що порядок отримання значень може відрізнятися від браузера до браузера, і на нього не варто розраховувати. [#]_ Якщо такого поля форми чи значення не існує, тоді метод повертає значення, указане необов’язковим параметром *default*. Цей параметр за умовчанням має значення ``None``, якщо не вказано.

source: This method always returns a list of values associated with form field *name*. The method returns an empty list if no such form field or value exists for *name*. It returns a list consisting of one item if only one such value exists.
uk: Цей метод завжди повертає список значень, пов’язаних із полем форми *name*. Метод повертає порожній список, якщо для *name* не існує такого поля форми або значення. Він повертає список, що складається з одного елемента, якщо існує лише одне таке значення.

source: Using these methods you can write nice compact code::
uk: Використовуючи ці методи, ви можете написати гарний компактний код:

source: Functions
uk: Функції

source: These are useful if you want more control, or if you want to employ some of the algorithms implemented in this module in other circumstances.
uk: Це корисно, якщо ви бажаєте більше контролювати або якщо ви бажаєте застосувати деякі з алгоритмів, реалізованих у цьому модулі, в інших обставинах.

source: Parse a query in the environment or from a file (the file defaults to ``sys.stdin``). The *keep_blank_values*, *strict_parsing* and *separator* parameters are passed to :func:`urllib.parse.parse_qs` unchanged.
uk: Проаналізуйте запит у середовищі або з файлу (за замовчуванням файл має ``sys.stdin``). Параметри *keep_blank_values*, *strict_parsing* і *separator* передаються до :func:`urllib.parse.parse_qs` без змін.

source: Parse input of type :mimetype:`multipart/form-data` (for file uploads). Arguments are *fp* for the input file, *pdict* for a dictionary containing other parameters in the :mailheader:`Content-Type` header, and *encoding*, the request encoding.
uk: Проаналізуйте вхід типу :mimetype:`multipart/form-data` (для завантаження файлів). Аргументами є *fp* для вхідного файлу, *pdict* для словника, що містить інші параметри в заголовку :mailheader:`Content-Type`, і *encoding*, кодування запиту.

source: Returns a dictionary just like :func:`urllib.parse.parse_qs`: keys are the field names, each value is a list of values for that field. For non-file fields, the value is a list of strings.
uk: Повертає словник так само, як :func:`urllib.parse.parse_qs`: ключі — це назви полів, кожне значення — це список значень для цього поля. Для нефайлових полів значенням є список рядків.

source: This is easy to use but not much good if you are expecting megabytes to be uploaded --- in that case, use the :class:`FieldStorage` class instead which is much more flexible.
uk: Це легко використовувати, але не дуже добре, якщо ви очікуєте, що буде завантажено мегабайти --- у такому випадку використовуйте натомість клас :class:`FieldStorage`, який є набагато гнучкішим.

source: Added the *encoding* and *errors* parameters. For non-file fields, the value is now a list of strings, not bytes.
uk: Додано параметри *encoding* і *errors*. Для нефайлових полів значення тепер є списком рядків, а не байтів.

source: Added the *separator* parameter.
uk: Додано параметр *роздільник*.

source: Parse a MIME header (such as :mailheader:`Content-Type`) into a main value and a dictionary of parameters.
uk: Проаналізуйте заголовок MIME (наприклад, :mailheader:`Content-Type`) на основне значення та словник параметрів.

source: Robust test CGI script, usable as main program. Writes minimal HTTP headers and formats all information provided to the script in HTML format.
uk: Надійний тестовий сценарій CGI, який можна використовувати як основну програму. Записує мінімум HTTP-заголовків і форматує всю інформацію, надану сценарію, у форматі HTML.

source: Format the shell environment in HTML.
uk: Відформатуйте середовище оболонки в HTML.

source: Format a form in HTML.
uk: Відформатуйте форму в HTML.

source: Format the current directory in HTML.
uk: Відформатувати поточний каталог у HTML.

source: Print a list of useful (used by CGI) environment variables in HTML.
uk: Надрукуйте список корисних (що використовуються CGI) змінних середовища в HTML.

source: Caring about security
uk: Турбота про безпеку
