Repository: seanpm2001/python-docs-uk
Catalog: library/csv.po
Languages: uk

source: A one-character string used to quote fields containing special characters, such as the *delimiter* or *quotechar*, or which contain new-line characters. It defaults to ``'"'``.
uk: Односимвольний рядок, який використовується для взяття в лапки полів, що містять спеціальні символи, такі як *роздільник* або *quotechar*, або які містять символи нового рядка. За замовчуванням ``'"'``.

source: Controls when quotes should be generated by the writer and recognised by the reader. It can take on any of the :const:`QUOTE_\*` constants (see section :ref:`csv-contents`) and defaults to :const:`QUOTE_MINIMAL`.
uk: Контролює, коли цитати мають бути створені автором і розпізнані читачем. Він може приймати будь-які константи :const:`QUOTE_\*` (див. розділ :ref:`csv-contents`) і за замовчуванням має значення :const:`QUOTE_MINIMAL`.

source: When ``True``, raise exception :exc:`Error` on bad CSV input. The default is ``False``.
uk: Якщо ``True``, викликати виняток :exc:`Error` на неправильному введенні CSV. Типовим значенням є ``False``.

source: Reader Objects
uk: Об’єкти Reader

source: Reader objects (:class:`DictReader` instances and objects returned by the :func:`reader` function) have the following public methods:
uk: Об’єкти Reader (екземпляри :class:`DictReader` та об’єкти, повернуті функцією :func:`reader`) мають такі публічні методи:

source: Return the next row of the reader's iterable object as a list (if the object was returned from :func:`reader`) or a dict (if it is a :class:`DictReader` instance), parsed according to the current :class:`Dialect`. Usually you should call this as ``next(reader)``.
uk: Повертає наступний рядок повторюваного об’єкта читача як список (якщо об’єкт повернуто з :func:`reader`) або dict (якщо це екземпляр :class:`DictReader`), проаналізований відповідно до поточного :class:`Dialect`. Зазвичай ви повинні називати це як ``next(reader)``.

source: Reader objects have the following public attributes:
uk: Об’єкти Reader мають такі публічні атрибути:

source: A read-only description of the dialect in use by the parser.
uk: Доступний лише для читання опис діалекту, який використовує аналізатор.

source: The number of lines read from the source iterator. This is not the same as the number of records returned, as records can span multiple lines.
uk: Кількість рядків, прочитаних із вихідного ітератора. Це не те саме, що кількість повернутих записів, оскільки записи можуть займати кілька рядків.

source: DictReader objects have the following public attribute:
uk: Об’єкти DictReader мають такий публічний атрибут:

source: If not passed as a parameter when creating the object, this attribute is initialized upon first access or when the first record is read from the file.
uk: Якщо не передано як параметр під час створення об’єкта, цей атрибут ініціалізується під час першого доступу або коли перший запис зчитується з файлу.

source: Writer Objects
uk: Об'єкти Writer

source: :class:`Writer` objects (:class:`DictWriter` instances and objects returned by the :func:`writer` function) have the following public methods. A *row* must be an iterable of strings or numbers for :class:`Writer` objects and a dictionary mapping fieldnames to strings or numbers (by passing them through :func:`str` first) for :class:`DictWriter` objects. Note that complex numbers are written out surrounded by parens. This may cause some problems for other programs which read CSV files (assuming they support complex numbers at all).
uk: Об’єкти :class:`Writer` (екземпляри :class:`DictWriter` та об’єкти, повернуті функцією :func:`writer`) мають такі публічні методи. *Рядок* має бути ітерацією рядків або чисел для об’єктів :class:`Writer` і словником, який зіставляє назви полів із рядками або числами (спочатку передаючи їх через :func:`str`) для об’єктів :class:`DictWriter` . Зверніть увагу, що комплексні числа записуються в дужках. Це може спричинити деякі проблеми для інших програм, які читають файли CSV (якщо вони взагалі підтримують комплексні числа).

source: Write the *row* parameter to the writer's file object, formatted according to the current :class:`Dialect`. Return the return value of the call to the *write* method of the underlying file object.
uk: Запишіть параметр *row* в об’єкт файлу записувача, відформатований відповідно до поточного :class:`Dialect`. Повертає значення, що повертається викликом методу *write* основного файлового об’єкта.

source: Added support of arbitrary iterables.
uk: Додано підтримку довільних ітерацій.

source: Write all elements in *rows* (an iterable of *row* objects as described above) to the writer's file object, formatted according to the current dialect.
uk: Запишіть усі елементи в *рядки* (ітерація об’єктів *рядок*, як описано вище) до об’єкта файлу записувача, відформатованого відповідно до поточного діалекту.

source: Writer objects have the following public attribute:
uk: Об’єкти Writer мають такий публічний атрибут:

source: A read-only description of the dialect in use by the writer.
uk: Доступний лише для читання опис діалекту, який використовує автор.

source: DictWriter objects have the following public method:
uk: Об’єкти DictWriter мають такий відкритий метод:

source: Write a row with the field names (as specified in the constructor) to the writer's file object, formatted according to the current dialect. Return the return value of the :meth:`csvwriter.writerow` call used internally.
uk: Запишіть рядок із іменами полів (як зазначено в конструкторі) до об’єкта файлу записувача, відформатованого відповідно до поточного діалекту. Повертає значення, що повертається внутрішнім викликом :meth:`csvwriter.writerow`.

source: :meth:`writeheader` now also returns the value returned by the :meth:`csvwriter.writerow` method it uses internally.
uk: :meth:`writeheader` тепер також повертає значення, повернуте методом :meth:`csvwriter.writerow`, який він використовує внутрішньо.

source: Examples
uk: Приклади

source: The simplest example of reading a CSV file::
uk: Найпростіший приклад читання файлу CSV:

source: Reading a file with an alternate format::
uk: Читання файлу в альтернативному форматі::

source: The corresponding simplest possible writing example is::
uk: Відповідний найпростіший можливий приклад написання:

source: The same applies to writing in something other than the system default encoding: specify the encoding argument when opening the output file.
uk: Те саме стосується кодування, відмінного від стандартного системного кодування: укажіть аргумент кодування під час відкриття вихідного файлу.

source: Registering a new dialect::
uk: Реєстрація нового діалекту::

source: A slightly more advanced use of the reader --- catching and reporting errors::
uk: Трохи розширеніше використання читача --- виявлення та повідомлення про помилки::

source: And while the module doesn't directly support parsing strings, it can easily be done::
uk: І хоча модуль безпосередньо не підтримує розбір рядків, це легко зробити:

source: Footnotes
uk: Виноски

source: If ``newline=''`` is not specified, newlines embedded inside quoted fields will not be interpreted correctly, and on platforms that use ``\r\n`` linendings on write an extra ``\r`` will be added. It should always be safe to specify ``newline=''``, since the csv module does its own (:term:`universal <universal newlines>`) newline handling.
uk: Якщо ``newline=''`` не вказано, нові рядки, вбудовані в поля в лапках, не будуть інтерпретовані належним чином, а на платформах, які використовують ``\r\n`` розрядки під час запису, буде додатковий ``\r`` додано. Завжди має бути безпечно вказувати ``newline=''``, оскільки модуль csv виконує власну (:term:`universal <universal newlines>`) обробку нового рядка.
