Repository: seanpm2001/python-docs-uk
Catalog: library/csv.po
Languages: uk

source: :mod:`csv` --- CSV File Reading and Writing
uk: :mod:`csv` --- Читання та запис файлу CSV

source: **Source code:** :source:`Lib/csv.py`
uk: **Вихідний код:** :source:`Lib/csv.py`

source: The so-called CSV (Comma Separated Values) format is the most common import and export format for spreadsheets and databases. CSV format was used for many years prior to attempts to describe the format in a standardized way in :rfc:`4180`. The lack of a well-defined standard means that subtle differences often exist in the data produced and consumed by different applications. These differences can make it annoying to process CSV files from multiple sources. Still, while the delimiters and quoting characters vary, the overall format is similar enough that it is possible to write a single module which can efficiently manipulate such data, hiding the details of reading and writing the data from the programmer.
uk: Так званий формат CSV (значення, розділені комами) є найпоширенішим форматом імпорту та експорту для електронних таблиць і баз даних. Формат CSV використовувався протягом багатьох років до того, як його спробували описати стандартизованим способом у :rfc:`4180`. Відсутність чітко визначеного стандарту означає, що часто існують тонкі відмінності в даних, які створюються та споживаються різними програмами. Ці відмінності можуть дратувати обробку файлів CSV із кількох джерел. Тим не менш, хоча розділювачі та символи лапок відрізняються, загальний формат досить схожий, щоб можна було написати один модуль, який може ефективно маніпулювати такими даними, приховуючи деталі читання та запису даних від програміста.

source: The :mod:`csv` module implements classes to read and write tabular data in CSV format. It allows programmers to say, "write this data in the format preferred by Excel," or "read data from this file which was generated by Excel," without knowing the precise details of the CSV format used by Excel. Programmers can also describe the CSV formats understood by other applications or define their own special-purpose CSV formats.
uk: Модуль :mod:`csv` реалізує класи для читання та запису табличних даних у форматі CSV. Це дозволяє програмістам сказати: "записати ці дані у форматі, який віддає перевагу Excel" або "прочитати дані з цього файлу, створеного Excel", не знаючи точних деталей формату CSV, який використовує Excel. Програмісти також можуть описувати формати CSV, які розуміють інші програми, або визначати власні формати CSV спеціального призначення.

source: The :mod:`csv` module's :class:`reader` and :class:`writer` objects read and write sequences. Programmers can also read and write data in dictionary form using the :class:`DictReader` and :class:`DictWriter` classes.
uk: Об’єкти :class:`reader` і :class:`writer` модуля :mod:`csv` читають і записують послідовності. Програмісти також можуть читати та записувати дані у формі словника за допомогою класів :class:`DictReader` і :class:`DictWriter`.

source: :pep:`305` - CSV File API
uk: :pep:`305` - API файлів CSV

source: The Python Enhancement Proposal which proposed this addition to Python.
uk: Пропозиція вдосконалення Python, яка пропонує це доповнення до Python.

source: Module Contents
uk: Зміст модуля

source: The :mod:`csv` module defines the following functions:
uk: Модуль :mod:`csv` визначає такі функції:

source: Return a reader object which will iterate over lines in the given *csvfile*. *csvfile* can be any object which supports the :term:`iterator` protocol and returns a string each time its :meth:`!__next__` method is called --- :term:`file objects <file object>` and list objects are both suitable. If *csvfile* is a file object, it should be opened with ``newline=''``. [1]_ An optional *dialect* parameter can be given which is used to define a set of parameters specific to a particular CSV dialect. It may be an instance of a subclass of the :class:`Dialect` class or one of the strings returned by the :func:`list_dialects` function. The other optional *fmtparams* keyword arguments can be given to override individual formatting parameters in the current dialect. For full details about the dialect and formatting parameters, see section :ref:`csv-fmt-params`.
uk: Повертає об’єкт читання, який буде виконувати ітерацію по рядках у заданому *csv-файлі*. *csvfile* може бути будь-яким об’єктом, який підтримує протокол :term:`iterator` і повертає рядок кожного разу, коли викликається його метод :meth:`!__next__` --- :term:`файлові об’єкти <file object>` і об’єкти списку є обома підходить. Якщо *csvfile* є файловим об’єктом, його слід відкрити за допомогою ``newline=''``. [1]_ Можна вказати необов’язковий параметр *dialect*, який використовується для визначення набору параметрів, специфічних для конкретного діалекту CSV. Це може бути екземпляр підкласу класу :class:`Dialect` або один із рядків, які повертає функція :func:`list_dialects`. Інші необов’язкові аргументи ключового слова *fmtparams* можна надати для перевизначення окремих параметрів форматування в поточному діалекті. Щоб отримати повну інформацію про діалект і параметри форматування, перегляньте розділ :ref:`csv-fmt-params`.

source: Each row read from the csv file is returned as a list of strings. No automatic data type conversion is performed unless the ``QUOTE_NONNUMERIC`` format option is specified (in which case unquoted fields are transformed into floats).
uk: Кожен рядок, прочитаний із файлу csv, повертається як список рядків. Автоматичне перетворення типу даних не виконується, якщо не вказано параметр формату ``QUOTE_NONNUMERIC`` (у цьому випадку поля без лапок перетворюються на числа з плаваючою точкою).

source: A short usage example::
uk: Короткий приклад використання::

source: Return a writer object responsible for converting the user's data into delimited strings on the given file-like object. *csvfile* can be any object with a :func:`write` method. If *csvfile* is a file object, it should be opened with ``newline=''`` [1]_. An optional *dialect* parameter can be given which is used to define a set of parameters specific to a particular CSV dialect. It may be an instance of a subclass of the :class:`Dialect` class or one of the strings returned by the :func:`list_dialects` function. The other optional *fmtparams* keyword arguments can be given to override individual formatting parameters in the current dialect. For full details about dialects and formatting parameters, see the :ref:`csv-fmt-params` section. To make it as easy as possible to interface with modules which implement the DB API, the value :const:`None` is written as the empty string. While this isn't a reversible transformation, it makes it easier to dump SQL NULL data values to CSV files without preprocessing the data returned from a ``cursor.fetch*`` call. All other non-string data are stringified with :func:`str` before being written.
uk: Повертає об’єкт запису, відповідальний за перетворення даних користувача в рядки з роздільниками на даному файлоподібному об’єкті. *csvfile* може бути будь-яким об’єктом із методом :func:`write`. Якщо *csvfile* є файловим об’єктом, його слід відкрити за допомогою ``newline=''`` [1]_. Можна вказати необов’язковий параметр *dialect*, який використовується для визначення набору параметрів, специфічних для конкретного діалекту CSV. Це може бути екземпляр підкласу класу :class:`Dialect` або один із рядків, які повертає функція :func:`list_dialects`. Інші необов’язкові аргументи ключового слова *fmtparams* можна надати для перевизначення окремих параметрів форматування в поточному діалекті. Щоб отримати повну інформацію про діалекти та параметри форматування, перегляньте розділ :ref:`csv-fmt-params`. Щоб якомога легше взаємодіяти з модулями, які реалізують API БД, значення :const:`None` записується як порожній рядок. Хоча це не є оборотним перетворенням, воно спрощує скидання значень даних SQL NULL у файли CSV без попередньої обробки даних, отриманих із виклику ``cursor.fetch*``. Усі інші нерядкові дані перед записом утворюються в рядки за допомогою :func:`str`.

source: Associate *dialect* with *name*. *name* must be a string. The dialect can be specified either by passing a sub-class of :class:`Dialect`, or by *fmtparams* keyword arguments, or both, with keyword arguments overriding parameters of the dialect. For full details about dialects and formatting parameters, see section :ref:`csv-fmt-params`.
uk: Пов’яжіть *діалект* з *ім’ям*. *ім’я* має бути рядком. Діалект можна вказати або шляхом передачі підкласу :class:`Dialect`, або за допомогою аргументів ключового слова *fmtparams*, або обох, причому аргументи ключового слова замінюють параметри діалекту. Щоб отримати повну інформацію про діалекти та параметри форматування, перегляньте розділ :ref:`csv-fmt-params`.

source: Delete the dialect associated with *name* from the dialect registry. An :exc:`Error` is raised if *name* is not a registered dialect name.
uk: Видаліть діалект, пов’язаний з *name*, із реєстру діалектів. Якщо *name* не є зареєстрованою назвою діалекту, виникає помилка :exc:`Error`.

source: Return the dialect associated with *name*. An :exc:`Error` is raised if *name* is not a registered dialect name. This function returns an immutable :class:`Dialect`.
uk: Повертає діалект, пов’язаний з *ім’ям*. Якщо *name* не є зареєстрованою назвою діалекту, виникає помилка :exc:`Error`. Ця функція повертає незмінний :class:`Dialect`.

source: Return the names of all registered dialects.
uk: Повернути назви всіх зареєстрованих діалектів.

source: Returns the current maximum field size allowed by the parser. If *new_limit* is given, this becomes the new limit.
uk: Повертає поточний максимальний розмір поля, дозволений аналізатором. Якщо задано *new_limit*, це стає новим лімітом.

source: The :mod:`csv` module defines the following classes:
uk: Модуль :mod:`csv` визначає такі класи:

source: Create an object that operates like a regular reader but maps the information in each row to a :class:`dict` whose keys are given by the optional *fieldnames* parameter.
uk: Створіть об’єкт, який працює як звичайний читач, але зіставляє інформацію в кожному рядку з :class:`dict`, ключі якого надаються необов’язковим параметром *fieldnames*.

source: The *fieldnames* parameter is a :term:`sequence`. If *fieldnames* is omitted, the values in the first row of file *f* will be used as the fieldnames. Regardless of how the fieldnames are determined, the dictionary preserves their original ordering.
uk: Параметр *fieldnames* є :term:`sequence`. Якщо *fieldnames* пропущено, значення в першому рядку файлу *f* використовуватимуться як імена полів. Незалежно від того, як визначено назви полів, словник зберігає їх початковий порядок.

source: If a row has more fields than fieldnames, the remaining data is put in a list and stored with the fieldname specified by *restkey* (which defaults to ``None``). If a non-blank row has fewer fields than fieldnames, the missing values are filled-in with the value of *restval* (which defaults to ``None``).
uk: Якщо рядок містить більше полів, ніж назв полів, дані, що залишилися, поміщаються в список і зберігаються з іменем поля, визначеним *restkey* (за замовчуванням значення "Немає"). Якщо непорожній рядок містить менше полів, ніж імена полів, відсутні значення заповнюються значенням *restval* (яке за замовчуванням ``None``).

source: All other optional or keyword arguments are passed to the underlying :class:`reader` instance.
uk: Усі інші необов’язкові або ключові аргументи передаються базовому екземпляру :class:`reader`.

source: Returned rows are now of type :class:`OrderedDict`.
uk: Повернені рядки тепер мають тип :class:`OrderedDict`.

source: Returned rows are now of type :class:`dict`.
uk: Повернені рядки тепер мають тип :class:`dict`.

source: Create an object which operates like a regular writer but maps dictionaries onto output rows. The *fieldnames* parameter is a :mod:`sequence <collections.abc>` of keys that identify the order in which values in the dictionary passed to the :meth:`writerow` method are written to file *f*. The optional *restval* parameter specifies the value to be written if the dictionary is missing a key in *fieldnames*. If the dictionary passed to the :meth:`writerow` method contains a key not found in *fieldnames*, the optional *extrasaction* parameter indicates what action to take. If it is set to ``'raise'``, the default value, a :exc:`ValueError` is raised. If it is set to ``'ignore'``, extra values in the dictionary are ignored. Any other optional or keyword arguments are passed to the underlying :class:`writer` instance.
uk: Створіть об’єкт, який працює як звичайний записувач, але зіставляє словники з вихідними рядками. Параметр *fieldnames* — це :mod:`послідовність <collections.abc>` ключів, які визначають порядок, у якому значення зі словника, переданого в метод :meth:`writerow`, записуються у файл *f*. Додатковий параметр *restval* визначає значення, яке буде записане, якщо в словнику відсутній ключ у *полях*. Якщо словник, переданий до методу :meth:`writerow`, містить ключ, якого немає в *fieldnames*, необов’язковий параметр *extrasaction* вказує, яку дію потрібно виконати. Якщо встановлено ``'raise'``, значення за замовчуванням, викликається :exc:`ValueError`. Якщо встановлено значення ``'ignore''``, додаткові значення в словнику ігноруються. Будь-які інші додаткові або ключові аргументи передаються базовому екземпляру :class:`writer`.

source: Note that unlike the :class:`DictReader` class, the *fieldnames* parameter of the :class:`DictWriter` class is not optional.
uk: Зауважте, що на відміну від класу :class:`DictReader`, параметр *fieldnames* класу :class:`DictWriter` необов’язковий.

source: The :class:`Dialect` class is a container class whose attributes contain information for how to handle doublequotes, whitespace, delimiters, etc. Due to the lack of a strict CSV specification, different applications produce subtly different CSV data. :class:`Dialect` instances define how :class:`reader` and :class:`writer` instances behave.
uk: Клас :class:`Dialect` — це клас-контейнер, атрибути якого містять інформацію про те, як обробляти подвійні лапки, пробіли, розділювачі тощо. Через відсутність суворої специфікації CSV різні програми створюють дещо різні дані CSV. Екземпляри :class:`Dialect` визначають, як поводитимуться екземпляри :class:`reader` і :class:`writer`.

source: All available :class:`Dialect` names are returned by :func:`list_dialects`, and they can be registered with specific :class:`reader` and :class:`writer` classes through their initializer (``__init__``) functions like this::
uk: Усі доступні назви :class:`Dialect` повертаються :func:`list_dialects`, і їх можна зареєструвати в певних класах :class:`reader` і :class:`writer` через їх ініціалізатор (``__init__``) функціонує так::

source: The :class:`excel` class defines the usual properties of an Excel-generated CSV file. It is registered with the dialect name ``'excel'``.
uk: Клас :class:`excel` визначає звичайні властивості файлу CSV, створеного Excel. Його зареєстровано з діалектною назвою ``'excel``.

source: The :class:`excel_tab` class defines the usual properties of an Excel-generated TAB-delimited file. It is registered with the dialect name ``'excel-tab'``.
uk: Клас :class:`excel_tab` визначає звичайні властивості створеного Excel файлу з роздільниками TAB. Його зареєстровано з діалектною назвою ``'excel-tab``.

source: The :class:`unix_dialect` class defines the usual properties of a CSV file generated on UNIX systems, i.e. using ``'\n'`` as line terminator and quoting all fields. It is registered with the dialect name ``'unix'``.
uk: Клас :class:`unix_dialect` визначає звичайні властивості файлу CSV, створеного в системах UNIX, тобто використання ``'\n'`` як символ закінчення рядка та взяття всіх полів у лапки. Він зареєстрований під діалектною назвою ``'unix``.

source: The :class:`Sniffer` class is used to deduce the format of a CSV file.
uk: Клас :class:`Sniffer` використовується для визначення формату файлу CSV.

source: The :class:`Sniffer` class provides two methods:
uk: Клас :class:`Sniffer` надає два методи:

source: Analyze the given *sample* and return a :class:`Dialect` subclass reflecting the parameters found. If the optional *delimiters* parameter is given, it is interpreted as a string containing possible valid delimiter characters.
uk: Проаналізуйте поданий *зразок* і поверніть підклас :class:`Dialect`, що відображає знайдені параметри. Якщо вказано необов’язковий параметр *роздільники*, він інтерпретується як рядок, що містить можливі дійсні символи роздільників.

source: Analyze the sample text (presumed to be in CSV format) and return :const:`True` if the first row appears to be a series of column headers. Inspecting each column, one of two key criteria will be considered to estimate if the sample contains a header:
uk: Проаналізуйте зразок тексту (імовірно у форматі CSV) і поверніть :const:`True`, якщо перший рядок виглядає як ряд заголовків стовпців. Перевіряючи кожен стовпець, буде розглянуто один із двох ключових критеріїв, щоб оцінити, чи містить вибірка заголовок:

source: the second through n-th rows contain numeric values
uk: з другого по n-й рядки містять числові значення

source: the second through n-th rows contain strings where at least one value's length differs from that of the putative header of that column.
uk: рядки з другого по n-й містять рядки, у яких довжина принаймні одного значення відрізняється від довжини передбачуваного заголовка цього стовпця.

source: Twenty rows after the first row are sampled; if more than half of columns + rows meet the criteria, :const:`True` is returned.
uk: Через двадцять рядів після першого ряду проводиться вибірка; якщо більше половини стовпців + рядків відповідають критеріям, повертається :const:`True`.

source: This method is a rough heuristic and may produce both false positives and negatives.
uk: Цей метод є грубим евристичним і може давати як помилкові позитивні, так і негативні результати.

source: An example for :class:`Sniffer` use::
uk: Приклад використання :class:`Sniffer`::

source: The :mod:`csv` module defines the following constants:
uk: Модуль :mod:`csv` визначає такі константи:

source: Instructs :class:`writer` objects to quote all fields.
uk: Вказує об’єктам :class:`writer` взяти всі поля в лапки.

source: Instructs :class:`writer` objects to only quote those fields which contain special characters such as *delimiter*, *quotechar* or any of the characters in *lineterminator*.
uk: Вказує об’єктам :class:`writer` брати в лапки лише ті поля, які містять спеціальні символи, такі як *роздільник*, *quotechar* або будь-які символи в *lineterminator*.

source: Instructs :class:`writer` objects to quote all non-numeric fields.
uk: Вказує об’єктам :class:`writer` взяти в лапки всі нечислові поля.

source: Instructs the reader to convert all non-quoted fields to type *float*.
uk: Вказує читачеві перетворити всі поля без лапок на тип *float*.

source: Instructs :class:`writer` objects to never quote fields. When the current *delimiter* occurs in output data it is preceded by the current *escapechar* character. If *escapechar* is not set, the writer will raise :exc:`Error` if any characters that require escaping are encountered.
uk: Наказує об’єктам :class:`writer` ніколи не брати поля в лапки. Коли поточний *роздільник* зустрічається у вихідних даних, йому передує поточний символ *escapechar*. Якщо *escapechar* не встановлено, запис викличе :exc:`Error`, якщо зустрінеться будь-який символ, який потребує екранування.

source: Instructs :class:`reader` to perform no special processing of quote characters.
uk: Вказує :class:`reader` не виконувати спеціальної обробки символів лапок.

source: The :mod:`csv` module defines the following exception:
uk: Модуль :mod:`csv` визначає такий виняток:

source: Raised by any of the functions when an error is detected.
uk: Викликається будь-якою з функцій у разі виявлення помилки.

source: Dialects and Formatting Parameters
uk: Діалекти та параметри форматування

source: To make it easier to specify the format of input and output records, specific formatting parameters are grouped together into dialects. A dialect is a subclass of the :class:`Dialect` class having a set of specific methods and a single :meth:`validate` method. When creating :class:`reader` or :class:`writer` objects, the programmer can specify a string or a subclass of the :class:`Dialect` class as the dialect parameter. In addition to, or instead of, the *dialect* parameter, the programmer can also specify individual formatting parameters, which have the same names as the attributes defined below for the :class:`Dialect` class.
uk: Щоб спростити визначення формату вхідних і вихідних записів, окремі параметри форматування згруповані разом у діалекти. Діалект — це підклас класу :class:`Dialect`, який має набір специфічних методів і єдиний метод :meth:`validate`. Під час створення об’єктів :class:`reader` або :class:`writer` програміст може вказати рядок або підклас класу :class:`Dialect` як параметр діалекту. На додаток до параметра *dialect* або замість нього програміст також може вказати окремі параметри форматування, які мають ті самі імена, що й атрибути, визначені нижче для класу :class:`Dialect`.

source: Dialects support the following attributes:
uk: Діалекти підтримують такі атрибути:

source: A one-character string used to separate fields. It defaults to ``','``.
uk: Односимвольний рядок, який використовується для розділення полів. За замовчуванням ``',''``.

source: Controls how instances of *quotechar* appearing inside a field should themselves be quoted. When :const:`True`, the character is doubled. When :const:`False`, the *escapechar* is used as a prefix to the *quotechar*. It defaults to :const:`True`.
uk: Керує тим, як екземпляри *quotechar*, що з’являються всередині поля, повинні братися в лапки. Коли :const:`True`, символ подвоюється. Коли :const:`False`, *escapechar* використовується як префікс до *quotechar*. За замовчуванням :const:`True`.

source: On output, if *doublequote* is :const:`False` and no *escapechar* is set, :exc:`Error` is raised if a *quotechar* is found in a field.
uk: Під час виведення, якщо *doublequote* має значення :const:`False` і *escapechar* не встановлено, виникає повідомлення :exc:`Error`, якщо *quotechar* знайдено в полі.

source: A one-character string used by the writer to escape the *delimiter* if *quoting* is set to :const:`QUOTE_NONE` and the *quotechar* if *doublequote* is :const:`False`. On reading, the *escapechar* removes any special meaning from the following character. It defaults to :const:`None`, which disables escaping.
uk: Односимвольний рядок, який використовується автором для екранування *роздільника*, якщо *quoting* встановлено як :const:`QUOTE_NONE`, і *quotechar*, якщо *doublequote* має значення :const:`False`. Під час читання *escapechar* видаляє будь-яке спеціальне значення наступного символу. За замовчуванням :const:`None`, що вимикає екранування.

source: The string used to terminate lines produced by the :class:`writer`. It defaults to ``'\r\n'``.
uk: Рядок, який використовується для завершення рядків, створених :class:`writer`. За замовчуванням ``'\r\n'``.

source: The :class:`reader` is hard-coded to recognise either ``'\r'`` or ``'\n'`` as end-of-line, and ignores *lineterminator*. This behavior may change in the future.
uk: :class:`reader` жорстко розпізнає ``'\r'`` або ``'\n'`` як кінець рядка та ігнорує *lineterminator*. Така поведінка може змінитися в майбутньому.
