Repository: seanpm2001/python-docs-uk
Catalog: library/functions.po
Languages: uk

source: This function is added to the built-in namespace by the :mod:`site` module.
uk: Ця функція додається до вбудованого простору імен модулем :mod:`site`.

source: Changes to :mod:`pydoc` and :mod:`inspect` mean that the reported signatures for callables are now more comprehensive and consistent.
uk: Зміни в :mod:`pydoc` і :mod:`inspect` означають, що звітні підписи для викликів тепер більш повні та узгоджені.

source: Convert an integer number to a lowercase hexadecimal string prefixed with "0x". If *x* is not a Python :class:`int` object, it has to define an :meth:`__index__` method that returns an integer. Some examples:
uk: Перетворення цілого числа на шістнадцятковий рядок у нижньому регістрі з префіксом "0x". Якщо *x* не є об’єктом Python :class:`int`, він має визначити метод :meth:`__index__`, який повертає ціле число. Деякі приклади:

source: If you want to convert an integer number to an uppercase or lower hexadecimal string with prefix or not, you can use either of the following ways:
uk: Якщо ви хочете перетворити ціле число у верхній або нижній шістнадцятковий рядок із префіксом або без нього, ви можете скористатися одним із наведених нижче способів:

source: See also :func:`int` for converting a hexadecimal string to an integer using a base of 16.
uk: Дивіться також :func:`int` для перетворення шістнадцяткового рядка в ціле число за основою 16.

source: To obtain a hexadecimal string representation for a float, use the :meth:`float.hex` method.
uk: Щоб отримати шістнадцяткове представлення рядка для float, використовуйте метод :meth:`float.hex`.

source: Return the "identity" of an object. This is an integer which is guaranteed to be unique and constant for this object during its lifetime. Two objects with non-overlapping lifetimes may have the same :func:`id` value.
uk: Повернути "ідентичність" об'єкта. Це ціле число, яке гарантовано буде унікальним і постійним для цього об’єкта протягом усього його існування. Два об’єкти з що існують у різні проміжки часу можуть мати однакові значення :func:`id`.

source: Raises an :ref:`auditing event <auditing>` ``builtins.id`` with argument ``id``.
uk: Викликає :ref:`подію аудиту <auditing>` ``builtins.id`` з аргументом ``id``.

source: If the *prompt* argument is present, it is written to standard output without a trailing newline. The function then reads a line from input, converts it to a string (stripping a trailing newline), and returns that. When EOF is read, :exc:`EOFError` is raised. Example::
uk: Якщо присутній аргумент *prompt*, він записується в стандартний вивід без символу нового рядка. Потім функція зчитує рядок із вхідних даних, перетворює його на рядок (вилучаючи кінцевий новий рядок) і повертає його. Під час читання EOF виникає :exc:`EOFError`. Приклад::

source: If the :mod:`readline` module was loaded, then :func:`input` will use it to provide elaborate line editing and history features.
uk: Якщо модуль :mod:`readline` було завантажено, то :func:`input` використовуватиме його для забезпечення складних функцій редагування рядка та історії.

source: Raises an :ref:`auditing event <auditing>` ``builtins.input`` with argument ``prompt``.
uk: Викликає :ref:`подію аудиту <auditing>` ``builtins.input`` з аргументом ``prompt``.

source: Raises an :ref:`auditing event <auditing>` ``builtins.input`` with argument ``prompt`` before reading input
uk: Викликає :ref:`подію аудиту <auditing>` ``builtins.input`` з аргументом ``prompt`` перед читанням введення

source: Raises an :ref:`auditing event <auditing>` ``builtins.input/result`` with argument ``result``.
uk: Викликає :ref:`подію аудиту <auditing>` ``builtins.input/result`` з аргументом ``result``.

source: Raises an :ref:`auditing event <auditing>` ``builtins.input/result`` with the result after successfully reading input.
uk: Викликає :ref:`подію аудиту <auditing>` ``builtins.input/result`` з результатом після успішного читання введення.

source: Return an integer object constructed from a number or string *x*, or return ``0`` if no arguments are given. If *x* defines :meth:`__int__`, ``int(x)`` returns ``x.__int__()``. If *x* defines :meth:`__index__`, it returns ``x.__index__()``. If *x* defines :meth:`__trunc__`, it returns ``x.__trunc__()``. For floating point numbers, this truncates towards zero.
uk: Повертає цілочисельний об’єкт, створений з числа або рядка *x*, або повертає ``0``, якщо не надано аргументів. Якщо *x* визначає :meth:`__int__`, ``int(x)`` повертає ``x.__int__()``. Якщо *x* визначає :meth:`__index__`, він повертає ``x.__index__()``. Якщо *x* визначає :meth:`__trunc__`, він повертає ``x.__trunc__()``. Для чисел з плаваючою комою це скорочується до нуля.

source: If *x* is not a number or if *base* is given, then *x* must be a string, :class:`bytes`, or :class:`bytearray` instance representing an :ref:`integer literal <integers>` in radix *base*. Optionally, the literal can be preceded by ``+`` or ``-`` (with no space in between) and surrounded by whitespace. A base-n literal consists of the digits 0 to n-1, with ``a`` to ``z`` (or ``A`` to ``Z``) having values 10 to 35. The default *base* is 10. The allowed values are 0 and 2--36. Base-2, -8, and -16 literals can be optionally prefixed with ``0b``/``0B``, ``0o``/``0O``, or ``0x``/``0X``, as with integer literals in code. Base 0 means to interpret exactly as a code literal, so that the actual base is 2, 8, 10, or 16, and so that ``int('010', 0)`` is not legal, while ``int('010')`` is, as well as ``int('010', 8)``.
uk: Якщо *x* не є числом або задано *base*, тоді *x* має бути рядком, :class:`bytes` або екземпляром :class:`bytearray`, який представляє :ref:`цілочисельний літерал <integers>` в корені *основа*. За бажанням перед літералом може стояти ``+`` або ``-`` (без пробілу між ними) і оточений пробілом. Літерал base-n складається з цифр від 0 до n-1, причому від ``a`` до ``z`` (або ``A`` до ``Z``) мають значення від 10 до 35. За замовчуванням *base* дорівнює 10. Дозволені значення 0 і 2-36. Літерали Base-2, -8 і -16 можуть мати префікс ``0b``/``0B``, ``0o``/``0O`` або ``0x``/``0X``, як і з цілими літералами в коді. База 0 означає інтерпретувати точно як кодовий літерал, так що фактична база дорівнює 2, 8, 10 або 16, і тому ``int('010', 0)`` є недопустимим, тоді як ``int( '010')`` є, а також ``int('010', 8)``.

source: The integer type is described in :ref:`typesnumeric`.
uk: Цілочисельний тип описано в :ref:`typesnumeric`.

source: If *base* is not an instance of :class:`int` and the *base* object has a :meth:`base.__index__ <object.__index__>` method, that method is called to obtain an integer for the base. Previous versions used :meth:`base.__int__ <object.__int__>` instead of :meth:`base.__index__ <object.__index__>`.
uk: Якщо *base* не є екземпляром :class:`int` і об’єкт *base* має метод :meth:`base.__index__ <object.__index__>`, цей метод викликається для отримання цілого числа для бази. У попередніх версіях використовувався :meth:`base.__int__ <object.__int__>` замість :meth:`base.__index__ <object.__index__>`.

source: Falls back to :meth:`__index__` if :meth:`__int__` is not defined.
uk: Повертається до :meth:`__index__`, якщо :meth:`__int__` не визначено.

source: *classinfo* can be a :ref:`types-union`.
uk: *classinfo* може бути :ref:`types-union`.

source: Return ``True`` if *class* is a subclass (direct, indirect, or :term:`virtual <abstract base class>`) of *classinfo*. A class is considered a subclass of itself. *classinfo* may be a tuple of class objects (or recursively, other such tuples) or a :ref:`types-union`, in which case return ``True`` if *class* is a subclass of any entry in *classinfo*. In any other case, a :exc:`TypeError` exception is raised.
uk: Повертає ``True``, якщо *class* є підкласом (прямим, непрямим або :term:`віртуальним <abstract base class>`) *classinfo*. Клас вважається підкласом самого себе. *classinfo* може бути кортежем об’єктів класу (або рекурсивно іншими подібними кортежами) або :ref:`types-union`, у цьому випадку повертає ``True``, якщо *class* є підкласом будь-якого запису в *інформація про клас*. У будь-якому іншому випадку виникає виняток :exc:`TypeError`.

source: Return an :term:`iterator` object. The first argument is interpreted very differently depending on the presence of the second argument. Without a second argument, *object* must be a collection object which supports the :term:`iterable` protocol (the :meth:`__iter__` method), or it must support the sequence protocol (the :meth:`__getitem__` method with integer arguments starting at ``0``). If it does not support either of those protocols, :exc:`TypeError` is raised. If the second argument, *sentinel*, is given, then *object* must be a callable object. The iterator created in this case will call *object* with no arguments for each call to its :meth:`~iterator.__next__` method; if the value returned is equal to *sentinel*, :exc:`StopIteration` will be raised, otherwise the value will be returned.
uk: Повертає об’єкт :term:`iterator`. Перший аргумент інтерпретується дуже по-різному в залежності від наявності другого аргументу. Без другого аргументу *object* має бути об’єктом колекції, який підтримує протокол :term:`iterable` (метод :meth:`__iter__`), або він має підтримувати протокол послідовності (метод :meth:`__getitem__` з цілими аргументами, починаючи з ``0``). Якщо він не підтримує жодного з цих протоколів, виникає :exc:`TypeError`. Якщо задано другий аргумент, *sentinel*, то *object* має бути викликаним об’єктом. Ітератор, створений у цьому випадку, буде викликати *object* без аргументів для кожного виклику його методу :meth:`~iterator.__next__`; якщо повернуте значення дорівнює *sentinel*, :exc:`StopIteration` буде піднято, інакше буде повернено значення.

source: See also :ref:`typeiter`.
uk: Дивіться також :ref:`typeiter`.

source: One useful application of the second form of :func:`iter` is to build a block-reader. For example, reading fixed-width blocks from a binary database file until the end of file is reached::
uk: Одним із корисних застосувань другої форми :func:`iter` є створення програми для читання блоків. Наприклад, читання блоків фіксованої ширини з бінарного файлу бази даних до досягнення кінця файлу::

source: Return the length (the number of items) of an object. The argument may be a sequence (such as a string, bytes, tuple, list, or range) or a collection (such as a dictionary, set, or frozen set).
uk: Повертає довжину (кількість елементів) об’єкта. Аргументом може бути послідовність (наприклад, рядок, байти, кортеж, список або діапазон) або колекція (наприклад, словник, набір або заморожений набір).

source: ``len`` raises :exc:`OverflowError` on lengths larger than :data:`sys.maxsize`, such as :class:`range(2 ** 100) <range>`.
uk: ``len`` викликає :exc:`OverflowError` для довжин, більших за :data:`sys.maxsize`, наприклад :class:`range(2 ** 100) <range>`.

source: Rather than being a function, :class:`list` is actually a mutable sequence type, as documented in :ref:`typesseq-list` and :ref:`typesseq`.
uk: Замість того, щоб бути функцією, :class:`list` насправді є змінним типом послідовності, як описано в :ref:`typesseq-list` і :ref:`typesseq`.

source: Update and return a dictionary representing the current local symbol table. Free variables are returned by :func:`locals` when it is called in function blocks, but not in class blocks. Note that at the module level, :func:`locals` and :func:`globals` are the same dictionary.
uk: Оновити та повернути словник, що представляє поточну локальну таблицю символів. Вільні змінні повертає :func:`locals`, коли він викликається у функціональних блоках, але не в блоках класів. Зауважте, що на рівні модуля :func:`locals` і :func:`globals` є одним і тим же словником.

source: The contents of this dictionary should not be modified; changes may not affect the values of local and free variables used by the interpreter.
uk: Вміст цього словника не можна змінювати; зміни не можуть впливати на значення локальних і вільних змінних, що використовуються інтерпретатором.

source: Return the largest item in an iterable or the largest of two or more arguments.
uk: Повертає найбільший елемент у ітерації або найбільший з двох чи більше аргументів.

source: If one positional argument is provided, it should be an :term:`iterable`. The largest item in the iterable is returned. If two or more positional arguments are provided, the largest of the positional arguments is returned.
uk: Якщо надається один позиційний аргумент, це має бути :term:`iterable`. Повертається найбільший елемент ітерації. Якщо надано два або більше позиційних аргументів, повертається найбільший із позиційних аргументів.

source: There are two optional keyword-only arguments. The *key* argument specifies a one-argument ordering function like that used for :meth:`list.sort`. The *default* argument specifies an object to return if the provided iterable is empty. If the iterable is empty and *default* is not provided, a :exc:`ValueError` is raised.
uk: Є два необов’язкові аргументи лише для ключових слів. Аргумент *key* визначає функцію впорядкування з одним аргументом, подібну до тієї, яка використовується для :meth:`list.sort`. Аргумент *default* визначає об’єкт, який повертається, якщо наданий ітераційний елемент порожній. Якщо iterable порожній і *default* не вказано, виникає :exc:`ValueError`.

source: If multiple items are maximal, the function returns the first one encountered. This is consistent with other sort-stability preserving tools such as ``sorted(iterable, key=keyfunc, reverse=True)[0]`` and ``heapq.nlargest(1, iterable, key=keyfunc)``.
uk: Якщо кілька елементів є максимальними, функція повертає перший знайдений. Це узгоджується з іншими інструментами збереження стабільності сортування, такими як ``sorted(iterable, key=keyfunc, reverse=True)[0]`` і ``heapq.nlargest(1, iterable, key=keyfunc)``.

source: The *default* keyword-only argument.
uk: Аргумент *default* лише для ключового слова.

source: The *key* can be ``None``.
uk: *Ключ* може бути ``None``.

source: Return a "memory view" object created from the given argument. See :ref:`typememoryview` for more information.
uk: Повертає об’єкт "перегляд пам’яті", створений із заданого аргументу. Перегляньте :ref:`typememoryview` для отримання додаткової інформації.

source: Return the smallest item in an iterable or the smallest of two or more arguments.
uk: Повертає найменший елемент у ітерації або найменший з двох чи більше аргументів.

source: If one positional argument is provided, it should be an :term:`iterable`. The smallest item in the iterable is returned. If two or more positional arguments are provided, the smallest of the positional arguments is returned.
uk: Якщо надається один позиційний аргумент, це має бути :term:`iterable`. Повертається найменший елемент ітерації. Якщо надано два або більше позиційних аргументів, повертається найменший із позиційних аргументів.

source: If multiple items are minimal, the function returns the first one encountered. This is consistent with other sort-stability preserving tools such as ``sorted(iterable, key=keyfunc)[0]`` and ``heapq.nsmallest(1, iterable, key=keyfunc)``.
uk: Якщо декілька елементів є мінімальними, функція повертає перший знайдений. Це узгоджується з іншими інструментами збереження стабільності сортування, такими як ``sorted(iterable, key=keyfunc)[0]`` і ``heapq.nsmallest(1, iterable, key=keyfunc)``.

source: Retrieve the next item from the :term:`iterator` by calling its :meth:`~iterator.__next__` method. If *default* is given, it is returned if the iterator is exhausted, otherwise :exc:`StopIteration` is raised.
uk: Отримайте наступний елемент із :term:`iterator`, викликавши його метод :meth:`~iterator.__next__`. Якщо задано *default*, воно повертається, якщо ітератор вичерпано, інакше :exc:`StopIteration` викликається.

source: Return a new featureless object. :class:`object` is a base for all classes. It has methods that are common to all instances of Python classes. This function does not accept any arguments.
uk: Повернути новий безособливий об’єкт. :class:`object` є основою для всіх класів. Він має методи, які є спільними для всіх екземплярів класів Python. Ця функція не приймає жодних аргументів.

source: :class:`object` does *not* have a :attr:`~object.__dict__`, so you can't assign arbitrary attributes to an instance of the :class:`object` class.
uk: :class:`object` *не* має :attr:`~object.__dict__`, тому ви не можете призначити довільні атрибути екземпляру класу :class:`object`.

source: Convert an integer number to an octal string prefixed with "0o". The result is a valid Python expression. If *x* is not a Python :class:`int` object, it has to define an :meth:`__index__` method that returns an integer. For example:
uk: Перетворення цілого числа на вісімковий рядок із префіксом "0o". Результатом є дійсний вираз Python. Якщо *x* не є об’єктом Python :class:`int`, він має визначити метод :meth:`__index__`, який повертає ціле число. Наприклад:

source: If you want to convert an integer number to an octal string either with the prefix "0o" or not, you can use either of the following ways.
uk: Якщо ви хочете перетворити ціле число на вісімковий рядок із префіксом "0o" чи ні, ви можете скористатися одним із наведених нижче способів.

source: Open *file* and return a corresponding :term:`file object`. If the file cannot be opened, an :exc:`OSError` is raised. See :ref:`tut-files` for more examples of how to use this function.
uk: Відкрийте *файл* і поверніть відповідний :term:`file object`. Якщо файл неможливо відкрити, виникає :exc:`OSError`. Перегляньте :ref:`tut-files` для отримання додаткових прикладів використання цієї функції.

source: *file* is a :term:`path-like object` giving the pathname (absolute or relative to the current working directory) of the file to be opened or an integer file descriptor of the file to be wrapped. (If a file descriptor is given, it is closed when the returned I/O object is closed unless *closefd* is set to ``False``.)
uk: *file* — це :term:`path-like object`, що надає шлях (абсолютний або відносний до поточного робочого каталогу) до файлу, який потрібно відкрити, або цілочисельний файловий дескриптор файлу, який потрібно обернути. (Якщо задано дескриптор файлу, він закривається, коли повертається об’єкт вводу/виводу, якщо *closefd* не має значення ``False``.)

source: Character
uk: характер

source: Meaning
uk: Значення

source: open for reading (default)
uk: відкритий для читання (за замовчуванням)

source: open for writing, truncating the file first
uk: відкрити для запису, спочатку скоротивши файл

source: open for exclusive creation, failing if the file already exists
uk: відкрити для ексклюзивного створення, якщо файл уже існує

source: open for writing, appending to the end of file if it exists
uk: відкрито для запису, додаючи в кінець файлу, якщо він існує

source: binary mode
uk: двійковий режим

source: text mode (default)
uk: текстовий режим (за замовчуванням)

source: open for updating (reading and writing)
uk: відкритий для оновлення (читання та запис)

source: The default mode is ``'r'`` (open for reading text, a synonym of ``'rt'``). Modes ``'w+'`` and ``'w+b'`` open and truncate the file. Modes ``'r+'`` and ``'r+b'`` open the file with no truncation.
uk: Типовим режимом є ``'r'`` (відкритий для читання тексту, синонім ``'rt'``). Режими ``'w+'`` і ``'w+b'`` відкривають і скорочують файл. Режими ``'r+'`` і ``'r+b'`` відкривають файл без скорочення.

source: As mentioned in the :ref:`io-overview`, Python distinguishes between binary and text I/O. Files opened in binary mode (including ``'b'`` in the *mode* argument) return contents as :class:`bytes` objects without any decoding. In text mode (the default, or when ``'t'`` is included in the *mode* argument), the contents of the file are returned as :class:`str`, the bytes having been first decoded using a platform-dependent encoding or using the specified *encoding* if given.
uk: Як згадувалося в :ref:`io-overview`, Python розрізняє двійковий і текстовий ввід-вивід. Файли, відкриті в двійковому режимі (включаючи ``'b'`` в аргументі *mode*) повертають вміст як об’єкти :class:`bytes` без будь-якого декодування. У текстовому режимі (за замовчуванням або коли ``'t'`` включено в аргумент *mode*) вміст файлу повертається як :class:`str`, байти, які спочатку були декодовані за допомогою платформи -залежне кодування або використання зазначеного *кодування*, якщо воно вказано.

source: Python doesn't depend on the underlying operating system's notion of text files; all the processing is done by Python itself, and is therefore platform-independent.
uk: Python не залежить від поняття текстових файлів базової операційної системи; вся обробка виконується самим Python, і тому вона не залежить від платформи.

source: *buffering* is an optional integer used to set the buffering policy. Pass 0 to switch buffering off (only allowed in binary mode), 1 to select line buffering (only usable in text mode), and an integer > 1 to indicate the size in bytes of a fixed-size chunk buffer. Note that specifying a buffer size this way applies for binary buffered I/O, but ``TextIOWrapper`` (i.e., files opened with ``mode='r+'``) would have another buffering. To disable buffering in ``TextIOWrapper``, consider using the ``write_through`` flag for :func:`io.TextIOWrapper.reconfigure`. When no *buffering* argument is given, the default buffering policy works as follows:
uk: *buffering* — необов’язкове ціле число, яке використовується для встановлення політики буферизації. Передайте 0, щоб вимкнути буферизацію (дозволено лише в двійковому режимі), 1, щоб вибрати буферизацію рядка (використовується лише в текстовому режимі), і ціле число > 1, щоб вказати розмір у байтах буфера фрагментів фіксованого розміру. Зауважте, що визначення розміру буфера таким чином стосується бінарного буферизації вводу-виводу, але ``TextIOWrapper`` (тобто файли, відкриті за допомогою ``mode='r+'``) матиме іншу буферизацію. Щоб вимкнути буферизацію в ``TextIOWrapper``, розгляньте можливість використання прапора ``write_through`` для :func:`io.TextIOWrapper.reconfigure`. Якщо аргумент *buffering* не вказано, політика буферизації за замовчуванням працює таким чином:

source: Binary files are buffered in fixed-size chunks; the size of the buffer is chosen using a heuristic trying to determine the underlying device's "block size" and falling back on :attr:`io.DEFAULT_BUFFER_SIZE`. On many systems, the buffer will typically be 4096 or 8192 bytes long.
uk: Бінарні файли буферизуються в блоках фіксованого розміру; розмір буфера вибирається за допомогою евристики, яка намагається визначити "розмір блоку" основного пристрою та повертається до :attr:`io.DEFAULT_BUFFER_SIZE`. У багатьох системах буфер зазвичай має довжину 4096 або 8192 байтів.

source: "Interactive" text files (files for which :meth:`~io.IOBase.isatty` returns ``True``) use line buffering. Other text files use the policy described above for binary files.
uk: "Інтерактивні" текстові файли (файли, для яких :meth:`~io.IOBase.isatty` повертає ``True``) використовують буферизацію рядка. Інші текстові файли використовують політику, описану вище для двійкових файлів.
