Repository: seanpm2001/python-docs-uk
Catalog: library/functions.po
Languages: uk

source: If the object does not provide :meth:`__dir__`, the function tries its best to gather information from the object's :attr:`~object.__dict__` attribute, if defined, and from its type object. The resulting list is not necessarily complete and may be inaccurate when the object has a custom :func:`__getattr__`.
uk: Якщо об’єкт не надає :meth:`__dir__`, функція робить усе можливе, щоб зібрати інформацію з атрибута :attr:`~object.__dict__` об’єкта, якщо він визначений, і з його об’єкта типу. Отриманий список не обов’язково є повним і може бути неточним, якщо об’єкт має настроюваний :func:`__getattr__`.

source: The default :func:`dir` mechanism behaves differently with different types of objects, as it attempts to produce the most relevant, rather than complete, information:
uk: Механізм за замовчуванням :func:`dir` поводиться по-різному з різними типами об’єктів, оскільки він намагається створити найбільш релевантну, а не повну інформацію:

source: If the object is a module object, the list contains the names of the module's attributes.
uk: Якщо об’єкт є об’єктом модуля, список містить назви атрибутів модуля.

source: If the object is a type or class object, the list contains the names of its attributes, and recursively of the attributes of its bases.
uk: Якщо об’єкт є об’єктом типу або класу, список містить імена його атрибутів і рекурсивно атрибутів його баз.

source: Otherwise, the list contains the object's attributes' names, the names of its class's attributes, and recursively of the attributes of its class's base classes.
uk: В іншому випадку список містить назви атрибутів об’єкта, назви атрибутів його класу та рекурсивно атрибутів базових класів його класу.

source: The resulting list is sorted alphabetically. For example:
uk: Отриманий список відсортовано за алфавітом. Наприклад:

source: Because :func:`dir` is supplied primarily as a convenience for use at an interactive prompt, it tries to supply an interesting set of names more than it tries to supply a rigorously or consistently defined set of names, and its detailed behavior may change across releases. For example, metaclass attributes are not in the result list when the argument is a class.
uk: Оскільки :func:`dir` надається насамперед для зручності використання в інтерактивному запиті, він намагається надати цікавий набір імен більше, ніж намагається надати чітко або послідовно визначений набір імен, і його детальна поведінка може змінитися через випуски. Наприклад, атрибути метакласу відсутні в списку результатів, якщо аргументом є клас.

source: Take two (non-complex) numbers as arguments and return a pair of numbers consisting of their quotient and remainder when using integer division. With mixed operand types, the rules for binary arithmetic operators apply. For integers, the result is the same as ``(a // b, a % b)``. For floating point numbers the result is ``(q, a % b)``, where *q* is usually ``math.floor(a / b)`` but may be 1 less than that. In any case ``q * b + a % b`` is very close to *a*, if ``a % b`` is non-zero it has the same sign as *b*, and ``0 <= abs(a % b) < abs(b)``.
uk: Візьміть два (некомплексних) числа як аргументи та поверніть пару чисел, що складаються з частки та залишку під час цілочисельного ділення. Для змішаних типів операндів застосовуються правила для двійкових арифметичних операторів. Для цілих чисел результат такий самий, як ``(a // b, a % b)``. Для чисел з плаваючою комою результатом є ``(q, a % b)``, де *q* зазвичай є ``math.floor(a / b)``, але може бути на 1 менше за це. У будь-якому випадку ``q * b + a % b`` дуже близький до *a*, якщо ``a % b`` відмінний від нуля, він має той самий знак, що і *b*, а ``0 <= abs(a % b) < abs(b)``.

source: Return an enumerate object. *iterable* must be a sequence, an :term:`iterator`, or some other object which supports iteration. The :meth:`~iterator.__next__` method of the iterator returned by :func:`enumerate` returns a tuple containing a count (from *start* which defaults to 0) and the values obtained from iterating over *iterable*.
uk: Повертає об’єкт перерахування. *iterable* має бути послідовністю, :term:`iterator` або іншим об’єктом, який підтримує ітерацію. Метод :meth:`~iterator.__next__` ітератора, який повертає :func:`enumerate`, повертає кортеж, що містить лічильник (від *start*, який за замовчуванням дорівнює 0) і значення, отримані в результаті ітерації над *iterable*.

source: Equivalent to::
uk: Дорівнює::

source: The arguments are a string and optional globals and locals. If provided, *globals* must be a dictionary. If provided, *locals* can be any mapping object.
uk: Аргументами є рядок і необов’язкові глобальні та локальні значення. Якщо вказано, *globals* має бути словником. Якщо вказано, *locals* може бути будь-яким об’єктом відображення.

source: The *expression* argument is parsed and evaluated as a Python expression (technically speaking, a condition list) using the *globals* and *locals* dictionaries as global and local namespace. If the *globals* dictionary is present and does not contain a value for the key ``__builtins__``, a reference to the dictionary of the built-in module :mod:`builtins` is inserted under that key before *expression* is parsed. That way you can control what builtins are available to the executed code by inserting your own ``__builtins__`` dictionary into *globals* before passing it to :func:`eval`. If the *locals* dictionary is omitted it defaults to the *globals* dictionary. If both dictionaries are omitted, the expression is executed with the *globals* and *locals* in the environment where :func:`eval` is called. Note, *eval()* does not have access to the :term:`nested scopes <nested scope>` (non-locals) in the enclosing environment.
uk: Аргумент *expression* аналізується та оцінюється як вираз Python (технічно кажучи, список умов) за допомогою словників *globals* і *locals* як глобального та локального простору імен. Якщо словник *globals* присутній і не містить значення для ключа ``__builtins__``, посилання на словник вбудованого модуля :mod:`builtins` вставляється під цей ключ перед *expression* розібрати. Таким чином ви можете контролювати, які вбудовані елементи доступні для виконуваного коду, вставивши свій власний словник ``__builtins__`` у *globals* перед передачею його в :func:`eval`. Якщо словник *locals* опущено, за замовчуванням буде використовуватися словник *globals*. Якщо обидва словники опущені, вираз виконується з *globals* і *locals* у середовищі, де викликається :func:`eval`. Зауважте, *eval()* не має доступу до :term:`вкладених областей <nested scope>` (нелокальних) в охоплюючому середовищі.

source: The return value is the result of the evaluated expression. Syntax errors are reported as exceptions. Example:
uk: Повернене значення є результатом обчисленого виразу. Синтаксичні помилки повідомляються як винятки. приклад:

source: This function can also be used to execute arbitrary code objects (such as those created by :func:`compile`). In this case, pass a code object instead of a string. If the code object has been compiled with ``'exec'`` as the *mode* argument, :func:`eval`\'s return value will be ``None``.
uk: Ця функція також може бути використана для виконання довільних об’єктів коду (наприклад, створених :func:`compile`). У цьому випадку передавайте об’єкт коду замість рядка. Якщо об’єкт коду було скомпільовано з ``'exec'`` як аргументом *mode*, значення, що повертається :func:`eval`\, буде ``None``.

source: Hints: dynamic execution of statements is supported by the :func:`exec` function. The :func:`globals` and :func:`locals` functions return the current global and local dictionary, respectively, which may be useful to pass around for use by :func:`eval` or :func:`exec`.
uk: Підказки: динамічне виконання операторів підтримується функцією :func:`exec`. Функції :func:`globals` і :func:`locals` повертають поточний глобальний і локальний словники відповідно, які можуть бути корисними передати для використання :func:`eval` або :func:`exec`.

source: If the given source is a string, then leading and trailing spaces and tabs are stripped.
uk: Якщо дане джерело є рядком, то пробіли та табуляції на початку та в кінці видаляються.

source: See :func:`ast.literal_eval` for a function that can safely evaluate strings with expressions containing only literals.
uk: Перегляньте :func:`ast.literal_eval` для функції, яка може безпечно обчислювати рядки з виразами, що містять лише літерали.

source: Raises an :ref:`auditing event <auditing>` ``exec`` with argument ``code_object``.
uk: Викликає :ref:`подію аудиту <auditing>` ``exec`` з аргументом ``code_object``.

source: Raises an :ref:`auditing event <auditing>` ``exec`` with the code object as the argument. Code compilation events may also be raised.
uk: Викликає :ref:`подію аудиту <auditing>` ``exec`` з об’єктом коду як аргументом. Також можуть виникати події компіляції коду.

source: This function supports dynamic execution of Python code. *object* must be either a string or a code object. If it is a string, the string is parsed as a suite of Python statements which is then executed (unless a syntax error occurs). [#]_ If it is a code object, it is simply executed. In all cases, the code that's executed is expected to be valid as file input (see the section :ref:`file-input` in the Reference Manual). Be aware that the :keyword:`nonlocal`, :keyword:`yield`, and :keyword:`return` statements may not be used outside of function definitions even within the context of code passed to the :func:`exec` function. The return value is ``None``.
uk: Ця функція підтримує динамічне виконання коду Python. *object* має бути або рядком, або об’єктом коду. Якщо це рядок, цей рядок аналізується як набір операторів Python, який потім виконується (якщо не виникає синтаксична помилка). [#]_ Якщо це об’єкт коду, він просто виконується. У всіх випадках очікується, що код, який виконується, буде дійсним як вхідний файл (див. розділ :ref:`file-input` у Довідковому посібнику). Майте на увазі, що оператори :keyword:`nonlocal`, :keyword:`yield` і :keyword:`return` не можна використовувати поза визначеннями функцій навіть у контексті коду, переданого у функцію :func:`exec` . Повернуте значення ``None``.

source: In all cases, if the optional parts are omitted, the code is executed in the current scope. If only *globals* is provided, it must be a dictionary (and not a subclass of dictionary), which will be used for both the global and the local variables. If *globals* and *locals* are given, they are used for the global and local variables, respectively. If provided, *locals* can be any mapping object. Remember that at the module level, globals and locals are the same dictionary. If exec gets two separate objects as *globals* and *locals*, the code will be executed as if it were embedded in a class definition.
uk: У всіх випадках, якщо необов’язкові частини опущені, код виконується в поточній області. Якщо вказано лише *globals*, це має бути словник (а не підклас словника), який використовуватиметься як для глобальних, так і для локальних змінних. Якщо вказано *globals* і *locals*, вони використовуються для глобальних і локальних змінних відповідно. Якщо вказано, *locals* може бути будь-яким об’єктом відображення. Пам’ятайте, що на рівні модуля глобальні та локальні є одним і тим же словником. Якщо exec отримує два окремих об’єкти як *globals* і *locals*, код буде виконано так, ніби він був вбудований у визначення класу.

source: If the *globals* dictionary does not contain a value for the key ``__builtins__``, a reference to the dictionary of the built-in module :mod:`builtins` is inserted under that key. That way you can control what builtins are available to the executed code by inserting your own ``__builtins__`` dictionary into *globals* before passing it to :func:`exec`.
uk: Якщо словник *globals* не містить значення для ключа ``__builtins__``, під цим ключем вставляється посилання на словник вбудованого модуля :mod:`builtins`. Таким чином ви можете контролювати, які вбудовані елементи доступні для виконуваного коду, вставивши свій власний словник ``__builtins__`` у *globals* перед передачею його в :func:`exec`.

source: The built-in functions :func:`globals` and :func:`locals` return the current global and local dictionary, respectively, which may be useful to pass around for use as the second and third argument to :func:`exec`.
uk: Вбудовані функції :func:`globals` і :func:`locals` повертають поточний глобальний і локальний словники відповідно, які може бути корисно передати для використання як другий і третій аргумент :func:`exec` .

source: The default *locals* act as described for function :func:`locals` below: modifications to the default *locals* dictionary should not be attempted. Pass an explicit *locals* dictionary if you need to see effects of the code on *locals* after function :func:`exec` returns.
uk: *Locals* за замовчуванням діє, як описано для функції :func:`locals` нижче: не слід намагатися змінити словник *locals* за замовчуванням. Передайте явний словник *locals*, якщо вам потрібно побачити вплив коду на *locals* після повернення функції :func:`exec`.

source: Construct an iterator from those elements of *iterable* for which *function* returns true. *iterable* may be either a sequence, a container which supports iteration, or an iterator. If *function* is ``None``, the identity function is assumed, that is, all elements of *iterable* that are false are removed.
uk: Побудуйте ітератор з тих елементів *iterable*, для яких *функція* повертає true. *iterable* може бути або послідовністю, контейнером, який підтримує ітерацію, або ітератором. Якщо *function* має значення ``None``, передбачається функція ідентифікації, тобто всі елементи *iterable*, які є false, видаляються.

source: Note that ``filter(function, iterable)`` is equivalent to the generator expression ``(item for item in iterable if function(item))`` if function is not ``None`` and ``(item for item in iterable if item)`` if function is ``None``.
uk: Зауважте, що ``filter(function, iterable)`` еквівалентний виразу генератора ``(item for item в iterable if function(item))``, якщо функція не є ``None`` і ``(item for item в iterable if item)`` якщо функція ``None``.

source: See :func:`itertools.filterfalse` for the complementary function that returns elements of *iterable* for which *function* returns false.
uk: Перегляньте :func:`itertools.filterfalse` для додаткової функції, яка повертає елементи *iterable*, для яких *функція* повертає false.

source: Return a floating point number constructed from a number or string *x*.
uk: Повертає число з плаваючою комою, створене з числа або рядка *x*.

source: If the argument is a string, it should contain a decimal number, optionally preceded by a sign, and optionally embedded in whitespace. The optional sign may be ``'+'`` or ``'-'``; a ``'+'`` sign has no effect on the value produced. The argument may also be a string representing a NaN (not-a-number), or positive or negative infinity. More precisely, the input must conform to the following grammar after leading and trailing whitespace characters are removed:
uk: Якщо аргумент є рядком, він має містити десяткове число, якому необов’язково передує знак, і необов’язково вбудоване в пробіл. Додатковим знаком може бути ``'+'`` або ``'-'``; знак ``'+'`` не впливає на отримане значення. Аргумент також може бути рядком, що представляє NaN (не число), або позитивну чи негативну нескінченність. Точніше, введення має відповідати наведеній нижче граматиці після видалення початкових і кінцевих пробілів:

source: Here ``floatnumber`` is the form of a Python floating-point literal, described in :ref:`floating`. Case is not significant, so, for example, "inf", "Inf", "INFINITY", and "iNfINity" are all acceptable spellings for positive infinity.
uk: Тут ``floatnumber`` є формою літералу з плаваючою комою Python, описаного в :ref:`floating`. Регістр не має значення, тому, наприклад, "inf", "Inf", "INFINITY" та "iNfINity" є прийнятними варіантами написання позитивної нескінченності.

source: Otherwise, if the argument is an integer or a floating point number, a floating point number with the same value (within Python's floating point precision) is returned. If the argument is outside the range of a Python float, an :exc:`OverflowError` will be raised.
uk: В іншому випадку, якщо аргумент є цілим числом або числом з плаваючою комою, повертається число з плаваючою комою з тим самим значенням (у межах точності Python до плаваючої коми). Якщо аргумент виходить за межі діапазону числа з плаваючою точкою Python, буде викликано :exc:`OverflowError`.

source: For a general Python object ``x``, ``float(x)`` delegates to ``x.__float__()``. If ``__float__()`` is not defined then it falls back to :meth:`__index__`.
uk: Для загального об’єкта Python ``x`` ``float(x)`` делегує ``x.__float__()``. Якщо ``__float__()`` не визначено, він повертається до :meth:`__index__`.

source: If no argument is given, ``0.0`` is returned.
uk: Якщо аргумент не вказано, повертається ``0.0``.

source: Examples::
uk: Приклади::

source: The float type is described in :ref:`typesnumeric`.
uk: Тип float описано в :ref:`typesnumeric`.

source: Falls back to :meth:`__index__` if :meth:`__float__` is not defined.
uk: Повертається до :meth:`__index__`, якщо :meth:`__float__` не визначено.

source: Convert a *value* to a "formatted" representation, as controlled by *format_spec*. The interpretation of *format_spec* will depend on the type of the *value* argument; however, there is a standard formatting syntax that is used by most built-in types: :ref:`formatspec`.
uk: Перетворення *значення* на "форматований" представлення, як керується *format_spec*. Інтерпретація *format_spec* залежатиме від типу аргументу *value*; проте існує стандартний синтаксис форматування, який використовується більшістю вбудованих типів: :ref:`formatspec`.

source: The default *format_spec* is an empty string which usually gives the same effect as calling :func:`str(value) <str>`.
uk: За замовчуванням *format_spec* є порожнім рядком, який зазвичай дає той самий ефект, що й виклик :func:`str(value) <str>`.

source: A call to ``format(value, format_spec)`` is translated to ``type(value).__format__(value, format_spec)`` which bypasses the instance dictionary when searching for the value's :meth:`__format__` method. A :exc:`TypeError` exception is raised if the method search reaches :mod:`object` and the *format_spec* is non-empty, or if either the *format_spec* or the return value are not strings.
uk: Виклик ``format(value, format_spec)`` перекладається на ``type(value).__format__(value, format_spec)``, який обходить словник екземпляра під час пошуку методу значення :meth:`__format__`. Виняток :exc:`TypeError` виникає, якщо метод пошуку досягає :mod:`object` і *format_spec* не є порожнім, або якщо *format_spec* або значення, що повертається, не є рядками.

source: ``object().__format__(format_spec)`` raises :exc:`TypeError` if *format_spec* is not an empty string.
uk: ``object().__format__(format_spec)`` викликає :exc:`TypeError`, якщо *format_spec* не є порожнім рядком.

source: Return a new :class:`frozenset` object, optionally with elements taken from *iterable*. ``frozenset`` is a built-in class. See :class:`frozenset` and :ref:`types-set` for documentation about this class.
uk: Повертає новий об’єкт :class:`frozenset`, необов’язково з елементами, взятими з *iterable*. ``frozenset`` є вбудованим класом. Перегляньте :class:`frozenset` і :ref:`types-set` для документації про цей клас.

source: For other containers see the built-in :class:`set`, :class:`list`, :class:`tuple`, and :class:`dict` classes, as well as the :mod:`collections` module.
uk: Для інших контейнерів перегляньте вбудовані класи :class:`set`, :class:`list`, :class:`tuple` і :class:`dict`, а також модуль :mod:`collections`.

source: Since :ref:`private name mangling <private-name-mangling>` happens at compilation time, one must manually mangle a private attribute's (attributes with two leading underscores) name in order to retrieve it with :func:`getattr`.
uk: Оскільки :ref:`викривлення приватного імені <private-name-mangling>` відбувається під час компіляції, потрібно вручну спотворити ім’я приватного атрибута (атрибути з двома символами підкреслення на початку), щоб отримати його за допомогою :func:`getattr`.

source: Return the dictionary implementing the current module namespace. For code within functions, this is set when the function is defined and remains the same regardless of where the function is called.
uk: Повертає словник, що реалізує поточний простір імен модуля. Для коду всередині функцій це значення встановлюється під час визначення функції та залишається незмінним незалежно від місця виклику функції.

source: The arguments are an object and a string. The result is ``True`` if the string is the name of one of the object's attributes, ``False`` if not. (This is implemented by calling ``getattr(object, name)`` and seeing whether it raises an :exc:`AttributeError` or not.)
uk: Аргументами є об’єкт і рядок. Результатом є ``True``, якщо рядок є назвою одного з атрибутів об’єкта, ``False``, якщо ні. (Це реалізується шляхом виклику ``getattr(object, name)`` і перевірки, чи викликає це :exc:`AttributeError` чи ні.)

source: Return the hash value of the object (if it has one). Hash values are integers. They are used to quickly compare dictionary keys during a dictionary lookup. Numeric values that compare equal have the same hash value (even if they are of different types, as is the case for 1 and 1.0).
uk: Повертає хеш-значення об’єкта (якщо воно є). Хеш-значення є цілими числами. Вони використовуються для швидкого порівняння ключів словника під час пошуку в словнику. Числові значення, які порівнюються, мають однакове хеш-значення (навіть якщо вони мають різні типи, як у випадку 1 і 1.0).

source: For objects with custom :meth:`__hash__` methods, note that :func:`hash` truncates the return value based on the bit width of the host machine. See :meth:`__hash__` for details.
uk: Для об’єктів із спеціальними методами :meth:`__hash__` зауважте, що :func:`hash` скорочує значення, що повертається, на основі розрядності хост-машини. Перегляньте :meth:`__hash__` для деталей.

source: Invoke the built-in help system. (This function is intended for interactive use.) If no argument is given, the interactive help system starts on the interpreter console. If the argument is a string, then the string is looked up as the name of a module, function, class, method, keyword, or documentation topic, and a help page is printed on the console. If the argument is any other kind of object, a help page on the object is generated.
uk: Виклик вбудованої довідкової системи. (Ця функція призначена для інтерактивного використання.) Якщо аргумент не задано, інтерактивна довідкова система запускається на консолі інтерпретатора. Якщо аргументом є рядок, то цей рядок шукається як ім’я модуля, функції, класу, методу, ключового слова чи розділу документації, а на консолі друкується довідкова сторінка. Якщо аргументом є об’єкт будь-якого іншого типу, для цього об’єкта буде створено сторінку довідки.

source: Note that if a slash(/) appears in the parameter list of a function when invoking :func:`help`, it means that the parameters prior to the slash are positional-only. For more info, see :ref:`the FAQ entry on positional-only parameters <faq-positional-only-arguments>`.
uk: Зауважте, що якщо скісна риска (/) з’являється у списку параметрів функції під час виклику :func:`help`, це означає, що параметри перед скісною рискою є лише позиційними. Для отримання додаткової інформації див. :ref:`запис у поширених питаннях щодо позиційних параметрів <faq-positional-only-arguments>`.
