Repository: seanpm2001/python-docs-uk
Catalog: library/functions.po
Languages: uk

source: This function is invoked by the :keyword:`import` statement. It can be replaced (by importing the :mod:`builtins` module and assigning to ``builtins.__import__``) in order to change semantics of the :keyword:`!import` statement, but doing so is **strongly** discouraged as it is usually simpler to use import hooks (see :pep:`302`) to attain the same goals and does not cause issues with code which assumes the default import implementation is in use. Direct use of :func:`__import__` is also discouraged in favor of :func:`importlib.import_module`.
uk: Ця функція викликається оператором :keyword:`import`. Його можна замінити (імпортувавши модуль :mod:`builtins` і призначивши ``builtins.__import__``), щоб змінити семантику оператора :keyword:`!import`, але це **настійно** не рекомендується, оскільки зазвичай простіше використовувати перехоплювачі імпорту (див. :pep:`302`) для досягнення тих самих цілей і не викликає проблем із кодом, який припускає, що використовується реалізація імпорту за замовчуванням. Пряме використання :func:`__import__` також не рекомендується на користь :func:`importlib.import_module`.

source: The function imports the module *name*, potentially using the given *globals* and *locals* to determine how to interpret the name in a package context. The *fromlist* gives the names of objects or submodules that should be imported from the module given by *name*. The standard implementation does not use its *locals* argument at all and uses its *globals* only to determine the package context of the :keyword:`import` statement.
uk: Функція імпортує *name* модуля, потенційно використовуючи задані *globals* і *locals*, щоб визначити, як інтерпретувати назву в контексті пакета. Список *fromlist* надає імена об’єктів або підмодулів, які слід імпортувати з модуля, заданого *name*. Стандартна реалізація взагалі не використовує свій аргумент *locals* і використовує його *globals* лише для визначення контексту пакета оператора :keyword:`import`.

source: *level* specifies whether to use absolute or relative imports. ``0`` (the default) means only perform absolute imports. Positive values for *level* indicate the number of parent directories to search relative to the directory of the module calling :func:`__import__` (see :pep:`328` for the details).
uk: *рівень* визначає, чи використовувати абсолютний чи відносний імпорт. ``0`` (за замовчуванням) означає виконання лише абсолютного імпорту. Позитивні значення для *level* вказують на кількість батьківських каталогів для пошуку відносно каталогу модуля, який викликає :func:`__import__` (див. :pep:`328` для деталей).

source: When the *name* variable is of the form ``package.module``, normally, the top-level package (the name up till the first dot) is returned, *not* the module named by *name*. However, when a non-empty *fromlist* argument is given, the module named by *name* is returned.
uk: Якщо змінна *name* має форму ``package.module``, зазвичай повертається пакет верхнього рівня (ім’я до першої крапки), *а не* модуль, названий *name*. Однак, якщо вказано непорожній аргумент *fromlist*, повертається модуль, названий *name*.

source: For example, the statement ``import spam`` results in bytecode resembling the following code::
uk: Наприклад, оператор ``import spam`` призводить до байт-коду, схожого на такий код:

source: The statement ``import spam.ham`` results in this call::
uk: Інструкція ``import spam.ham`` призводить до цього виклику::

source: Note how :func:`__import__` returns the toplevel module here because this is the object that is bound to a name by the :keyword:`import` statement.
uk: Зверніть увагу, як :func:`__import__` повертає тут модуль верхнього рівня, оскільки це об’єкт, який прив’язаний до імені оператором :keyword:`import`.

source: On the other hand, the statement ``from spam.ham import eggs, sausage as saus`` results in ::
uk: З іншого боку, заява ``from spam.ham import eggs, sausage as saus`` призводить до:

source: Here, the ``spam.ham`` module is returned from :func:`__import__`. From this object, the names to import are retrieved and assigned to their respective names.
uk: Тут модуль ``spam.ham`` повертається з :func:`__import__`. З цього об’єкта витягуються імена для імпорту та призначаються їх відповідні імена.

source: If you simply want to import a module (potentially within a package) by name, use :func:`importlib.import_module`.
uk: Якщо ви просто хочете імпортувати модуль (можливо, у пакеті) за назвою, використовуйте :func:`importlib.import_module`.

source: Negative values for *level* are no longer supported (which also changes the default value to 0).
uk: Від’ємні значення для *рівня* більше не підтримуються (що також змінює значення за замовчуванням на 0).

source: When the command line options :option:`-E` or :option:`-I` are being used, the environment variable :envvar:`PYTHONCASEOK` is now ignored.
uk: Коли використовуються параметри командного рядка :option:`-E` або :option:`-I`, змінна середовища :envvar:`PYTHONCASEOK` ігнорується.

source: Footnotes
uk: Примітки

source: Note that the parser only accepts the Unix-style end of line convention. If you are reading the code from a file, make sure to use newline conversion mode to convert Windows or Mac-style newlines.
uk: Зауважте, що синтаксичний аналізатор приймає символ кінця рядка лише в стилі Unix. Якщо ви читаєте код з файлу, обов’язково використовуйте режим перетворення нового рядка для перетворення символів нового рядка з Windows або Mac.
