Repository: seanpm2001/python-docs-uk
Catalog: library/functions.po
Languages: uk

source: Built-in Functions
uk: Вбудовані функції

source: The Python interpreter has a number of functions and types built into it that are always available. They are listed here in alphabetical order.
uk: Інтерпретатор Python має ряд вбудованих функцій і типів, які завжди доступні. Вони перераховані тут в алфавітному порядку.

source: **M**
uk: **М**

source: **N**
uk: **Н**

source: :func:`next`
uk: :func:`anext`

source: Return the absolute value of a number. The argument may be an integer, a floating point number, or an object implementing :meth:`__abs__`. If the argument is a complex number, its magnitude is returned.
uk: Повертає абсолютне значення числа. Аргументом може бути ціле число, число з плаваючою комою або об’єкт, що реалізує метод :meth:`__abs__`. Якщо аргумент є комплексним числом, повертається його абсолютна величина.

source: Return an :term:`asynchronous iterator` for an :term:`asynchronous iterable`. Equivalent to calling ``x.__aiter__()``.
uk: Повертає :term:`асинхронний ітератор <asynchronous iterator>` для :term:`asynchronous iterable`. Еквівалент виклику ``x.__aiter__()``.

source: Note: Unlike :func:`iter`, :func:`aiter` has no 2-argument variant.
uk: Примітка. На відміну від :func:`iter`, :func:`aiter` не має 2х-аргументного варіанту.

source: Return ``True`` if all elements of the *iterable* are true (or if the iterable is empty). Equivalent to::
uk: Повертає ``True``, якщо всі елементи *iterable* є істинними (або якщо iterable порожній). Дорівнює::

source: When awaited, return the next item from the given :term:`asynchronous iterator`, or *default* if given and the iterator is exhausted.
uk: Коли очікується, повертає наступний елемент із заданого :term:`asynchronous iterator` або *default*, якщо задано, а ітератор вичерпано.

source: This is the async variant of the :func:`next` builtin, and behaves similarly.
uk: Це асинхронний варіант вбудованої функції :func:`next`, і він поводиться аналогічно.

source: This calls the :meth:`~object.__anext__` method of *async_iterator*, returning an :term:`awaitable`. Awaiting this returns the next value of the iterator. If *default* is given, it is returned if the iterator is exhausted, otherwise :exc:`StopAsyncIteration` is raised.
uk: Це викликає метод :meth:`~object.__anext__` *async_iterator*, повертаючи :term:`awaitable`. Очікування цього повертає наступне значення ітератора. Якщо вказано *default*, воно повертається, якщо ітератор вичерпано, інакше :exc:`StopAsyncIteration` викликається.

source: Return ``True`` if any element of the *iterable* is true. If the iterable is empty, return ``False``. Equivalent to::
uk: Повертає ``True``, якщо будь-який елемент *iterable* є істинним. Якщо iterable порожній, поверніть ``False``. Дорівнює::

source: As :func:`repr`, return a string containing a printable representation of an object, but escape the non-ASCII characters in the string returned by :func:`repr` using ``\x``, ``\u``, or ``\U`` escapes. This generates a string similar to that returned by :func:`repr` in Python 2.
uk: Як :func:`repr` повертає рядок, що містить представлення об’єкта для друку, але екранує символи, відмінні від ASCII, у рядку, який повертає :func:`repr`, використовуючи ``\x``, ``\u`` або ``\U`` екранує. Це генерує рядок, подібний до того, який повертає :func:`repr` у Python 2.

source: Convert an integer number to a binary string prefixed with "0b". The result is a valid Python expression. If *x* is not a Python :class:`int` object, it has to define an :meth:`__index__` method that returns an integer. Some examples:
uk: Перетворення цілого числа на двійковий рядок із префіксом "0b". Результатом є дійсний вираз Python. Якщо *x* не є об’єктом Python :class:`int`, він має визначити метод :meth:`__index__`, який повертає ціле число. Деякі приклади:

source: If the prefix "0b" is desired or not, you can use either of the following ways.
uk: Якщо префікс "0b" потрібний чи ні, ви можете скористатися одним із наведених нижче способів.

source: See also :func:`format` for more information.
uk: Дивіться також :func:`format` для отримання додаткової інформації.

source: Return a Boolean value, i.e. one of ``True`` or ``False``. *x* is converted using the standard :ref:`truth testing procedure <truth>`. If *x* is false or omitted, this returns ``False``; otherwise, it returns ``True``. The :class:`bool` class is a subclass of :class:`int` (see :ref:`typesnumeric`). It cannot be subclassed further. Its only instances are ``False`` and ``True`` (see :ref:`bltin-boolean-values`).
uk: Повертає логічне значення, тобто одне з ``True`` або ``False``. *x* перетворюється за допомогою стандартної :ref:`процедури перевірки істинності <truth>`. Якщо *x* є false або пропущено, це повертає ``False``; інакше він повертає ``True``. Клас :class:`bool` є підкласом :class:`int` (див. :ref:`typesnumeric`). Його не можна далі класифікувати. Єдиними його екземплярами є ``False`` і ``True`` (див. :ref:`bltin-boolean-values`).

source: *x* is now a positional-only parameter.
uk: *x* тепер є лише позиційним параметром.

source: Raises an :ref:`auditing event <auditing>` ``builtins.breakpoint`` with argument ``breakpointhook``.
uk: Викликає :ref:`подію аудиту <auditing>` ``builtins.breakpoint`` з аргументом ``breakpointhook``.

source: Return a new array of bytes. The :class:`bytearray` class is a mutable sequence of integers in the range 0 <= x < 256. It has most of the usual methods of mutable sequences, described in :ref:`typesseq-mutable`, as well as most methods that the :class:`bytes` type has, see :ref:`bytes-methods`.
uk: Повертає новий масив байтів. Клас :class:`bytearray` — це змінна послідовність цілих чисел у діапазоні 0 <= x < 256. Він містить більшість звичайних методів змінних послідовностей, описаних у :ref:`typesseq-mutable`, а також більшість методи, які має тип :class:`bytes`, див. :ref:`bytes-methods`.

source: The optional *source* parameter can be used to initialize the array in a few different ways:
uk: Додатковий параметр *source* можна використовувати для ініціалізації масиву кількома різними способами:

source: If it is a *string*, you must also give the *encoding* (and optionally, *errors*) parameters; :func:`bytearray` then converts the string to bytes using :meth:`str.encode`.
uk: Якщо це *рядок*, ви також повинні надати параметри *encoding* (і, необов’язково, *errors*); Потім :func:`bytearray` перетворює рядок на байти за допомогою :meth:`str.encode`.

source: If it is an *integer*, the array will have that size and will be initialized with null bytes.
uk: Якщо це *ціле число*, масив матиме такий розмір і буде ініціалізовано нульовими байтами.

source: If it is an object conforming to the :ref:`buffer interface <bufferobjects>`, a read-only buffer of the object will be used to initialize the bytes array.
uk: Якщо це об’єкт, що відповідає :ref:`інтерфейсу буфера <bufferobjects>`, для ініціалізації масиву байтів буде використано буфер лише для читання об’єкта.

source: If it is an *iterable*, it must be an iterable of integers in the range ``0 <= x < 256``, which are used as the initial contents of the array.
uk: Якщо це *iterable*, це має бути iterable цілих чисел у діапазоні ``0 <= x < 256``, які використовуються як початковий вміст масиву.

source: Without an argument, an array of size 0 is created.
uk: Без аргументу створюється масив розміром 0.

source: See also :ref:`binaryseq` and :ref:`typebytearray`.
uk: Дивіться також :ref:`binaryseq` і :ref:`typebytearray`.

source: Return a new "bytes" object which is an immutable sequence of integers in the range ``0 <= x < 256``. :class:`bytes` is an immutable version of :class:`bytearray` -- it has the same non-mutating methods and the same indexing and slicing behavior.
uk: Повертає новий об’єкт "bytes", який є незмінною послідовністю цілих чисел у діапазоні "0 <= x < 256". :class:`bytes` є незмінною версією :class:`bytearray` -- вона має ті самі методи без мутації та таку саму поведінку індексування та зрізання.

source: Accordingly, constructor arguments are interpreted as for :func:`bytearray`.
uk: Відповідно, аргументи конструктора інтерпретуються як для :func:`bytearray`.

source: Bytes objects can also be created with literals, see :ref:`strings`.
uk: Об’єкти Bytes також можна створювати за допомогою літералів, див. :ref:`strings`.

source: See also :ref:`binaryseq`, :ref:`typebytes`, and :ref:`bytes-methods`.
uk: Дивіться також :ref:`binaryseq`, :ref:`typebytes` і :ref:`bytes-methods`.

source: Return :const:`True` if the *object* argument appears callable, :const:`False` if not. If this returns ``True``, it is still possible that a call fails, but if it is ``False``, calling *object* will never succeed. Note that classes are callable (calling a class returns a new instance); instances are callable if their class has a :meth:`__call__` method.
uk: Повертає :const:`True`, якщо аргумент *object* здається викликаним, :const:`False`, якщо ні. Якщо це повертає ``True``, все ще можливо, що виклик не вдасться, але якщо це ``False``, виклик *object* ніколи не вдасться. Зауважте, що класи можна викликати (виклик класу повертає новий екземпляр); екземпляри можна викликати, якщо їхній клас має метод :meth:`__call__`.

source: This function was first removed in Python 3.0 and then brought back in Python 3.2.
uk: Цю функцію спочатку було видалено в Python 3.0, а потім повернуто в Python 3.2.

source: Return the string representing a character whose Unicode code point is the integer *i*. For example, ``chr(97)`` returns the string ``'a'``, while ``chr(8364)`` returns the string ``'€'``. This is the inverse of :func:`ord`.
uk: Повертає рядок, що представляє символ, кодовою точкою Unicode якого є ціле число *i*. Наприклад, ``chr(97)`` повертає рядок ``'a''``, а ``chr(8364)`` повертає рядок ``'€'``. Це зворотне до :func:`ord`.

source: The valid range for the argument is from 0 through 1,114,111 (0x10FFFF in base 16). :exc:`ValueError` will be raised if *i* is outside that range.
uk: Допустимий діапазон для аргументу – від 0 до 1 114 111 (0x10FFFF за основою 16). :exc:`ValueError` буде викликано, якщо *i* знаходиться за межами цього діапазону.

source: Transform a method into a class method.
uk: Перетворення методу в метод класу.

source: A class method receives the class as an implicit first argument, just like an instance method receives the instance. To declare a class method, use this idiom::
uk: Метод класу отримує клас як неявний перший аргумент, так само як метод екземпляра отримує екземпляр. Щоб оголосити метод класу, використовуйте цю ідіому::

source: The ``@classmethod`` form is a function :term:`decorator` -- see :ref:`function` for details.
uk: Форма ``@classmethod`` є функцією :term:`decorator` -- подробиці див. :ref:`function`.

source: A class method can be called either on the class (such as ``C.f()``) or on an instance (such as ``C().f()``). The instance is ignored except for its class. If a class method is called for a derived class, the derived class object is passed as the implied first argument.
uk: Метод класу можна викликати або в класі (наприклад, ``C.f()``), або в екземплярі (такому як ``C().f()``). Примірник ігнорується, за винятком його класу. Якщо метод класу викликається для похідного класу, об’єкт похідного класу передається як неявний перший аргумент.

source: Class methods are different than C++ or Java static methods. If you want those, see :func:`staticmethod` in this section. For more information on class methods, see :ref:`types`.
uk: Методи класу відрізняються від статичних методів C++ або Java. Якщо ви хочете їх, перегляньте :func:`staticmethod` у цьому розділі. Для отримання додаткової інформації про методи класу див. :ref:`types`.

source: Class methods can now wrap other :term:`descriptors <descriptor>` such as :func:`property`.
uk: Методи класу тепер можуть обгортати інші :term:`дескриптори <descriptor>`, такі як :func:`property`.

source: Class methods now inherit the method attributes (``__module__``, ``__name__``, ``__qualname__``, ``__doc__`` and ``__annotations__``) and have a new ``__wrapped__`` attribute.
uk: Методи класу тепер успадковують атрибути методу (``__module__``, ``__name__``, ``__qualname__``, ``__doc__`` і ``__annotations__``) і мають новий атрибут ``__wrapped__``.

source: Compile the *source* into a code or AST object. Code objects can be executed by :func:`exec` or :func:`eval`. *source* can either be a normal string, a byte string, or an AST object. Refer to the :mod:`ast` module documentation for information on how to work with AST objects.
uk: Скомпілюйте *джерело* в код або об’єкт AST. Об’єкти коду можуть бути виконані за допомогою :func:`exec` або :func:`eval`. *джерело* може бути звичайним рядком, рядком байтів або об’єктом AST. Зверніться до документації модуля :mod:`ast`, щоб дізнатися, як працювати з об’єктами AST.

source: The *filename* argument should give the file from which the code was read; pass some recognizable value if it wasn't read from a file (``'<string>'`` is commonly used).
uk: Аргумент *ім'я_файлу* повинен давати файл, з якого було прочитано код; передати певне розпізнаване значення, якщо воно не було прочитано з файлу (зазвичай використовується ``' <string>'``).

source: The *mode* argument specifies what kind of code must be compiled; it can be ``'exec'`` if *source* consists of a sequence of statements, ``'eval'`` if it consists of a single expression, or ``'single'`` if it consists of a single interactive statement (in the latter case, expression statements that evaluate to something other than ``None`` will be printed).
uk: Аргумент *mode* визначає тип коду, який потрібно скомпілювати; це може бути ``'exec'``, якщо *source* складається з послідовності операторів, ``'eval'``, якщо воно складається з одного виразу, або ``'single'``, якщо воно складається з одного інтерактивний оператор (в останньому випадку оператори-вирази, які мають значення, відмінне від ``None``, будуть надруковані).

source: The optional arguments *flags* and *dont_inherit* control which :ref:`compiler options <ast-compiler-flags>` should be activated and which :ref:`future features <future>` should be allowed. If neither is present (or both are zero) the code is compiled with the same flags that affect the code that is calling :func:`compile`. If the *flags* argument is given and *dont_inherit* is not (or is zero) then the compiler options and the future statements specified by the *flags* argument are used in addition to those that would be used anyway. If *dont_inherit* is a non-zero integer then the *flags* argument is it -- the flags (future features and compiler options) in the surrounding code are ignored.
uk: Необов’язкові аргументи *flags* і *dont_inherit* визначають, які :ref:`параметри компілятора <ast-compiler-flags>` мають бути активовані та які :ref:`майбутні функції <future>` мають бути дозволені. Якщо жоден не присутній (або обидва дорівнюють нулю), код компілюється з тими самими прапорцями, які впливають на код, який викликає :func:`compile`. Якщо надано аргумент *flags*, а *dont_inherit* — ні (або дорівнює нулю), то параметри компілятора та майбутні оператори, визначені аргументом *flags*, використовуються на додаток до тих, які були б використані в будь-якому випадку. Якщо *dont_inherit* є ненульовим цілим числом, то це аргумент *flags* — прапори (майбутні функції та параметри компілятора) у навколишньому коді ігноруються.

source: Compiler options and future statements are specified by bits which can be bitwise ORed together to specify multiple options. The bitfield required to specify a given future feature can be found as the :attr:`~__future__._Feature.compiler_flag` attribute on the :class:`~__future__._Feature` instance in the :mod:`__future__` module. :ref:`Compiler flags <ast-compiler-flags>` can be found in :mod:`ast` module, with ``PyCF_`` prefix.
uk: Параметри компілятора та майбутні оператори визначаються бітами, які можна об’єднати порозрядним АБО, щоб визначити кілька параметрів. Бітове поле, необхідне для вказівки певної майбутньої функції, можна знайти як атрибут :attr:`~__future__._Feature.compiler_flag` екземпляра :class:`~__future__._Feature` у модулі :mod:`__future__`. :ref:`Прапори компілятора <ast-compiler-flags>` можна знайти в :mod:`ast` модулі з префіксом ``PyCF_``.

source: The argument *optimize* specifies the optimization level of the compiler; the default value of ``-1`` selects the optimization level of the interpreter as given by :option:`-O` options. Explicit levels are ``0`` (no optimization; ``__debug__`` is true), ``1`` (asserts are removed, ``__debug__`` is false) or ``2`` (docstrings are removed too).
uk: Аргумент *optimize* визначає рівень оптимізації компілятора; значення за замовчуванням ``-1`` вибирає рівень оптимізації інтерпретатора, як задано параметрами :option:`-O`. Явні рівні: ``0`` (немає оптимізації; ``__debug__`` є істинним), ``1`` (затвердження видалено, ``__debug__`` є хибним) або ``2`` (рядки документа також видалено ).

source: This function raises :exc:`SyntaxError` if the compiled source is invalid, and :exc:`ValueError` if the source contains null bytes.
uk: Ця функція викликає :exc:`SyntaxError`, якщо скомпільоване джерело недійсне, і :exc:`ValueError`, якщо джерело містить нульові байти.

source: If you want to parse Python code into its AST representation, see :func:`ast.parse`.
uk: Якщо ви хочете розібрати код Python у його представлення AST, перегляньте :func:`ast.parse`.

source: Raises an :ref:`auditing event <auditing>` ``compile`` with arguments ``source``, ``filename``.
uk: Викликає :ref:`подію аудиту <auditing>` ``компіляція`` з аргументами ``джерело``, ``назва файлу``.

source: Raises an :ref:`auditing event <auditing>` ``compile`` with arguments ``source`` and ``filename``. This event may also be raised by implicit compilation.
uk: Викликає :ref:`подію аудиту <auditing>` ``компіляція`` з аргументами ``джерело`` та ``назва файлу``. Ця подія також може бути викликана неявною компіляцією.

source: When compiling a string with multi-line code in ``'single'`` or ``'eval'`` mode, input must be terminated by at least one newline character. This is to facilitate detection of incomplete and complete statements in the :mod:`code` module.
uk: Під час компіляції рядка з багаторядковим кодом у режимі ``'single'`` або ``'eval'`` вхідні дані мають завершуватися принаймні одним символом нового рядка. Це робиться для полегшення виявлення неповних і повних операторів у модулі :mod:`code`.

source: It is possible to crash the Python interpreter with a sufficiently large/complex string when compiling to an AST object due to stack depth limitations in Python's AST compiler.
uk: Можливий збій інтерпретатора Python із досить великим/складним рядком під час компіляції в об’єкт AST через обмеження глибини стеку в компіляторі AST Python.

source: Allowed use of Windows and Mac newlines. Also, input in ``'exec'`` mode does not have to end in a newline anymore. Added the *optimize* parameter.
uk: Дозволено використання нових рядків у Windows і Mac. Крім того, введення в режимі ``'exec''`` більше не повинно закінчуватися символом нового рядка. Додано параметр *optimize*.

source: Previously, :exc:`TypeError` was raised when null bytes were encountered in *source*.
uk: Раніше :exc:`TypeError` виникало, коли в *source* зустрічалися нульові байти.

source: ``ast.PyCF_ALLOW_TOP_LEVEL_AWAIT`` can now be passed in flags to enable support for top-level ``await``, ``async for``, and ``async with``.
uk: ``ast.PyCF_ALLOW_TOP_LEVEL_AWAIT`` тепер можна передавати у прапорах, щоб увімкнути підтримку верхнього рівня ``await``, ``async for`` і ``async with``.

source: Return a complex number with the value *real* + *imag*\*1j or convert a string or number to a complex number. If the first parameter is a string, it will be interpreted as a complex number and the function must be called without a second parameter. The second parameter can never be a string. Each argument may be any numeric type (including complex). If *imag* is omitted, it defaults to zero and the constructor serves as a numeric conversion like :class:`int` and :class:`float`. If both arguments are omitted, returns ``0j``.
uk: Повертає комплексне число зі значенням *real* + *imag*\*1j або перетворює рядок або число на комплексне число. Якщо перший параметр є рядком, він буде інтерпретуватися як комплексне число, і функція має бути викликана без другого параметра. Другий параметр ніколи не може бути рядком. Кожен аргумент може бути будь-якого числового типу (включаючи комплексний). Якщо *imag* опущено, за замовчуванням він дорівнює нулю, а конструктор служить для числового перетворення, наприклад :class:`int` і :class:`float`. Якщо обидва аргументи опущено, повертає ``0j``.

source: For a general Python object ``x``, ``complex(x)`` delegates to ``x.__complex__()``. If ``__complex__()`` is not defined then it falls back to :meth:`__float__`. If ``__float__()`` is not defined then it falls back to :meth:`__index__`.
uk: Для загального об’єкта Python ``x`` ``complex(x)`` делегує ``x.__complex__()``. Якщо ``__complex__()`` не визначено, тоді він повертається до :meth:`__float__`. Якщо ``__float__()`` не визначено, він повертається до :meth:`__index__`.

source: When converting from a string, the string must not contain whitespace around the central ``+`` or ``-`` operator. For example, ``complex('1+2j')`` is fine, but ``complex('1 + 2j')`` raises :exc:`ValueError`.
uk: Під час перетворення з рядка рядок не повинен містити пробіли навколо центрального оператора ``+`` або ``-``. Наприклад, ``complex('1+2j')`` добре, але ``complex('1 + 2j')`` викликає :exc:`ValueError`.

source: The complex type is described in :ref:`typesnumeric`.
uk: Складний тип описано в :ref:`typesnumeric`.

source: Grouping digits with underscores as in code literals is allowed.
uk: Допускається групування цифр із підкресленням, як у кодових літералах.

source: Falls back to :meth:`__index__` if :meth:`__complex__` and :meth:`__float__` are not defined.
uk: Повертається до :meth:`__index__`, якщо :meth:`__complex__` і :meth:`__float__` не визначено.

source: Create a new dictionary. The :class:`dict` object is the dictionary class. See :class:`dict` and :ref:`typesmapping` for documentation about this class.
uk: Створіть новий словник. Об’єкт :class:`dict` є класом словника. Перегляньте :class:`dict` і :ref:`typesmapping` для документації про цей клас.

source: For other containers see the built-in :class:`list`, :class:`set`, and :class:`tuple` classes, as well as the :mod:`collections` module.
uk: Для інших контейнерів перегляньте вбудовані класи :class:`list`, :class:`set` і :class:`tuple`, а також модуль :mod:`collections`.

source: Without arguments, return the list of names in the current local scope. With an argument, attempt to return a list of valid attributes for that object.
uk: Без аргументів повертає список імен у поточній локальній області. За допомогою аргументу спробуйте повернути список дійсних атрибутів для цього об’єкта.

source: If the object has a method named :meth:`__dir__`, this method will be called and must return the list of attributes. This allows objects that implement a custom :func:`__getattr__` or :func:`__getattribute__` function to customize the way :func:`dir` reports their attributes.
uk: Якщо об’єкт має метод з назвою :meth:`__dir__`, цей метод буде викликаний і повинен повернути список атрибутів. Це дозволяє об’єктам, які реалізують спеціальну функцію :func:`__getattr__` або :func:`__getattribute__`, налаштувати спосіб, у який :func:`dir` повідомляє свої атрибути.
