Repository: seanpm2001/python-docs-uk
Catalog: library/functions.po
Languages: uk

source: Return a :term:`slice` object representing the set of indices specified by ``range(start, stop, step)``. The *start* and *step* arguments default to ``None``. Slice objects have read-only data attributes :attr:`~slice.start`, :attr:`~slice.stop`, and :attr:`~slice.step` which merely return the argument values (or their default). They have no other explicit functionality; however, they are used by NumPy and other third-party packages. Slice objects are also generated when extended indexing syntax is used. For example: ``a[start:stop:step]`` or ``a[start:stop, i]``. See :func:`itertools.islice` for an alternate version that returns an iterator.
uk: Повертає об’єкт :term:`slice`, що представляє набір індексів, визначених ``діапазоном (початок, зупинка, крок)``. Аргументи *start* і *step* за умовчанням мають значення ``None``. Об’єкти фрагментів мають атрибути даних лише для читання :attr:`~slice.start`, :attr:`~slice.stop` і :attr:`~slice.step`, які просто повертають значення аргументів (або їхнє значення за замовчуванням). Вони не мають інших явних функцій; однак вони використовуються NumPy та іншими пакетами сторонніх виробників. Об’єкти фрагментів також генеруються, коли використовується розширений синтаксис індексування. Наприклад: ``a[start:stop:step]`` або ``a[start:stop, i]``. Перегляньте :func:`itertools.islice` альтернативну версію, яка повертає ітератор.

source: Return a new sorted list from the items in *iterable*.
uk: Повертає новий відсортований список з елементів у *iterable*.

source: Has two optional arguments which must be specified as keyword arguments.
uk: Має два необов’язкові аргументи, які необхідно вказати як аргументи ключового слова.

source: *key* specifies a function of one argument that is used to extract a comparison key from each element in *iterable* (for example, ``key=str.lower``). The default value is ``None`` (compare the elements directly).
uk: *key* визначає функцію одного аргументу, яка використовується для отримання ключа порівняння з кожного елемента в *iterable* (наприклад, ``key=str.lower``). Значення за замовчуванням – ``None`` (пряме порівняння елементів).

source: *reverse* is a boolean value. If set to ``True``, then the list elements are sorted as if each comparison were reversed.
uk: *reverse* — це логічне значення. Якщо встановлено значення ``True``, елементи списку сортуються так, ніби кожне порівняння було зворотним.

source: Use :func:`functools.cmp_to_key` to convert an old-style *cmp* function to a *key* function.
uk: Використовуйте :func:`functools.cmp_to_key`, щоб перетворити функцію *cmp* старого стилю на функцію *key*.

source: The built-in :func:`sorted` function is guaranteed to be stable. A sort is stable if it guarantees not to change the relative order of elements that compare equal --- this is helpful for sorting in multiple passes (for example, sort by department, then by salary grade).
uk: Вбудована функція :func:`sorted` гарантовано буде стабільною. Сортування є стабільним, якщо воно гарантує відсутність зміни відносного порядку порівнюваних рівних елементів --- це корисно для сортування за кілька проходів (наприклад, сортування за відділом, а потім за ступенем заробітної плати).

source: The sort algorithm uses only ``<`` comparisons between items. While defining an :meth:`~object.__lt__` method will suffice for sorting, :PEP:`8` recommends that all six :ref:`rich comparisons <comparisons>` be implemented. This will help avoid bugs when using the same data with other ordering tools such as :func:`max` that rely on a different underlying method. Implementing all six comparisons also helps avoid confusion for mixed type comparisons which can call reflected the :meth:`~object.__gt__` method.
uk: Алгоритм сортування використовує лише ``<`` comparisons between items. While defining an :meth:`~object.__lt__` method will suffice for sorting, :PEP:`8` recommends that all six :ref:`rich comparisons <comparisons>`. Це допоможе уникнути помилок під час використання тих самих даних з іншими інструментами впорядкування, такими як :func:`max`, які покладаються на інший базовий метод. Реалізація всіх шести порівнянь також допомагає уникнути плутанини для порівнянь змішаного типу, які можуть викликати відображений метод :meth:`~object.__gt__`.

source: For sorting examples and a brief sorting tutorial, see :ref:`sortinghowto`.
uk: Приклади сортування та короткий посібник із сортування див. :ref:`sortinghowto`.

source: Transform a method into a static method.
uk: Перетворення методу в статичний метод.

source: A static method does not receive an implicit first argument. To declare a static method, use this idiom::
uk: Статичний метод не отримує неявний перший аргумент. Щоб оголосити статичний метод, використовуйте цю ідіому::

source: The ``@staticmethod`` form is a function :term:`decorator` -- see :ref:`function` for details.
uk: Форма ``@staticmethod`` є функцією :term:`decorator` -- подробиці див. :ref:`function`.

source: A static method can be called either on the class (such as ``C.f()``) or on an instance (such as ``C().f()``). Moreover, they can be called as regular functions (such as ``f()``).
uk: Статичний метод можна викликати або в класі (наприклад, ``C.f()``), або в екземплярі (такому як ``C().f()``). Крім того, їх можна викликати як звичайні функції (наприклад, ``f()``).

source: Static methods in Python are similar to those found in Java or C++. Also, see :func:`classmethod` for a variant that is useful for creating alternate class constructors.
uk: Статичні методи в Python подібні до методів Java або C++. Також перегляньте :func:`classmethod` варіант, який корисний для створення альтернативних конструкторів класів.

source: Like all decorators, it is also possible to call ``staticmethod`` as a regular function and do something with its result. This is needed in some cases where you need a reference to a function from a class body and you want to avoid the automatic transformation to instance method. For these cases, use this idiom::
uk: Як і в усіх декораторах, також можна викликати ``staticmethod`` як звичайну функцію та щось робити з його результатом. Це необхідно в деяких випадках, коли вам потрібно посилання на функцію з тіла класу, і ви хочете уникнути автоматичного перетворення в метод екземпляра. Для цих випадків використовуйте цю ідіому::

source: For more information on static methods, see :ref:`types`.
uk: Для отримання додаткової інформації про статичні методи див. :ref:`types`.

source: Static methods now inherit the method attributes (``__module__``, ``__name__``, ``__qualname__``, ``__doc__`` and ``__annotations__``), have a new ``__wrapped__`` attribute, and are now callable as regular functions.
uk: Статичні методи тепер успадковують атрибути методу (``__module__``, ``__name__``, ``__qualname__``, ``__doc__`` і ``__annotations__``), мають новий атрибут ``__wrapped__`` і тепер викликаються як звичайні функції.

source: Return a :class:`str` version of *object*. See :func:`str` for details.
uk: Повертає :class:`str` версію *object*. Дивіться :func:`str` для деталей.

source: ``str`` is the built-in string :term:`class`. For general information about strings, see :ref:`textseq`.
uk: ``str`` — це вбудований рядок :term:`class`. Щоб отримати загальну інформацію про рядки, перегляньте :ref:`textseq`.

source: Sums *start* and the items of an *iterable* from left to right and returns the total. The *iterable*'s items are normally numbers, and the start value is not allowed to be a string.
uk: Сумує *start* і елементи *iterable* зліва направо та повертає підсумок. Елементи *iterable* зазвичай є числами, а початкове значення не може бути рядком.

source: For some use cases, there are good alternatives to :func:`sum`. The preferred, fast way to concatenate a sequence of strings is by calling ``''.join(sequence)``. To add floating point values with extended precision, see :func:`math.fsum`\. To concatenate a series of iterables, consider using :func:`itertools.chain`.
uk: Для деяких випадків використання є хороші альтернативи :func:`sum`. Кращим швидким способом об’єднання послідовності рядків є виклик ``''.join(sequence)``. Щоб додати значення з плаваючою комою з розширеною точністю, перегляньте :func:`math.fsum`\. Щоб об’єднати ряд ітерацій, розгляньте можливість використання :func:`itertools.chain`.

source: The *start* parameter can be specified as a keyword argument.
uk: Параметр *start* можна вказати як аргумент ключового слова.

source: Return a proxy object that delegates method calls to a parent or sibling class of *type*. This is useful for accessing inherited methods that have been overridden in a class.
uk: Повертає проксі-об’єкт, який делегує виклики методу батьківському або рідному класу *типу*. Це корисно для доступу до успадкованих методів, які були перевизначені в класі.

source: If the second argument is omitted, the super object returned is unbound. If the second argument is an object, ``isinstance(obj, type)`` must be true. If the second argument is a type, ``issubclass(type2, type)`` must be true (this is useful for classmethods).
uk: Якщо другий аргумент опущено, повернутий супероб’єкт не зв’язаний. Якщо другий аргумент є об’єктом, ``isinstance(obj, type)`` має бути істинним. Якщо другий аргумент є типом, ``issubclass(type2, type)`` має бути істинним (це корисно для методів класу).

source: There are two typical use cases for *super*. In a class hierarchy with single inheritance, *super* can be used to refer to parent classes without naming them explicitly, thus making the code more maintainable. This use closely parallels the use of *super* in other programming languages.
uk: Є два типових випадки використання *super*. В ієрархії класів з єдиним успадкуванням *super* можна використовувати для посилання на батьківські класи, не вказуючи їх явно, що робить код більш придатним для обслуговування. Це використання дуже схоже на використання *super* в інших мовах програмування.

source: The second use case is to support cooperative multiple inheritance in a dynamic execution environment. This use case is unique to Python and is not found in statically compiled languages or languages that only support single inheritance. This makes it possible to implement "diamond diagrams" where multiple base classes implement the same method. Good design dictates that such implementations have the same calling signature in every case (because the order of calls is determined at runtime, because that order adapts to changes in the class hierarchy, and because that order can include sibling classes that are unknown prior to runtime).
uk: Другий варіант використання — це підтримка кооперативного множинного успадкування в динамічному середовищі виконання. Цей варіант використання унікальний для Python і не зустрічається в статично скомпільованих мовах або мовах, які підтримують лише одне успадкування. Це дає змогу реалізувати "діамантові діаграми", де кілька базових класів реалізують один і той же метод. Хороший дизайн вимагає, щоб такі реалізації мали однакову сигнатуру виклику в кожному випадку (оскільки порядок викликів визначається під час виконання, оскільки цей порядок адаптується до змін в ієрархії класів, і оскільки цей порядок може включати однотипні класи, які невідомі до виконання ).

source: For both use cases, a typical superclass call looks like this::
uk: Для обох випадків типовий виклик суперкласу виглядає так:

source: In addition to method lookups, :func:`super` also works for attribute lookups. One possible use case for this is calling :term:`descriptors <descriptor>` in a parent or sibling class.
uk: Окрім пошуку методів, :func:`super` також працює для пошуку атрибутів. Одним із можливих варіантів використання цього є виклик :term:`дескрипторів <descriptor>` у батьківському або рідному класі.

source: Note that :func:`super` is implemented as part of the binding process for explicit dotted attribute lookups such as ``super().__getitem__(name)``. It does so by implementing its own :meth:`__getattribute__` method for searching classes in a predictable order that supports cooperative multiple inheritance. Accordingly, :func:`super` is undefined for implicit lookups using statements or operators such as ``super()[name]``.
uk: Зауважте, що :func:`super` реалізовано як частину процесу зв’язування для явного пошуку атрибутів із пунктирною точкою, наприклад ``super().__getitem__(name)``. Це робиться шляхом реалізації власного методу :meth:`__getattribute__` для пошуку класів у передбачуваному порядку, який підтримує кооперативне множинне успадкування. Відповідно, :func:`super` не визначено для неявних пошуків за допомогою операторів або операторів, таких як ``super()[name]``.

source: Also note that, aside from the zero argument form, :func:`super` is not limited to use inside methods. The two argument form specifies the arguments exactly and makes the appropriate references. The zero argument form only works inside a class definition, as the compiler fills in the necessary details to correctly retrieve the class being defined, as well as accessing the current instance for ordinary methods.
uk: Також зауважте, що, окрім форми нульового аргументу, :func:`super` не обмежується використанням внутрішніх методів. Форма з двома аргументами точно визначає аргументи та робить відповідні посилання. Форма нульового аргументу працює лише всередині визначення класу, оскільки компілятор заповнює необхідні деталі для правильного отримання визначеного класу, а також для доступу до поточного екземпляра для звичайних методів.

source: For practical suggestions on how to design cooperative classes using :func:`super`, see `guide to using super() <https://rhettinger.wordpress.com/2011/05/26/super-considered-super/>`_.
uk: Щоб отримати практичні поради щодо створення кооперативних класів за допомогою :func:`super`, перегляньте `посібник із використання super() <https://rhettinger.wordpress.com/2011/05/26/super-considered-super/>`_.

source: Rather than being a function, :class:`tuple` is actually an immutable sequence type, as documented in :ref:`typesseq-tuple` and :ref:`typesseq`.
uk: Замість того, щоб бути функцією, :class:`tuple` насправді є незмінним типом послідовності, як описано в :ref:`typesseq-tuple` і :ref:`typesseq`.

source: With one argument, return the type of an *object*. The return value is a type object and generally the same object as returned by :attr:`object.__class__ <instance.__class__>`.
uk: З одним аргументом повертає тип *об’єкта*. Значення, що повертається, є об’єктом типу та, як правило, таким самим об’єктом, який повертає :attr:`object.__class__ <instance.__class__>`.

source: The :func:`isinstance` built-in function is recommended for testing the type of an object, because it takes subclasses into account.
uk: Для перевірки типу об’єкта рекомендується використовувати вбудовану функцію :func:`isinstance`, оскільки вона враховує підкласи.

source: With three arguments, return a new type object. This is essentially a dynamic form of the :keyword:`class` statement. The *name* string is the class name and becomes the :attr:`~definition.__name__` attribute. The *bases* tuple contains the base classes and becomes the :attr:`~class.__bases__` attribute; if empty, :class:`object`, the ultimate base of all classes, is added. The *dict* dictionary contains attribute and method definitions for the class body; it may be copied or wrapped before becoming the :attr:`~object.__dict__` attribute. The following two statements create identical :class:`type` objects:
uk: З трьома аргументами повертає об’єкт нового типу. По суті, це динамічна форма оператора :keyword:`class`. Рядок *name* є назвою класу і стає атрибутом :attr:`~definition.__name__`. Кортеж *bases* містить базові класи та стає атрибутом :attr:`~class.__bases__`; якщо порожній, додається :class:`object`, кінцева база всіх класів. Словник *dict* містить визначення атрибутів і методів для тіла класу; його можна скопіювати або обернути перед тим, як стати атрибутом :attr:`~object.__dict__`. Наступні два оператори створюють ідентичні об’єкти :class:`type`:

source: See also :ref:`bltin-type-objects`.
uk: Дивіться також :ref:`bltin-type-objects`.

source: Keyword arguments provided to the three argument form are passed to the appropriate metaclass machinery (usually :meth:`~object.__init_subclass__`) in the same way that keywords in a class definition (besides *metaclass*) would.
uk: Аргументи ключових слів, надані у формі з трьома аргументами, передаються у відповідний механізм метакласу (зазвичай :meth:`~object.__init_subclass__`) так само, як ключові слова у визначенні класу (крім *metaclass*).

source: See also :ref:`class-customization`.
uk: Дивіться також :ref:`class-customization`.

source: Subclasses of :class:`type` which don't override ``type.__new__`` may no longer use the one-argument form to get the type of an object.
uk: Підкласи :class:`type`, які не перевизначають ``type.__new__``, більше не можуть використовувати форму з одним аргументом для отримання типу об’єкта.

source: Return the :attr:`~object.__dict__` attribute for a module, class, instance, or any other object with a :attr:`~object.__dict__` attribute.
uk: Повертає атрибут :attr:`~object.__dict__` для модуля, класу, екземпляра або будь-якого іншого об’єкта з атрибутом :attr:`~object.__dict__`.

source: Objects such as modules and instances have an updateable :attr:`~object.__dict__` attribute; however, other objects may have write restrictions on their :attr:`~object.__dict__` attributes (for example, classes use a :class:`types.MappingProxyType` to prevent direct dictionary updates).
uk: Такі об’єкти, як модулі та екземпляри, мають оновлюваний атрибут :attr:`~object.__dict__`; однак інші об’єкти можуть мати обмеження на запис своїх атрибутів :attr:`~object.__dict__` (наприклад, класи використовують :class:`types.MappingProxyType`, щоб запобігти прямим оновленням словника).

source: Without an argument, :func:`vars` acts like :func:`locals`. Note, the locals dictionary is only useful for reads since updates to the locals dictionary are ignored.
uk: Без аргументу :func:`vars` діє як :func:`locals`. Зауважте, що словник місцевих користувачів корисний лише для читання, оскільки оновлення словника локальних користувачів ігноруються.

source: A :exc:`TypeError` exception is raised if an object is specified but it doesn't have a :attr:`~object.__dict__` attribute (for example, if its class defines the :attr:`~object.__slots__` attribute).
uk: Виняток :exc:`TypeError` виникає, якщо об’єкт указано, але він не має атрибута :attr:`~object.__dict__` (наприклад, якщо його клас визначає :attr:`~object.__slots__` атрибут).

source: Iterate over several iterables in parallel, producing tuples with an item from each one.
uk: Виконайте ітерацію кількох ітерацій паралельно, створюючи кортежі з елементом з кожного.

source: Example::
uk: Приклад::

source: More formally: :func:`zip` returns an iterator of tuples, where the *i*-th tuple contains the *i*-th element from each of the argument iterables.
uk: Більш формально: :func:`zip` повертає ітератор кортежів, де *i*-й кортеж містить *i*-й елемент з кожного з ітерованих аргументів.

source: Another way to think of :func:`zip` is that it turns rows into columns, and columns into rows. This is similar to `transposing a matrix <https://en.wikipedia.org/wiki/Transpose>`_.
uk: Інший спосіб уявлення про :func:`zip` полягає в тому, що він перетворює рядки на стовпці, а стовпці — на рядки. Це схоже на `транспонування матриці <https://en.wikipedia.org/wiki/Transpose>`_.

source: :func:`zip` is lazy: The elements won't be processed until the iterable is iterated on, e.g. by a :keyword:`!for` loop or by wrapping in a :class:`list`.
uk: :func:`zip` ледачий: елементи не будуть оброблені, доки не буде виконано ітерацію, напр. за допомогою циклу :keyword:`!for` або загортання в :class:`list`.

source: One thing to consider is that the iterables passed to :func:`zip` could have different lengths; sometimes by design, and sometimes because of a bug in the code that prepared these iterables. Python offers three different approaches to dealing with this issue:
uk: Варто взяти до уваги те, що ітератори, передані :func:`zip`, можуть мати різну довжину; іноді задумом, а іноді через помилку в коді, який підготував ці ітерації. Python пропонує три різні підходи до вирішення цієї проблеми:

source: By default, :func:`zip` stops when the shortest iterable is exhausted. It will ignore the remaining items in the longer iterables, cutting off the result to the length of the shortest iterable::
uk: За замовчуванням :func:`zip` зупиняється, коли вичерпується найкоротша ітерація. Він ігноруватиме решта елементів у довших ітераціях, відрізаючи результат до довжини найкоротшої ітерації::

source: :func:`zip` is often used in cases where the iterables are assumed to be of equal length. In such cases, it's recommended to use the ``strict=True`` option. Its output is the same as regular :func:`zip`::
uk: :func:`zip` часто використовується у випадках, коли передбачається, що ітератори мають однакову довжину. У таких випадках рекомендується використовувати параметр ``strict=True``. Його вихід такий самий, як і звичайний :func:`zip`::

source: Unlike the default behavior, it checks that the lengths of iterables are identical, raising a :exc:`ValueError` if they aren't:
uk: На відміну від поведінки за замовчуванням, він перевіряє, що довжини ітерованих елементів ідентичні, викликаючи :exc:`ValueError`, якщо вони не є:

source: Without the ``strict=True`` argument, any bug that results in iterables of different lengths will be silenced, possibly manifesting as a hard-to-find bug in another part of the program.
uk: Без аргументу ``strict=True`` будь-яка помилка, яка призводить до ітерацій різної довжини, буде замовчена, можливо, проявляючись як помилка, яку важко знайти в іншій частині програми.

source: Shorter iterables can be padded with a constant value to make all the iterables have the same length. This is done by :func:`itertools.zip_longest`.
uk: Коротші ітератори можна доповнити постійним значенням, щоб усі ітератори мали однакову довжину. Це робить :func:`itertools.zip_longest`.

source: Edge cases: With a single iterable argument, :func:`zip` returns an iterator of 1-tuples. With no arguments, it returns an empty iterator.
uk: Граничні випадки: з одним ітерованим аргументом :func:`zip` повертає ітератор 1-кортежів. Без аргументів він повертає порожній ітератор.

source: Tips and tricks:
uk: Поради та підказки:

source: The left-to-right evaluation order of the iterables is guaranteed. This makes possible an idiom for clustering a data series into n-length groups using ``zip(*[iter(s)]*n, strict=True)``. This repeats the *same* iterator ``n`` times so that each output tuple has the result of ``n`` calls to the iterator. This has the effect of dividing the input into n-length chunks.
uk: Порядок оцінки ітерацій зліва направо гарантується. Це робить можливою ідіому для кластеризації рядів даних у групи довжини n за допомогою ``zip(*[iter(s)]*n, strict=True)``. Це повторює *той самий* ітератор ``n`` разів, щоб кожен вихідний кортеж мав результат ``n`` викликів ітератора. Це призводить до поділу вхідних даних на фрагменти довжиною n.

source: :func:`zip` in conjunction with the ``*`` operator can be used to unzip a list::
uk: :func:`zip` у поєднанні з оператором ``*`` можна використовувати для розпакування списку::

source: Added the ``strict`` argument.
uk: Додано аргумент ``строгий``.

source: This is an advanced function that is not needed in everyday Python programming, unlike :func:`importlib.import_module`.
uk: Це розширена функція, яка не потрібна в повсякденному програмуванні на Python, на відміну від :func:`importlib.import_module`.
