Repository: seanpm2001/python-docs-uk
Catalog: library/functions.po
Languages: uk

source: *errors* is an optional string that specifies how encoding and decoding errors are to be handled—this cannot be used in binary mode. A variety of standard error handlers are available (listed under :ref:`error-handlers`), though any error handling name that has been registered with :func:`codecs.register_error` is also valid. The standard names include:
uk: *errors* — це необов’язковий рядок, який визначає, як мають оброблятися помилки кодування та декодування — це не можна використовувати в двійковому режимі. Доступні різноманітні стандартні обробники помилок (перераховані в :ref:`error-handlers`), хоча будь-яка назва обробки помилок, зареєстрована в :func:`codecs.register_error`, також дійсна. Стандартні назви включають:

source: ``'strict'`` to raise a :exc:`ValueError` exception if there is an encoding error. The default value of ``None`` has the same effect.
uk: ``'strict'``, щоб викликати виключення :exc:`ValueError`, якщо є помилка кодування. Значення за замовчуванням "Немає" має той самий ефект.

source: ``'ignore'`` ignores errors. Note that ignoring encoding errors can lead to data loss.
uk: ``'ignore''`` ігнорує помилки. Зауважте, що ігнорування помилок кодування може призвести до втрати даних.

source: ``'replace'`` causes a replacement marker (such as ``'?'``) to be inserted where there is malformed data.
uk: ``'replace'`` вставляє маркер заміни (наприклад, ``'?'``), де є неправильно сформовані дані.

source: ``'surrogateescape'`` will represent any incorrect bytes as low surrogate code units ranging from U+DC80 to U+DCFF. These surrogate code units will then be turned back into the same bytes when the ``surrogateescape`` error handler is used when writing data. This is useful for processing files in an unknown encoding.
uk: ``'surrogateescape'`` представлятиме будь-які неправильні байти як одиниці нижнього сурогатного коду в діапазоні від U+DC80 до U+DCFF. Ці одиниці сурогатного коду потім будуть перетворені назад у ті самі байти, коли під час запису даних використовується обробник помилок ``surrogateescape``. Це корисно для обробки файлів у невідомому кодуванні.

source: ``'xmlcharrefreplace'`` is only supported when writing to a file. Characters not supported by the encoding are replaced with the appropriate XML character reference ``&#nnn;``.
uk: ``'xmlcharrefreplace'`` підтримується лише під час запису у файл. Символи, які не підтримуються кодуванням, замінюються відповідним посиланням на символ XML ``&#nnn;``.

source: ``'backslashreplace'`` replaces malformed data by Python's backslashed escape sequences.
uk: ``'backslashreplace'`` замінює некоректні дані керуючими послідовностями Python зі зворотною похилою рискою.

source: ``'namereplace'`` (also only supported when writing) replaces unsupported characters with ``\N{...}`` escape sequences.
uk: ``'namereplace'`` (також підтримується лише під час запису) замінює непідтримувані символи ``\N{...}`` керуючими послідовностями.

source: When reading input from the stream, if *newline* is ``None``, universal newlines mode is enabled. Lines in the input can end in ``'\n'``, ``'\r'``, or ``'\r\n'``, and these are translated into ``'\n'`` before being returned to the caller. If it is ``''``, universal newlines mode is enabled, but line endings are returned to the caller untranslated. If it has any of the other legal values, input lines are only terminated by the given string, and the line ending is returned to the caller untranslated.
uk: Під час читання вхідних даних із потоку, якщо *новий рядок* має значення ``None``, увімкнено універсальний режим нових рядків. Рядки у вхідних даних можуть закінчуватися на ``'\n'``, ``'\r'`` або ``'\r\n'``, і вони перекладаються на ``'\n'`` перед поверненням до абонента. Якщо це ``''``, універсальний режим нових рядків увімкнено, але закінчення рядків повертаються абоненту без перекладу. Якщо він має будь-яке з інших дозволених значень, рядки введення завершуються лише заданим рядком, а закінчення рядка повертається до викликаючого без перекладу.

source: When writing output to the stream, if *newline* is ``None``, any ``'\n'`` characters written are translated to the system default line separator, :data:`os.linesep`. If *newline* is ``''`` or ``'\n'``, no translation takes place. If *newline* is any of the other legal values, any ``'\n'`` characters written are translated to the given string.
uk: Під час запису вихідних даних у потік, якщо *новий рядок* має значення ``None``, будь-які записані символи ``'\n'`` переводяться в системний роздільник рядків за умовчанням, :data:`os.linesep`. Якщо *новий рядок* є ``''`` або ``'\n'``, переклад не відбувається. Якщо *новий рядок* є будь-яким іншим допустимим значенням, будь-які написані символи ``'\n'`` переводяться в заданий рядок.

source: If *closefd* is ``False`` and a file descriptor rather than a filename was given, the underlying file descriptor will be kept open when the file is closed. If a filename is given *closefd* must be ``True`` (the default); otherwise, an error will be raised.
uk: Якщо *closefd* має значення ``False`` і вказано дескриптор файлу, а не ім’я файлу, базовий дескриптор файлу залишатиметься відкритим, коли файл буде закрито. Якщо вказано ім’я файлу *closefd* має бути ``True`` (за замовчуванням); інакше виникне помилка.

source: A custom opener can be used by passing a callable as *opener*. The underlying file descriptor for the file object is then obtained by calling *opener* with (*file*, *flags*). *opener* must return an open file descriptor (passing :mod:`os.open` as *opener* results in functionality similar to passing ``None``).
uk: Спеціальний відкривач можна використовувати, передавши виклик як *opener*. Базовий файловий дескриптор для об’єкта файлу потім отримується шляхом виклику *opener* за допомогою (*file*, *flags*). *opener* має повертати дескриптор відкритого файлу (передача :mod:`os.open` як *opener* призводить до функціональності, подібної до передачі ``None``).

source: The newly created file is :ref:`non-inheritable <fd_inheritance>`.
uk: Щойно створений файл :ref:`не успадковується <fd_inheritance>`.

source: The following example uses the :ref:`dir_fd <dir_fd>` parameter of the :func:`os.open` function to open a file relative to a given directory::
uk: У наступному прикладі використовується параметр :ref:`dir_fd <dir_fd>` функції :func:`os.open` для відкриття файлу відносно заданого каталогу::

source: The type of :term:`file object` returned by the :func:`open` function depends on the mode. When :func:`open` is used to open a file in a text mode (``'w'``, ``'r'``, ``'wt'``, ``'rt'``, etc.), it returns a subclass of :class:`io.TextIOBase` (specifically :class:`io.TextIOWrapper`). When used to open a file in a binary mode with buffering, the returned class is a subclass of :class:`io.BufferedIOBase`. The exact class varies: in read binary mode, it returns an :class:`io.BufferedReader`; in write binary and append binary modes, it returns an :class:`io.BufferedWriter`, and in read/write mode, it returns an :class:`io.BufferedRandom`. When buffering is disabled, the raw stream, a subclass of :class:`io.RawIOBase`, :class:`io.FileIO`, is returned.
uk: Тип об’єкта :term:`file object`, який повертає функція :func:`open`, залежить від режиму. Коли :func:`open` використовується для відкриття файлу в текстовому режимі (``'w'``, ``'r'``, ``'wt'``, ``'rt'``, тощо), він повертає підклас :class:`io.TextIOBase` (зокрема :class:`io.TextIOWrapper`). Коли файл використовується для відкриття файлу в бінарному режимі з буферизацією, повертається клас є підкласом :class:`io.BufferedIOBase`. Точний клас різниться: у бінарному режимі читання він повертає :class:`io.BufferedReader`; у двійкових режимах запису та додавання повертає :class:`io.BufferedWriter`, а в режимі читання/запису повертає :class:`io.BufferedRandom`. Коли буферизацію вимкнено, повертається необроблений потік, підклас :class:`io.RawIOBase`, :class:`io.FileIO`.

source: See also the file handling modules, such as :mod:`fileinput`, :mod:`io` (where :func:`open` is declared), :mod:`os`, :mod:`os.path`, :mod:`tempfile`, and :mod:`shutil`.
uk: Перегляньте також модулі обробки файлів, такі як :mod:`fileinput`, :mod:`io` (де оголошено :func:`open`), :mod:`os`, :mod:`os.path`, :mod:`tempfile` і :mod:`shutil`.

source: Raises an :ref:`auditing event <auditing>` ``open`` with arguments ``file``, ``mode``, ``flags``.
uk: Викликає :ref:`подію аудиту <auditing>` ``open`` з аргументами ``file``, ``mode``, ``flags``.

source: The ``mode`` and ``flags`` arguments may have been modified or inferred from the original call.
uk: Аргументи ``mode`` і ``flags`` могли бути змінені або виведені з початкового виклику.

source: The *opener* parameter was added.
uk: Додано параметр *opener*.

source: The ``'x'`` mode was added.
uk: Додано режим ``'x``.

source: :exc:`IOError` used to be raised, it is now an alias of :exc:`OSError`.
uk: :exc:`IOError` раніше викликався, тепер це псевдонім :exc:`OSError`.

source: :exc:`FileExistsError` is now raised if the file opened in exclusive creation mode (``'x'``) already exists.
uk: :exc:`FileExistsError` тепер викликається, якщо файл, відкритий у монопольному режимі створення (``'x'``), уже існує.

source: The file is now non-inheritable.
uk: Тепер файл не успадковується.

source: If the system call is interrupted and the signal handler does not raise an exception, the function now retries the system call instead of raising an :exc:`InterruptedError` exception (see :pep:`475` for the rationale).
uk: Якщо системний виклик перервано, а обробник сигналу не викликає виключення, функція тепер повторює системний виклик замість того, щоб викликати виняток :exc:`InterruptedError` (перегляньте :pep:`475` для обґрунтування).

source: The ``'namereplace'`` error handler was added.
uk: Додано обробник помилок ``'namereplace'``.

source: Support added to accept objects implementing :class:`os.PathLike`.
uk: Додано підтримку прийняття об’єктів, що реалізують :class:`os.PathLike`.

source: On Windows, opening a console buffer may return a subclass of :class:`io.RawIOBase` other than :class:`io.FileIO`.
uk: У Windows відкриття буфера консолі може повернути підклас :class:`io.RawIOBase`, відмінний від :class:`io.FileIO`.

source: Given a string representing one Unicode character, return an integer representing the Unicode code point of that character. For example, ``ord('a')`` returns the integer ``97`` and ``ord('€')`` (Euro sign) returns ``8364``. This is the inverse of :func:`chr`.
uk: Дано рядок, що представляє один символ Unicode, повертає ціле число, що представляє код Unicode цього символу. Наприклад, ``ord('a')`` повертає ціле число ``97``, ``ord('€')`` (знак євро) повертає ``8364``. Це зворотне до :func:`chr`.

source: Return *base* to the power *exp*; if *mod* is present, return *base* to the power *exp*, modulo *mod* (computed more efficiently than ``pow(base, exp) % mod``). The two-argument form ``pow(base, exp)`` is equivalent to using the power operator: ``base**exp``.
uk: Повернути *base* до потужності *exp*; якщо присутній *mod*, повертає *base* до ступеня *exp*, за модулем *mod* (обчислюється ефективніше, ніж ``pow(base, exp) % mod``). Форма з двома аргументами ``pow(base, exp)`` еквівалентна використанню оператора ступеня: ``base**exp``.

source: The arguments must have numeric types. With mixed operand types, the coercion rules for binary arithmetic operators apply. For :class:`int` operands, the result has the same type as the operands (after coercion) unless the second argument is negative; in that case, all arguments are converted to float and a float result is delivered. For example, ``pow(10, 2)`` returns ``100``, but ``pow(10, -2)`` returns ``0.01``. For a negative base of type :class:`int` or :class:`float` and a non-integral exponent, a complex result is delivered. For example, ``pow(-9, 0.5)`` returns a value close to ``3j``.
uk: Аргументи повинні мати числові типи. Для змішаних типів операндів застосовуються правила приведення для двійкових арифметичних операторів. Для операндів :class:`int` результат має той самий тип, що й операнди (після приведення), якщо другий аргумент не є від’ємним; у цьому випадку всі аргументи перетворюються на значення float і видає результат float. Наприклад, ``pow(10, 2)`` повертає ``100``, а ``pow(10, -2)`` повертає ``0,01``. Для від’ємної основи типу :class:`int` або :class:`float` і нецілісного показника видається комплексний результат. Наприклад, ``pow(-9, 0.5)`` повертає значення, близьке до ``3j``.

source: For :class:`int` operands *base* and *exp*, if *mod* is present, *mod* must also be of integer type and *mod* must be nonzero. If *mod* is present and *exp* is negative, *base* must be relatively prime to *mod*. In that case, ``pow(inv_base, -exp, mod)`` is returned, where *inv_base* is an inverse to *base* modulo *mod*.
uk: Для :class:`int` операндів *base* і *exp*, якщо присутній *mod*, *mod* також має бути цілого типу, а *mod* має бути ненульовим. Якщо *mod* присутній і *exp* від’ємний, *base* має бути відносно простим до *mod*. У цьому випадку повертається ``pow(inv_base, -exp, mod)``, де *inv_base* є оберненим до *base* за модулем *mod*.

source: Here's an example of computing an inverse for ``38`` modulo ``97``::
uk: Ось приклад обчислення оберненого числа для ``38`` за модулем ``97``::

source: For :class:`int` operands, the three-argument form of ``pow`` now allows the second argument to be negative, permitting computation of modular inverses.
uk: Для операндів :class:`int` форма з трьома аргументами ``pow`` тепер дозволяє другому аргументу бути від’ємним, що дозволяє обчислювати модульні обернені.

source: Allow keyword arguments. Formerly, only positional arguments were supported.
uk: Дозволити аргументи ключових слів. Раніше підтримувалися лише позиційні аргументи.

source: Print *objects* to the text stream *file*, separated by *sep* and followed by *end*. *sep*, *end*, *file*, and *flush*, if present, must be given as keyword arguments.
uk: Вивести *об’єкти* в *файл* текстового потоку, розділивши *sep* і супроводжуючи *end*. *sep*, *end*, *file* і *flush*, якщо вони присутні, потрібно надати як аргументи ключового слова.

source: All non-keyword arguments are converted to strings like :func:`str` does and written to the stream, separated by *sep* and followed by *end*. Both *sep* and *end* must be strings; they can also be ``None``, which means to use the default values. If no *objects* are given, :func:`print` will just write *end*.
uk: Усі аргументи, не пов’язані з ключовими словами, перетворюються на рядки, як це робить :func:`str`, і записуються в потік, розділені символом *sep* і після нього *end*. І *sep*, і *end* повинні бути рядками; вони також можуть бути ``None``, що означає використання стандартних значень. Якщо *об’єктів* не надано, :func:`print` просто напише *end*.

source: The *file* argument must be an object with a ``write(string)`` method; if it is not present or ``None``, :data:`sys.stdout` will be used. Since printed arguments are converted to text strings, :func:`print` cannot be used with binary mode file objects. For these, use ``file.write(...)`` instead.
uk: Аргумент *file* має бути об’єктом із методом ``write(string)``; якщо його немає або ``None``, буде використано :data:`sys.stdout`. Оскільки надруковані аргументи перетворюються на текстові рядки, :func:`print` не можна використовувати з об’єктами файлу двійкового режиму. Для цього замість цього використовуйте ``file.write(...)``.

source: Whether the output is buffered is usually determined by *file*, but if the *flush* keyword argument is true, the stream is forcibly flushed.
uk: Чи буферизований вихід зазвичай визначається *файлом*, але якщо аргумент ключового слова *flush* має значення true, потік примусово очищується.

source: Added the *flush* keyword argument.
uk: Додано аргумент ключового слова *flush*.

source: Return a property attribute.
uk: Повертає атрибут властивості.

source: *fget* is a function for getting an attribute value. *fset* is a function for setting an attribute value. *fdel* is a function for deleting an attribute value. And *doc* creates a docstring for the attribute.
uk: *fget* — це функція для отримання значення атрибута. *fset* — це функція для встановлення значення атрибута. *fdel* — це функція для видалення значення атрибута. А *doc* створює рядок документації для атрибута.

source: A typical use is to define a managed attribute ``x``::
uk: Типовим використанням є визначення керованого атрибута ``x``::

source: If *c* is an instance of *C*, ``c.x`` will invoke the getter, ``c.x = value`` will invoke the setter, and ``del c.x`` the deleter.
uk: Якщо *c* є екземпляром *C*, ``c.x`` викличе засіб отримання, ``c.x = value`` викличе установник, а ``del c.x`` засіб видалення.

source: If given, *doc* will be the docstring of the property attribute. Otherwise, the property will copy *fget*'s docstring (if it exists). This makes it possible to create read-only properties easily using :func:`property` as a :term:`decorator`::
uk: Якщо вказано, *doc* буде рядком документації атрибута властивості. В іншому випадку властивість скопіює рядок документа *fget* (якщо він існує). Це дає змогу легко створювати властивості лише для читання, використовуючи :func:`property` як :term:`decorator`::

source: The ``@property`` decorator turns the :meth:`voltage` method into a "getter" for a read-only attribute with the same name, and it sets the docstring for *voltage* to "Get the current voltage."
uk: Декоратор ``@property`` перетворює метод :meth:`voltage` на "отримувач" для атрибута лише для читання з такою самою назвою, і встановлює рядок документації для *voltage* на "Отримати поточну напругу".

source: A property object has :attr:`~property.getter`, :attr:`~property.setter`, and :attr:`~property.deleter` methods usable as decorators that create a copy of the property with the corresponding accessor function set to the decorated function. This is best explained with an example::
uk: Об’єкт властивості має методи :attr:`~property.getter`, :attr:`~property.setter` і :attr:`~property.deleter`, які можна використовувати як декоратори, які створюють копію властивості з відповідною функцією доступу встановлено на декоровану функцію. Це найкраще пояснити на прикладі::

source: This code is exactly equivalent to the first example. Be sure to give the additional functions the same name as the original property (``x`` in this case.)
uk: Цей код точно еквівалентний першому прикладу. Обов’язково дайте додатковим функціям те саме ім’я, що й початкова властивість (у цьому випадку ``x``).

source: The returned property object also has the attributes ``fget``, ``fset``, and ``fdel`` corresponding to the constructor arguments.
uk: Повернений об’єкт властивості також має атрибути ``fget``, ``fset`` і ``fdel``, що відповідають аргументам конструктора.

source: The docstrings of property objects are now writeable.
uk: Рядки документації об’єктів властивості тепер доступні для запису.

source: Rather than being a function, :class:`range` is actually an immutable sequence type, as documented in :ref:`typesseq-range` and :ref:`typesseq`.
uk: Замість того, щоб бути функцією, :class:`range` насправді є незмінним типом послідовності, як описано в :ref:`typesseq-range` і :ref:`typesseq`.

source: Return a reverse :term:`iterator`. *seq* must be an object which has a :meth:`__reversed__` method or supports the sequence protocol (the :meth:`__len__` method and the :meth:`__getitem__` method with integer arguments starting at ``0``).
uk: Повертає зворотний :term:`iterator`. *seq* має бути об’єктом, який має метод :meth:`__reversed__` або підтримує протокол послідовності (метод :meth:`__len__` і метод :meth:`__getitem__` з цілими аргументами, починаючи з ``0`` ).

source: Return *number* rounded to *ndigits* precision after the decimal point. If *ndigits* is omitted or is ``None``, it returns the nearest integer to its input.
uk: Повертає *число*, округлене до *nцифр* з точністю після коми. Якщо *ndigits* опущено або має значення ``None``, він повертає найближче ціле число до вхідних даних.

source: For the built-in types supporting :func:`round`, values are rounded to the closest multiple of 10 to the power minus *ndigits*; if two multiples are equally close, rounding is done toward the even choice (so, for example, both ``round(0.5)`` and ``round(-0.5)`` are ``0``, and ``round(1.5)`` is ``2``). Any integer value is valid for *ndigits* (positive, zero, or negative). The return value is an integer if *ndigits* is omitted or ``None``. Otherwise, the return value has the same type as *number*.
uk: Для вбудованих типів, які підтримують :func:`round`, значення округлюються до найближчого кратного 10 у степені мінус *ndigits*; якщо два кратні однаково близькі, округлення виконується в бік парного вибору (тому, наприклад, як``round(0.5)``, так і ``round(-0.5)`` є ``0``, а ``round(1.5)`` є ``2``). Будь-яке ціле значення є дійсним для *nцифр* (додатне, нульове або від’ємне). Повернене значення є цілим числом, якщо *ndigits* пропущено або ``None``. В іншому випадку значення, що повертається, має той самий тип, що й *число*.

source: For a general Python object ``number``, ``round`` delegates to ``number.__round__``.
uk: Для загального об’єкта Python ``number`` ``round`` делегує ``number.__round__``.

source: The behavior of :func:`round` for floats can be surprising: for example, ``round(2.675, 2)`` gives ``2.67`` instead of the expected ``2.68``. This is not a bug: it's a result of the fact that most decimal fractions can't be represented exactly as a float. See :ref:`tut-fp-issues` for more information.
uk: Поведінка :func:`round` для числа з плаваючою точкою може бути несподіваною: наприклад, ``round(2.675, 2)`` дає ``2.67`` замість очікуваного ``2.68``. Це не помилка: це результат того факту, що більшість десяткових дробів не можна представити точно як число з плаваючою точкою. Перегляньте :ref:`tut-fp-issues` для отримання додаткової інформації.

source: Return a new :class:`set` object, optionally with elements taken from *iterable*. ``set`` is a built-in class. See :class:`set` and :ref:`types-set` for documentation about this class.
uk: Повертає новий об’єкт :class:`set`, необов’язково з елементами, взятими з *iterable*. ``набір`` є вбудованим класом. Перегляньте :class:`set` і :ref:`types-set` для документації про цей клас.

source: For other containers see the built-in :class:`frozenset`, :class:`list`, :class:`tuple`, and :class:`dict` classes, as well as the :mod:`collections` module.
uk: Для інших контейнерів перегляньте вбудовані класи :class:`frozenset`, :class:`list`, :class:`tuple` і :class:`dict`, а також модуль :mod:`collections`.

source: This is the counterpart of :func:`getattr`. The arguments are an object, a string, and an arbitrary value. The string may name an existing attribute or a new attribute. The function assigns the value to the attribute, provided the object allows it. For example, ``setattr(x, 'foobar', 123)`` is equivalent to ``x.foobar = 123``.
uk: Це відповідник :func:`getattr`. Аргументами є об’єкт, рядок і довільне значення. Рядок може називати існуючий атрибут або новий атрибут. Функція присвоює значення атрибуту, якщо це дозволяє об’єкт. Наприклад, ``setattr(x, 'foobar', 123)`` еквівалентно ``x.foobar = 123``.

source: Since :ref:`private name mangling <private-name-mangling>` happens at compilation time, one must manually mangle a private attribute's (attributes with two leading underscores) name in order to set it with :func:`setattr`.
uk: Оскільки :ref:`викривлення приватного імені <private-name-mangling>` відбувається під час компіляції, потрібно вручну спотворити ім’я приватного атрибута (атрибути з двома символами підкреслення на початку), щоб встановити його за допомогою :func:`setattr`.
