Repository: seanpm2001/python-docs-uk
Catalog: library/grp.po
Languages: uk

source: :mod:`grp` --- The group database
uk: :mod:`grp` --- База даних групи

source: This module provides access to the Unix group database. It is available on all Unix versions.
uk: Цей модуль забезпечує доступ до бази даних групи Unix. Він доступний у всіх версіях Unix.

source: Group database entries are reported as a tuple-like object, whose attributes correspond to the members of the ``group`` structure (Attribute field below, see ``<grp.h>``):
uk: Записи бази даних групи повідомляються як кортежний об’єкт, атрибути якого відповідають членам структури ``групи`` (поле атрибута нижче, див. ``<grp.h>``):

source: Index
uk: Індекс

source: Attribute
uk: Атрибут

source: Meaning
uk: Значення

source: the name of the group
uk: назва групи

source: the (encrypted) group password; often empty
uk: (зашифрований) пароль групи; часто порожній

source: the numerical group ID
uk: ідентифікатор числової групи

source: all the group member's user names
uk: імена всіх учасників групи

source: The gid is an integer, name and password are strings, and the member list is a list of strings. (Note that most users are not explicitly listed as members of the group they are in according to the password database. Check both databases to get complete membership information. Also note that a ``gr_name`` that starts with a ``+`` or ``-`` is likely to be a YP/NIS reference and may not be accessible via :func:`getgrnam` or :func:`getgrgid`.)
uk: Gid — це ціле число, ім’я та пароль — це рядки, а список учасників — це список рядків. (Зауважте, що більшість користувачів явно не вказані як члени групи, до якої вони належать, відповідно до бази даних паролів. Перевірте обидві бази даних, щоб отримати повну інформацію про членство. Також зауважте, що ``gr_name``, яке починається з ``+`` або ``-``, ймовірно, є посиланням на YP/NIS і може бути недоступним через :func:`getgrnam` або :func:`getgrgid`.)

source: It defines the following items:
uk: Він визначає такі пункти:

source: Return the group database entry for the given numeric group ID. :exc:`KeyError` is raised if the entry asked for cannot be found.
uk: Повертає запис бази даних групи для вказаного числового ідентифікатора групи. :exc:`KeyError` виникає, якщо запитуваний запис не знайдено.

source: Return the group database entry for the given group name. :exc:`KeyError` is raised if the entry asked for cannot be found.
uk: Повертає запис бази даних групи для заданої назви групи. :exc:`KeyError` виникає, якщо запитуваний запис не знайдено.

source: Return a list of all available group entries, in arbitrary order.
uk: Повертає список усіх доступних групових записів у довільному порядку.

source: Module :mod:`pwd`
uk: Модуль :mod:`pwd`

source: An interface to the user database, similar to this.
uk: Подібний до цього інтерфейс до бази даних користувача.

source: Module :mod:`spwd`
uk: Модуль :mod:`spwd`

source: An interface to the shadow password database, similar to this.
uk: Подібний до цього інтерфейс тіньової бази даних паролів.
