Repository: seanpm2001/python-docs-uk
Catalog: library/html.parser.po
Languages: uk

source: :mod:`html.parser` --- Simple HTML and XHTML parser
uk: :mod:`html.parser` --- Простий аналізатор HTML та XHTML

source: **Source code:** :source:`Lib/html/parser.py`
uk: **Вихідний код:** :source:`Lib/html/parser.py`

source: This module defines a class :class:`HTMLParser` which serves as the basis for parsing text files formatted in HTML (HyperText Mark-up Language) and XHTML.
uk: Цей модуль визначає клас :class:`HTMLParser`, який служить основою для аналізу текстових файлів, відформатованих у HTML (HyperText Mark-up Language) і XHTML.

source: Create a parser instance able to parse invalid markup.
uk: Створіть екземпляр парсера, здатний аналізувати недійсну розмітку.

source: If *convert_charrefs* is ``True`` (the default), all character references (except the ones in ``script``/``style`` elements) are automatically converted to the corresponding Unicode characters.
uk: Якщо *convert_charrefs* має значення ``True`` (за замовчуванням), усі посилання на символи (крім тих, що містяться в елементах ``script``/``style``) автоматично перетворюються на відповідні символи Unicode.

source: An :class:`.HTMLParser` instance is fed HTML data and calls handler methods when start tags, end tags, text, comments, and other markup elements are encountered. The user should subclass :class:`.HTMLParser` and override its methods to implement the desired behavior.
uk: Екземпляр :class:`.HTMLParser` отримує дані HTML і викликає методи обробки, коли зустрічаються початкові теги, кінцеві теги, текст, коментарі та інші елементи розмітки. Користувач повинен створити підклас :class:`.HTMLParser` і перевизначити його методи для реалізації бажаної поведінки.

source: This parser does not check that end tags match start tags or call the end-tag handler for elements which are closed implicitly by closing an outer element.
uk: Цей синтаксичний аналізатор не перевіряє відповідність кінцевих тегів початковим тегам і не викликає обробник кінцевих тегів для елементів, які закриваються неявно шляхом закриття зовнішнього елемента.

source: *convert_charrefs* keyword argument added.
uk: Додано аргумент ключового слова *convert_charrefs*.

source: The default value for argument *convert_charrefs* is now ``True``.
uk: Значення за замовчуванням для аргументу *convert_charrefs* тепер ``True``.

source: Example HTML Parser Application
uk: Приклад програми аналізатора HTML

source: As a basic example, below is a simple HTML parser that uses the :class:`HTMLParser` class to print out start tags, end tags, and data as they are encountered::
uk: Як базовий приклад, нижче наведено простий аналізатор HTML, який використовує клас :class:`HTMLParser` для виведення початкових тегів, кінцевих тегів і даних у міру їх зустрічі::

source: The output will then be:
uk: Результат буде таким:

source: :class:`.HTMLParser` Methods
uk: :class:`.HTMLParser` Методи

source: :class:`HTMLParser` instances have the following methods:
uk: Екземпляри :class:`HTMLParser` мають такі методи:

source: Feed some text to the parser. It is processed insofar as it consists of complete elements; incomplete data is buffered until more data is fed or :meth:`close` is called. *data* must be :class:`str`.
uk: Подати текст до синтаксичного аналізатора. Він обробляється, оскільки складається з повних елементів; неповні дані буферизуються, поки не буде подано більше даних або не буде викликано :meth:`close`. *data* має бути :class:`str`.

source: Force processing of all buffered data as if it were followed by an end-of-file mark. This method may be redefined by a derived class to define additional processing at the end of the input, but the redefined version should always call the :class:`HTMLParser` base class method :meth:`close`.
uk: Примусова обробка всіх буферизованих даних так, ніби за ними стоїть позначка кінця файлу. Цей метод може бути перевизначений похідним класом, щоб визначити додаткову обробку в кінці введення, але перевизначена версія завжди повинна викликати метод базового класу :class:`HTMLParser` :meth:`close`.

source: Reset the instance. Loses all unprocessed data. This is called implicitly at instantiation time.
uk: Скинути примірник. Втрачає всі необроблені дані. Це викликається неявно під час створення екземпляра.

source: Return current line number and offset.
uk: Повернути поточний номер рядка та зсув.

source: Return the text of the most recently opened start tag. This should not normally be needed for structured processing, but may be useful in dealing with HTML "as deployed" or for re-generating input with minimal changes (whitespace between attributes can be preserved, etc.).
uk: Повертає текст останнього відкритого початкового тегу. Зазвичай це не потрібно для структурованої обробки, але може бути корисним для роботи з HTML "у розгорнутому стані" або для повторного створення вхідних даних із мінімальними змінами (можна зберегти пробіли між атрибутами тощо).

source: The following methods are called when data or markup elements are encountered and they are meant to be overridden in a subclass. The base class implementations do nothing (except for :meth:`~HTMLParser.handle_startendtag`):
uk: Наступні методи викликаються, коли зустрічаються дані або елементи розмітки, і вони призначені для перевизначення в підкласі. Реалізації базового класу нічого не роблять (крім :meth:`~HTMLParser.handle_startendtag`):

source: This method is called to handle the start tag of an element (e.g. ``<div id="main">``).
uk: Цей метод викликається для обробки початкового тегу елемента (наприклад, ``<div id="main">``).

source: The *tag* argument is the name of the tag converted to lower case. The *attrs* argument is a list of ``(name, value)`` pairs containing the attributes found inside the tag's ``<>`` brackets. The *name* will be translated to lower case, and quotes in the *value* have been removed, and character and entity references have been replaced.
uk: Аргумент *тег* — це назва тегу, перетворена в нижній регістр. Аргумент *attrs* — це список пар ``(ім’я, значення)``, що містить атрибути, що містяться в дужках ``<>`` тегу. *Ім’я* буде перекладено на нижній регістр, а лапки в *значенні* видалено, а посилання на символи та сутності замінено.

source: For instance, for the tag ``<A HREF="https://www.cwi.nl/">``, this method would be called as ``handle_starttag('a', [('href', 'https://www.cwi.nl/')])``.
uk: Наприклад, для тегу ``<A HREF="https://www.cwi.nl/">`` цей метод буде називатися ``handle_starttag('a', [('href', 'https://www.cwi.nl/')])``.

source: All entity references from :mod:`html.entities` are replaced in the attribute values.
uk: Усі посилання на сутності з :mod:`html.entities` замінюються в значеннях атрибутів.

source: This method is called to handle the end tag of an element (e.g. ``</div>``).
uk: Цей метод викликається для обробки кінцевого тегу елемента (наприклад, ``</div>``).

source: The *tag* argument is the name of the tag converted to lower case.
uk: Аргумент *тег* — це назва тегу, перетворена в нижній регістр.

source: Similar to :meth:`handle_starttag`, but called when the parser encounters an XHTML-style empty tag (``<img ... />``). This method may be overridden by subclasses which require this particular lexical information; the default implementation simply calls :meth:`handle_starttag` and :meth:`handle_endtag`.
uk: Подібно до :meth:`handle_starttag`, але викликається, коли аналізатор зустрічає порожній тег у стилі XHTML (``<img ... />``). Цей метод може бути замінений підкласами, які потребують саме цієї лексичної інформації; стандартна реалізація просто викликає :meth:`handle_starttag` і :meth:`handle_endtag`.

source: This method is called to process arbitrary data (e.g. text nodes and the content of ``<script>...</script>`` and ``<style>...</style>``).
uk: Цей метод викликається для обробки довільних даних (наприклад, текстових вузлів і вмісту ``<script> ... </script>`` і ``<style> ... </style>``).

source: This method is called to process a named character reference of the form ``&name;`` (e.g. ``&gt;``), where *name* is a general entity reference (e.g. ``'gt'``). This method is never called if *convert_charrefs* is ``True``.
uk: Цей метод викликається для обробки іменованого посилання на символ у формі ``&name;`` (наприклад, ``&gt;``), де *name* є загальним посиланням на сутність (наприклад ``'gt'``). Цей метод ніколи не викликається, якщо *convert_charrefs* має значення ``True``.

source: This method is called to process decimal and hexadecimal numeric character references of the form ``&#NNN;`` and ``&#xNNN;``. For example, the decimal equivalent for ``&gt;`` is ``&#62;``, whereas the hexadecimal is ``&#x3E;``; in this case the method will receive ``'62'`` or ``'x3E'``. This method is never called if *convert_charrefs* is ``True``.
uk: Цей метод викликається для обробки посилань на десяткові та шістнадцяткові числові символи у формі ``&#NNN;`` і ``&#xNNN;``. Наприклад, десятковим еквівалентом для ``&gt;`` є ``&#62;``, тоді як шістнадцятковим є ``&#x3E;``; у цьому випадку метод отримає ``'62'`` або ``'x3E'``. Цей метод ніколи не викликається, якщо *convert_charrefs* має значення ``True``.

source: This method is called when a comment is encountered (e.g. ``<!--comment-->``).
uk: Цей метод викликається, коли зустрічається коментар (наприклад, ``<!--comment-->``).

source: For example, the comment ``<!-- comment -->`` will cause this method to be called with the argument ``' comment '``.
uk: Наприклад, коментар ``<!-- comment -->`` призведе до виклику цього методу з аргументом ``' comment ''``.

source: The content of Internet Explorer conditional comments (condcoms) will also be sent to this method, so, for ``<!--[if IE 9]>IE9-specific content<![endif]-->``, this method will receive ``'[if IE 9]>IE9-specific content<![endif]'``.
uk: Вміст умовних коментарів Internet Explorer (condcoms) також буде надіслано цьому методу, тому для ``<!--[if IE 9]> IE9-специфічного вмісту <![endif]-->`` цей метод отримає ``'[if IE 9]>IE9-специфічний вміст< ![endif]''``.

source: This method is called to handle an HTML doctype declaration (e.g. ``<!DOCTYPE html>``).
uk: Цей метод викликається для обробки декларації типу документа HTML (наприклад, ``<!DOCTYPE html>``).

source: The *decl* parameter will be the entire contents of the declaration inside the ``<!...>`` markup (e.g. ``'DOCTYPE html'``).
uk: Параметр *decl* буде повним вмістом оголошення всередині розмітки ``<!...>`` (наприклад, ``'DOCTYPE html'``).

source: Method called when a processing instruction is encountered. The *data* parameter will contain the entire processing instruction. For example, for the processing instruction ``<?proc color='red'>``, this method would be called as ``handle_pi("proc color='red'")``. It is intended to be overridden by a derived class; the base class implementation does nothing.
uk: Метод викликається, коли зустрічається інструкція обробки. Параметр *data* міститиме всю інструкцію обробки. Наприклад, для інструкції обробки ``<?proc color='red'>``, цей метод мав би викликатися як ``handle_pi("proc color='red'")``. Він призначений для перевизначення похідним класом; реалізація базового класу нічого не робить.

source: The :class:`HTMLParser` class uses the SGML syntactic rules for processing instructions. An XHTML processing instruction using the trailing ``'?'`` will cause the ``'?'`` to be included in *data*.
uk: Клас :class:`HTMLParser` використовує синтаксичні правила SGML для обробки інструкцій. Інструкція з обробки XHTML із використанням кінцевого ``'?''`` призведе до включення ``'?''`` до *даних*.

source: This method is called when an unrecognized declaration is read by the parser.
uk: Цей метод викликається, коли аналізатор читає нерозпізнану декларацію.

source: The *data* parameter will be the entire contents of the declaration inside the ``<![...]>`` markup. It is sometimes useful to be overridden by a derived class. The base class implementation does nothing.
uk: Параметр *data* буде повним вмістом оголошення всередині розмітки ``<![...]>``. Іноді корисно бути перевизначеним похідним класом. Реалізація базового класу нічого не робить.

source: Examples
uk: Приклади

source: The following class implements a parser that will be used to illustrate more examples::
uk: Наступний клас реалізує синтаксичний аналізатор, який використовуватиметься для ілюстрації інших прикладів:

source: Parsing a doctype::
uk: Розбір doctype::

source: Parsing an element with a few attributes and a title::
uk: Розбір елемента з декількома атрибутами та заголовком::

source: The content of ``script`` and ``style`` elements is returned as is, without further parsing::
uk: Вміст елементів ``script`` і ``style`` повертається як є, без подальшого аналізу::

source: Parsing comments::
uk: Розбір коментарів::

source: Parsing named and numeric character references and converting them to the correct char (note: these 3 references are all equivalent to ``'>'``)::
uk: Розбір іменованих і числових посилань на символи та їх перетворення на правильний char (примітка: всі ці 3 посилання еквівалентні ``'>'``)::

source: Feeding incomplete chunks to :meth:`~HTMLParser.feed` works, but :meth:`~HTMLParser.handle_data` might be called more than once (unless *convert_charrefs* is set to ``True``)::
uk: Передача неповних фрагментів до :meth:`~HTMLParser.feed` працює, але :meth:`~HTMLParser.handle_data` може викликатися кілька разів (якщо *convert_charrefs* не має значення ``True``)::

source: Parsing invalid HTML (e.g. unquoted attributes) also works::
uk: Розбір недійсного HTML (наприклад, атрибутів без лапок) також працює:
