Repository: seanpm2001/python-docs-uk
Catalog: library/importlib.resources.po
Languages: uk

source: :mod:`importlib.resources` -- Resources
uk: :mod:`importlib.resources` -- Ресурси

source: **Source code:** :source:`Lib/importlib/resources/__init__.py`
uk: **Вихідний код:** :source:`Lib/importlib/resources/__init__.py`

source: This module leverages Python's import system to provide access to *resources* within *packages*. If you can import a package, you can access resources within that package. Resources can be opened or read, in either binary or text mode.
uk: Цей модуль використовує систему імпорту Python для надання доступу до *ресурсів* у *пакетах*. Якщо ви можете імпортувати пакет, ви можете отримати доступ до ресурсів у цьому пакеті. Ресурси можна відкривати або читати як у двійковому, так і в текстовому режимі.

source: Resources are roughly akin to files inside directories, though it's important to keep in mind that this is just a metaphor. Resources and packages **do not** have to exist as physical files and directories on the file system.
uk: Ресурси приблизно схожі на файли всередині каталогів, хоча важливо мати на увазі, що це лише метафора. Ресурси та пакунки **не** мають існувати як фізичні файли та каталоги у файловій системі.

source: This module provides functionality similar to `pkg_resources <https://setuptools.readthedocs.io/en/latest/pkg_resources.html>`_ `Basic Resource Access <http://setuptools.readthedocs.io/en/latest/pkg_resources.html#basic-resource-access>`_ without the performance overhead of that package. This makes reading resources included in packages easier, with more stable and consistent semantics.
uk: Цей модуль забезпечує функціональність, подібну до `pkg_resources <https://setuptools.readthedocs.io/en/latest/pkg_resources.html>`_ `Basic Resource Access <http://setuptools.readthedocs.io/en/latest/pkg_resources.html#basic-resource-access>`_ без накладних витрат на продуктивність цього пакета. Це полегшує читання ресурсів, включених до пакетів, із більш стабільною та узгодженою семантикою.

source: The standalone backport of this module provides more information on `using importlib.resources <http://importlib-resources.readthedocs.io/en/latest/using.html>`_ and `migrating from pkg_resources to importlib.resources <http://importlib-resources.readthedocs.io/en/latest/migration.html>`_ and `migrating legacy usage <https://importlib-resources.readthedocs.io/en/latest/using.html#migrating-from-legacy>`_.
uk: Окремий бекпорт цього модуля надає більше інформації про `використання importlib.resources <http://importlib-resources.readthedocs.io/en/latest/using.html>`_ і `міграцію з pkg_resources на importlib.resources <http://importlib-resources.readthedocs.io/en/latest/migration.html>`_ і `міграцію застарілого використання <https://importlib-resources.readthedocs.io/en/latest/using.html#migrating-from-legacy>`_.

source: Loaders that wish to support resource reading should implement a ``get_resource_reader(fullname)`` method as specified by :class:`importlib.abc.ResourceReader`.
uk: Завантажувачі, які бажають підтримувати читання ресурсів, повинні реалізувати метод ``get_resource_reader(fullname)``, як зазначено в :class:`importlib.abc.ResourceReader`.

source: The following types are defined.
uk: Визначено наступні типи.

source: The ``Package`` type is defined as ``Union[str, ModuleType]``. This means that where the function describes accepting a ``Package``, you can pass in either a string or a module. Module objects must have a resolvable ``__spec__.submodule_search_locations`` that is not ``None``.
uk: Тип ``Package`` визначається як ``Union[str, ModuleType]``. Це означає, що там, де функція описує прийняття ``Package``, ви можете передати або рядок, або модуль. Об’єкти модуля повинні мати розв’язуваний ``__spec__.submodule_search_locations``, який не є ``None``.

source: This type describes the resource names passed into the various functions in this package. This is defined as ``Union[str, os.PathLike]``.
uk: Цей тип описує імена ресурсів, які передаються в різні функції в цьому пакеті. Це визначається як ``Union[str, os.PathLike]``.

source: The following functions are available.
uk: Доступні такі функції.

source: Returns an :class:`importlib.resources.abc.Traversable` object representing the resource container for the package (think directory) and its resources (think files). A Traversable may contain other containers (think subdirectories).
uk: Повертає об’єкт :class:`importlib.resources.abc.Traversable`, що представляє контейнер ресурсів для пакета (промисловий каталог) і його ресурси (промислові файли). Traversable може містити інші контейнери (наприклад, підкаталоги).

source: *package* is either a name or a module object which conforms to the ``Package`` requirements.
uk: *package* — це ім’я або об’єкт модуля, який відповідає вимогам ``Package``.

source: Given a :class:`importlib.resources.abc.Traversable` object representing a file, typically from :func:`importlib.resources.files`, return a context manager for use in a :keyword:`with` statement. The context manager provides a :class:`pathlib.Path` object.
uk: Враховуючи об’єкт :class:`importlib.resources.abc.Traversable`, який представляє файл, як правило, з :func:`importlib.resources.files`, повертає менеджер контексту для використання в операторі :keyword:`with`. Менеджер контексту надає об’єкт :class:`pathlib.Path`.

source: Exiting the context manager cleans up any temporary file created when the resource was extracted from e.g. a zip file.
uk: Вихід із контекстного менеджера очищає будь-які тимчасові файли, створені під час вилучення ресурсу, наприклад, з zip-файл.

source: Use ``as_file`` when the Traversable methods (``read_text``, etc) are insufficient and an actual file on the file system is required.
uk: Використовуйте ``as_file``, коли методів Traversable (``read_text`` тощо) недостатньо і потрібен фактичний файл у файловій системі.

source: Open for binary reading the *resource* within *package*.
uk: Відкрити для двійкового читання *ресурс* у *пакеті*.

source: *package* is either a name or a module object which conforms to the ``Package`` requirements. *resource* is the name of the resource to open within *package*; it may not contain path separators and it may not have sub-resources (i.e. it cannot be a directory). This function returns a ``typing.BinaryIO`` instance, a binary I/O stream open for reading.
uk: *package* — це ім’я або об’єкт модуля, який відповідає вимогам ``Package``. *resource* — це ім’я ресурсу, який потрібно відкрити в *пакеті*; він не може містити роздільників шляхів і не мати підресурсів (тобто не може бути каталогом). Ця функція повертає екземпляр ``typing.BinaryIO``, двійковий потік введення/виведення, відкритий для читання.

source: Open for text reading the *resource* within *package*. By default, the resource is opened for reading as UTF-8.
uk: Відкрити для читання тексту *ресурс* у *пакеті*. За замовчуванням ресурс відкрито для читання як UTF-8.

source: *package* is either a name or a module object which conforms to the ``Package`` requirements. *resource* is the name of the resource to open within *package*; it may not contain path separators and it may not have sub-resources (i.e. it cannot be a directory). *encoding* and *errors* have the same meaning as with built-in :func:`open`.
uk: *package* — це ім’я або об’єкт модуля, який відповідає вимогам ``Package``. *resource* — це ім’я ресурсу, який потрібно відкрити в *пакеті*; він не може містити роздільників шляхів і не мати підресурсів (тобто не може бути каталогом). *кодування* та *помилки* мають те саме значення, що й вбудований :func:`open`.

source: This function returns a ``typing.TextIO`` instance, a text I/O stream open for reading.
uk: Ця функція повертає екземпляр ``typing.TextIO``, текстовий потік введення/виведення, відкритий для читання.

source: Read and return the contents of the *resource* within *package* as ``bytes``.
uk: Читати та повертати вміст *ресурсу* в *пакеті* як ``байти``.

source: *package* is either a name or a module object which conforms to the ``Package`` requirements. *resource* is the name of the resource to open within *package*; it may not contain path separators and it may not have sub-resources (i.e. it cannot be a directory). This function returns the contents of the resource as :class:`bytes`.
uk: *package* — це ім’я або об’єкт модуля, який відповідає вимогам ``Package``. *resource* — це ім’я ресурсу, який потрібно відкрити в *пакеті*; він не може містити роздільників шляхів і не мати підресурсів (тобто не може бути каталогом). Ця функція повертає вміст ресурсу як :class:`bytes`.

source: Read and return the contents of *resource* within *package* as a ``str``. By default, the contents are read as strict UTF-8.
uk: Читання та повернення вмісту *ресурсу* в *пакеті* як ``str``. За замовчуванням вміст читається як суворий UTF-8.

source: *package* is either a name or a module object which conforms to the ``Package`` requirements. *resource* is the name of the resource to open within *package*; it may not contain path separators and it may not have sub-resources (i.e. it cannot be a directory). *encoding* and *errors* have the same meaning as with built-in :func:`open`. This function returns the contents of the resource as :class:`str`.
uk: *package* — це ім’я або об’єкт модуля, який відповідає вимогам ``Package``. *resource* — це ім’я ресурсу, який потрібно відкрити в *пакеті*; він не може містити роздільників шляхів і не мати підресурсів (тобто не може бути каталогом). *кодування* та *помилки* мають те саме значення, що й вбудований :func:`open`. Ця функція повертає вміст ресурсу як :class:`str`.

source: Return the path to the *resource* as an actual file system path. This function returns a context manager for use in a :keyword:`with` statement. The context manager provides a :class:`pathlib.Path` object.
uk: Поверніть шлях до *ресурсу* як фактичний шлях до файлової системи. Ця функція повертає менеджер контексту для використання в операторі :keyword:`with`. Менеджер контексту надає об’єкт :class:`pathlib.Path`.

source: Exiting the context manager cleans up any temporary file created when the resource needs to be extracted from e.g. a zip file.
uk: Вихід із контекстного менеджера очищає будь-який тимчасовий файл, створений, коли ресурс потрібно видобути, наприклад, з zip-файл.

source: *package* is either a name or a module object which conforms to the ``Package`` requirements. *resource* is the name of the resource to open within *package*; it may not contain path separators and it may not have sub-resources (i.e. it cannot be a directory).
uk: *package* — це ім’я або об’єкт модуля, який відповідає вимогам ``Package``. *resource* — це ім’я ресурсу, який потрібно відкрити в *пакеті*; він не може містити роздільників шляхів і не мати підресурсів (тобто не може бути каталогом).

source: Return ``True`` if there is a resource named *name* in the package, otherwise ``False``. Remember that directories are *not* resources! *package* is either a name or a module object which conforms to the ``Package`` requirements.
uk: Повертає ``True``, якщо в пакеті є ресурс із назвою *name*, інакше ``False``. Пам'ятайте, що каталоги - це *не* ресурси! *package* — це ім’я або об’єкт модуля, який відповідає вимогам ``Package``.

source: Return an iterable over the named items within the package. The iterable returns :class:`str` resources (e.g. files) and non-resources (e.g. directories). The iterable does not recurse into subdirectories.
uk: Повертає ітерацію над іменованими елементами в пакеті. Ітерація повертає :class:`str` ресурси (наприклад, файли) і нересурси (наприклад, каталоги). Ітерація не повертається до підкаталогів.
