Repository: seanpm2001/python-docs-uk
Catalog: library/math.po
Languages: uk

source: :mod:`math` --- Mathematical functions
uk: :mod:`math` --- Математичні функції

source: This module provides access to the mathematical functions defined by the C standard.
uk: Цей модуль забезпечує доступ до математичних функцій, визначених стандартом C.

source: These functions cannot be used with complex numbers; use the functions of the same name from the :mod:`cmath` module if you require support for complex numbers. The distinction between functions which support complex numbers and those which don't is made since most users do not want to learn quite as much mathematics as required to understand complex numbers. Receiving an exception instead of a complex result allows earlier detection of the unexpected complex number used as a parameter, so that the programmer can determine how and why it was generated in the first place.
uk: Ці функції не можна використовувати з комплексними числами; використовуйте однойменні функції з модуля :mod:`cmath`, якщо вам потрібна підтримка комплексних чисел. Розрізнення між функціями, які підтримують комплексні числа, і тими, які не підтримують, зроблено, оскільки більшість користувачів не хочуть вивчати стільки математики, скільки потрібно для розуміння комплексних чисел. Отримання винятку замість комплексного результату дозволяє раніше виявити неочікуване комплексне число, яке використовується як параметр, щоб програміст міг визначити, як і чому воно взагалі було згенероване.

source: The following functions are provided by this module. Except when explicitly noted otherwise, all return values are floats.
uk: Цей модуль забезпечує такі функції. За винятком випадків, коли явно зазначено інше, усі повернуті значення є числами з плаваючою точкою.

source: Number-theoretic and representation functions
uk: Теоретико-числові функції та функції представлення

source: Return the ceiling of *x*, the smallest integer greater than or equal to *x*. If *x* is not a float, delegates to :meth:`x.__ceil__ <object.__ceil__>`, which should return an :class:`~numbers.Integral` value.
uk: Повертає максимальне значення *x*, найменше ціле число, більше або рівне *x*. Якщо *x* не є числом з плаваючою точкою, делегує :meth:`x.__ceil__ <object.__ceil__>`, який має повернути значення :class:`~numbers.Integral`.

source: Return the number of ways to choose *k* items from *n* items without repetition and without order.
uk: Повертає кількість способів вибору *k* елементів з *n* елементів без повторення та без порядку.

source: Evaluates to ``n! / (k! * (n - k)!)`` when ``k <= n`` and evaluates to zero when ``k > n``.
uk: Оцінюється як ``n! / (k! * (n - k)!)`` коли ``k <= n`` and evaluates to zero when ``k > n``.

source: Raises :exc:`TypeError` if either of the arguments are not integers. Raises :exc:`ValueError` if either of the arguments are negative.
uk: Викликає :exc:`TypeError`, якщо один із аргументів не є цілим числом. Викликає :exc:`ValueError`, якщо будь-який з аргументів негативний.

source: Return a float with the magnitude (absolute value) of *x* but the sign of *y*. On platforms that support signed zeros, ``copysign(1.0, -0.0)`` returns *-1.0*.
uk: Повертає число з плаваючою точкою з величиною (абсолютним значенням) *x*, але зі знаком *y*. На платформах, які підтримують нулі зі знаком, ``copysign(1.0, -0.0)`` повертає *-1.0*.

source: Return the absolute value of *x*.
uk: Повертає абсолютне значення *x*.

source: Accepting floats with integral values (like ``5.0``) is deprecated.
uk: Прийняття числа з плаваючою точкою з цілими значеннями (наприклад, ``5.0``) застаріло.

source: Return the floor of *x*, the largest integer less than or equal to *x*. If *x* is not a float, delegates to :meth:`x.__floor__ <object.__floor__>`, which should return an :class:`~numbers.Integral` value.
uk: Повертає нижню частину *x*, найбільше ціле число, менше або дорівнює *x*. Якщо *x* не є числом з плаваючою точкою, делегує :meth:`x.__floor__ <object.__floor__>`, який має повернути значення :class:`~numbers.Integral`.

source: Return ``fmod(x, y)``, as defined by the platform C library. Note that the Python expression ``x % y`` may not return the same result. The intent of the C standard is that ``fmod(x, y)`` be exactly (mathematically; to infinite precision) equal to ``x - n*y`` for some integer *n* such that the result has the same sign as *x* and magnitude less than ``abs(y)``. Python's ``x % y`` returns a result with the sign of *y* instead, and may not be exactly computable for float arguments. For example, ``fmod(-1e-100, 1e100)`` is ``-1e-100``, but the result of Python's ``-1e-100 % 1e100`` is ``1e100-1e-100``, which cannot be represented exactly as a float, and rounds to the surprising ``1e100``. For this reason, function :func:`fmod` is generally preferred when working with floats, while Python's ``x % y`` is preferred when working with integers.
uk: Повертає ``fmod(x, y)``, як визначено бібліотекою платформи C. Зверніть увагу, що вираз Python ``x % y`` може не повернути той самий результат. Метою стандарту C є те, що ``fmod(x, y)`` точно (математично; з нескінченною точністю) дорівнює ``x - n*y`` для деякого цілого числа *n*, щоб результат мав той самий знак, що й *x*, і величина менша за ``abs(y)``. ``x % y`` Python замість цього повертає результат зі знаком *y* і може бути неточно обчислюваним для аргументів з плаваючою точкою. Наприклад, ``fmod(-1e-100, 1e100)`` є ``-1e-100``, але результатом ``-1e-100 % 1e100`` Python є ``1e100-1e-100``, який не може бути точно представлений як число з плаваючою точкою, і округлюється до несподіваного ``1e100``. З цієї причини функція :func:`fmod` зазвичай є кращою під час роботи з числами з плаваючою точкою, тоді як ``x % y`` Python є кращою під час роботи з цілими числами.

source: Return the mantissa and exponent of *x* as the pair ``(m, e)``. *m* is a float and *e* is an integer such that ``x == m * 2**e`` exactly. If *x* is zero, returns ``(0.0, 0)``, otherwise ``0.5 <= abs(m) < 1``. This is used to "pick apart" the internal representation of a float in a portable way.
uk: Повертає мантису та експонент *x* як пару ``(m, e)``. *m* є числом з плаваючою точкою, а *e* є цілим числом таким чином, що ``x == m * 2**e`` точно. Якщо *x* дорівнює нулю, повертає ``(0,0, 0)``, інакше ``0,5 <= abs(m) < 1``. Це використовується, щоб "розібрати" внутрішнє представлення float переносним способом.

source: Return an accurate floating point sum of values in the iterable. Avoids loss of precision by tracking multiple intermediate partial sums::
uk: Повертає точну суму значень із плаваючою комою в ітеруючому. Уникає втрати точності шляхом відстеження кількох проміжних часткових сум:

source: The algorithm's accuracy depends on IEEE-754 arithmetic guarantees and the typical case where the rounding mode is half-even. On some non-Windows builds, the underlying C library uses extended precision addition and may occasionally double-round an intermediate sum causing it to be off in its least significant bit.
uk: Точність алгоритму залежить від арифметичних гарантій IEEE-754 і типового випадку, коли режим округлення є напівпарним. У деяких збірках, відмінних від Windows, базова бібліотека C використовує розширену точність додавання та іноді може подвоїти округлення проміжної суми, спричиняючи її вимкнення у своєму молодшому розряді.

source: For further discussion and two alternative approaches, see the `ASPN cookbook recipes for accurate floating point summation <https://code.activestate.com/recipes/393090/>`_\.
uk: Для подальшого обговорення та двох альтернативних підходів див. `Рецепти ASPN кулінарної книги для точного підсумовування з плаваючою комою <https://code.activestate.com/recipes/393090/>`_\.

source: Return the greatest common divisor of the specified integer arguments. If any of the arguments is nonzero, then the returned value is the largest positive integer that is a divisor of all arguments. If all arguments are zero, then the returned value is ``0``. ``gcd()`` without arguments returns ``0``.
uk: Повертає найбільший спільний дільник указаних цілих аргументів. Якщо будь-який з аргументів не дорівнює нулю, то повернуте значення є найбільшим натуральним числом, яке є дільником усіх аргументів. Якщо всі аргументи дорівнюють нулю, то повертається значення ``0``. ``gcd()`` без аргументів повертає ``0``.

source: Added support for an arbitrary number of arguments. Formerly, only two arguments were supported.
uk: Додано підтримку довільної кількості аргументів. Раніше підтримувалися лише два аргументи.

source: Return ``True`` if the values *a* and *b* are close to each other and ``False`` otherwise.
uk: Повертає ``True``, якщо значення *a* і *b* близькі одне до одного, і ``False`` в іншому випадку.

source: Whether or not two values are considered close is determined according to given absolute and relative tolerances.
uk: Чи вважаються два значення близькими чи ні, визначається відповідно до заданих абсолютних і відносних допусків.

source: *rel_tol* is the relative tolerance -- it is the maximum allowed difference between *a* and *b*, relative to the larger absolute value of *a* or *b*. For example, to set a tolerance of 5%, pass ``rel_tol=0.05``. The default tolerance is ``1e-09``, which assures that the two values are the same within about 9 decimal digits. *rel_tol* must be greater than zero.
uk: *rel_tol* — це відносний допуск — це максимально допустима різниця між *a* і *b* відносно більшого абсолютного значення *a* або *b*. Наприклад, щоб встановити допуск 5%, передайте ``rel_tol=0,05``. Допуск за замовчуванням — ``1e-09``, який гарантує, що два значення збігаються в межах приблизно 9 десяткових цифр. *rel_tol* має бути більше нуля.

source: *abs_tol* is the minimum absolute tolerance -- useful for comparisons near zero. *abs_tol* must be at least zero.
uk: *abs_tol* — це мінімальний абсолютний допуск — корисний для порівнянь біля нуля. *abs_tol* має бути не менше нуля.

source: If no errors occur, the result will be: ``abs(a-b) <= max(rel_tol * max(abs(a), abs(b)), abs_tol)``.
uk: Якщо помилок не буде, результатом буде: ``abs(a-b) <= max(rel_tol * max(abs(a), abs(b)), abs_tol)``.

source: The IEEE 754 special values of ``NaN``, ``inf``, and ``-inf`` will be handled according to IEEE rules. Specifically, ``NaN`` is not considered close to any other value, including ``NaN``. ``inf`` and ``-inf`` are only considered close to themselves.
uk: Спеціальні значення IEEE 754 ``NaN``, ``inf`` і ``-inf`` оброблятимуться відповідно до правил IEEE. Зокрема, ``NaN`` не вважається близьким до будь-якого іншого значення, включаючи ``NaN``. ``inf`` і ``-inf`` вважаються лише близькими до самих себе.

source: :pep:`485` -- A function for testing approximate equality
uk: :pep:`485` -- Функція для перевірки приблизної рівності

source: Return ``True`` if *x* is neither an infinity nor a NaN, and ``False`` otherwise. (Note that ``0.0`` *is* considered finite.)
uk: Повертає ``True``, якщо *x* не є ні нескінченністю, ні NaN, і ``False`` в іншому випадку. (Зверніть увагу, що ``0.0`` *вважається* кінцевим.)

source: Return ``True`` if *x* is a positive or negative infinity, and ``False`` otherwise.
uk: Повертає ``True``, якщо *x* є додатною або від’ємною нескінченністю, і ``False`` в іншому випадку.

source: Return ``True`` if *x* is a NaN (not a number), and ``False`` otherwise.
uk: Повертає ``True``, якщо *x* є NaN (а не число), і ``False`` в іншому випадку.

source: Return the integer square root of the nonnegative integer *n*. This is the floor of the exact square root of *n*, or equivalently the greatest integer *a* such that *a*\ ² |nbsp| ≤ |nbsp| *n*.
uk: Повертає цілий квадратний корінь із цілого невід’ємного числа *n*. Це нижня частина точного квадратного кореня з *n* або, що еквівалентно, найбільше ціле число *a* таке, що *a*\ ² |nbsp| ≤ |nbsp| *n*.

source: For some applications, it may be more convenient to have the least integer *a* such that *n* |nbsp| ≤ |nbsp| *a*\ ², or in other words the ceiling of the exact square root of *n*. For positive *n*, this can be computed using ``a = 1 + isqrt(n - 1)``.
uk: Для деяких програм може бути зручніше мати найменше ціле *a* таке, що *n* |nbsp| ≤ |nbsp| *a*\ ², або іншими словами, стеля точного квадратного кореня з *n*. Для позитивного *n* це можна обчислити за допомогою ``a = 1 + isqrt(n - 1)``.

source: Return the least common multiple of the specified integer arguments. If all arguments are nonzero, then the returned value is the smallest positive integer that is a multiple of all arguments. If any of the arguments is zero, then the returned value is ``0``. ``lcm()`` without arguments returns ``1``.
uk: Повертає найменше спільне кратне вказаних цілих аргументів. Якщо всі аргументи відмінні від нуля, тоді повертається найменше натуральне число, кратне всім аргументам. Якщо будь-який з аргументів дорівнює нулю, то повертається значення ``0``. ``lcm()`` без аргументів повертає ``1``.

source: Return ``x * (2**i)``. This is essentially the inverse of function :func:`frexp`.
uk: Повернути ``x * (2**i)``. По суті, це зворотна функція :func:`frexp`.

source: Return the fractional and integer parts of *x*. Both results carry the sign of *x* and are floats.
uk: Повертає дробову та цілу частини *x*. Обидва результати мають знак *x* і є числами з плаваючою точкою.

source: Return the next floating-point value after *x* towards *y*.
uk: Повертає наступне значення з плаваючою комою після *x* до *y*.

source: If *x* is equal to *y*, return *y*.
uk: Якщо *x* дорівнює *y*, поверніть *y*.

source: Examples:
uk: приклади:

source: ``math.nextafter(x, math.inf)`` goes up: towards positive infinity.
uk: ``math.nextafter(x, math.inf)`` йде вгору: до позитивної нескінченності.

source: ``math.nextafter(x, -math.inf)`` goes down: towards minus infinity.
uk: ``math.nextafter(x, -math.inf)`` йде вниз: до мінус нескінченності.

source: ``math.nextafter(x, 0.0)`` goes towards zero.
uk: ``math.nextafter(x, 0.0)`` рухається до нуля.

source: ``math.nextafter(x, math.copysign(math.inf, x))`` goes away from zero.
uk: ``math.nextafter(x, math.copysign(math.inf, x))`` відходить від нуля.

source: See also :func:`math.ulp`.
uk: Дивіться також :func:`math.ulp`.

source: Return the number of ways to choose *k* items from *n* items without repetition and with order.
uk: Повернути кількість способів вибору *k* елементів з *n* елементів без повторення та з порядком.

source: Evaluates to ``n! / (n - k)!`` when ``k <= n`` and evaluates to zero when ``k > n``.
uk: Оцінюється як ``n! / (n - k)!`` коли ``k <= n`` and evaluates to zero when ``k > n``.

source: If *k* is not specified or is None, then *k* defaults to *n* and the function returns ``n!``.
uk: Якщо *k* не вказано або має значення None, тоді *k* за замовчуванням має *n*, а функція повертає ``n!``.

source: Calculate the product of all the elements in the input *iterable*. The default *start* value for the product is ``1``.
uk: Обчислити добуток усіх елементів у вхідному *iterable*. Типовим *початковим* значенням для продукту є "1".

source: When the iterable is empty, return the start value. This function is intended specifically for use with numeric values and may reject non-numeric types.
uk: Коли iterable порожній, поверніть початкове значення. Ця функція призначена спеціально для використання з числовими значеннями та може відхиляти нечислові типи.

source: Return the IEEE 754-style remainder of *x* with respect to *y*. For finite *x* and finite nonzero *y*, this is the difference ``x - n*y``, where ``n`` is the closest integer to the exact value of the quotient ``x / y``. If ``x / y`` is exactly halfway between two consecutive integers, the nearest *even* integer is used for ``n``. The remainder ``r = remainder(x, y)`` thus always satisfies ``abs(r) <= 0.5 * abs(y)``.
uk: Повертає залишок *x* у стилі IEEE 754 відносно *y*. Для кінцевого *x* і кінцевого ненульового *y* це різниця ``x - n*y``, де ``n`` є найближчим цілим числом до точного значення частки ``x / y`` . Якщо ``x / y`` знаходиться точно посередині між двома послідовними цілими числами, для ``n`` використовується найближче *парне* ціле число. Таким чином, залишок ``r = залишок(x, y)`` завжди задовольняє ``abs(r) <= 0,5 * abs(y)``.

source: Special cases follow IEEE 754: in particular, ``remainder(x, math.inf)`` is *x* for any finite *x*, and ``remainder(x, 0)`` and ``remainder(math.inf, x)`` raise :exc:`ValueError` for any non-NaN *x*. If the result of the remainder operation is zero, that zero will have the same sign as *x*.
uk: Спеціальні випадки відповідають стандарту IEEE 754: зокрема, ``remainder(x, math.inf)`` є *x* для будь-якого кінцевого *x*, а ``remainder(x, 0)`` і ``remainder(math.inf). inf, x)`` підняти :exc:`ValueError` для будь-якого не-NaN *x*. Якщо результатом операції залишку є нуль, цей нуль матиме той самий знак, що й *x*.

source: On platforms using IEEE 754 binary floating-point, the result of this operation is always exactly representable: no rounding error is introduced.
uk: На платформах, які використовують двійкові числа з плаваючою точкою IEEE 754, результат цієї операції завжди можна точно представити: помилка округлення не виникає.

source: Return *x* with the fractional part removed, leaving the integer part. This rounds toward 0: ``trunc()`` is equivalent to :func:`floor` for positive *x*, and equivalent to :func:`ceil` for negative *x*. If *x* is not a float, delegates to :meth:`x.__trunc__ <object.__trunc__>`, which should return an :class:`~numbers.Integral` value.
uk: Поверніть *x* із видаленням дробової частини, залишаючи цілу частину. Це округляє до 0: ``trunc()`` еквівалентно :func:`floor` для додатного *x* та еквівалентно :func:`ceil` для від’ємного *x*. Якщо *x* не є числом з плаваючою точкою, делегує :meth:`x.__trunc__ <object.__trunc__>`, який має повернути значення :class:`~numbers.Integral`.

source: Return the value of the least significant bit of the float *x*:
uk: Повертає значення молодшого біта числа з плаваючою точкою *x*:

source: If *x* is a NaN (not a number), return *x*.
uk: Якщо *x* є NaN (а не числом), поверніть *x*.

source: If *x* is negative, return ``ulp(-x)``.
uk: Якщо *x* від’ємне, поверніть ``ulp(-x)``.

source: If *x* is a positive infinity, return *x*.
uk: Якщо *x* є позитивною нескінченністю, поверніть *x*.

source: If *x* is equal to zero, return the smallest positive *denormalized* representable float (smaller than the minimum positive *normalized* float, :data:`sys.float_info.min <sys.float_info>`).
uk: Якщо *x* дорівнює нулю, поверніть найменше додатне *деноралізоване* число з плаваючою точкою (менше ніж мінімальне позитивне *нормалізоване* число з плаваючою точкою, :data:`sys.float_info.min <sys.float_info>`).

source: If *x* is equal to the largest positive representable float, return the value of the least significant bit of *x*, such that the first float smaller than *x* is ``x - ulp(x)``.
uk: Якщо *x* дорівнює найбільшому додатному репрезентативному float, поверніть значення молодшого значущого біта *x*, щоб перше число з плаваючою точкою, менше за *x*, було ``x - ulp(x)``.

source: Otherwise (*x* is a positive finite number), return the value of the least significant bit of *x*, such that the first float bigger than *x* is ``x + ulp(x)``.
uk: В іншому випадку (*x* — додатне скінченне число) поверніть значення молодшого біта *x*, щоб перше число з плаваючою речовиною, більше за *x*, було ``x + ulp(x)``.

source: ULP stands for "Unit in the Last Place".
uk: ULP розшифровується як "Unit in the Last Place".

source: See also :func:`math.nextafter` and :data:`sys.float_info.epsilon <sys.float_info>`.
uk: Дивіться також :func:`math.nextafter` і :data:`sys.float_info.epsilon <sys.float_info>`.

source: Note that :func:`frexp` and :func:`modf` have a different call/return pattern than their C equivalents: they take a single argument and return a pair of values, rather than returning their second return value through an 'output parameter' (there is no such thing in Python).
uk: Зауважте, що :func:`frexp` і :func:`modf` мають інший шаблон виклику/повернення, ніж їхні еквіваленти на C: вони беруть один аргумент і повертають пару значень, замість того, щоб повертати друге значення, що повертається через 'вихід параметр" (у Python такого немає).

source: For the :func:`ceil`, :func:`floor`, and :func:`modf` functions, note that *all* floating-point numbers of sufficiently large magnitude are exact integers. Python floats typically carry no more than 53 bits of precision (the same as the platform C double type), in which case any float *x* with ``abs(x) >= 2**52`` necessarily has no fractional bits.
uk: Для функцій :func:`ceil`, :func:`floor` і :func:`modf` зауважте, що *всі* числа з плаваючою комою досить великої величини є точними цілими числами. Python зазвичай містить не більше 53 бітів точності (так само, як і подвійний тип платформи C), у цьому випадку будь-яке число з плаваючою речовиною *x* із ``abs(x) >= 2**52`` обов’язково не має дробових бітів. .

source: Power and logarithmic functions
uk: Степеневі та логарифмічні функції

source: Return *e* raised to the power *x*, where *e* = 2.718281... is the base of natural logarithms. This is usually more accurate than ``math.e ** x`` or ``pow(math.e, x)``.
uk: Поверніть *e* у степені *x*, де *e* = 2,718281... є основою натуральних логарифмів. Зазвичай це точніше, ніж ``math.e ** x`` або ``pow(math.e, x)``.

source: Return *e* raised to the power *x*, minus 1. Here *e* is the base of natural logarithms. For small floats *x*, the subtraction in ``exp(x) - 1`` can result in a `significant loss of precision <https://en.wikipedia.org/wiki/Loss_of_significance>`_\; the :func:`expm1` function provides a way to compute this quantity to full precision::
uk: Поверніть *e* у степені *x*, мінус 1. Тут *e* — основа натуральних логарифмів. Для малих чисел *x* віднімання в ``exp(x) - 1`` може призвести до `значної втрати точності <https://en.wikipedia.org/wiki/Loss_of_significance>`_\; функція :func:`expm1` забезпечує спосіб обчислення цієї величини з повною точністю::

source: With one argument, return the natural logarithm of *x* (to base *e*).
uk: З одним аргументом повертає натуральний логарифм *x* (за основою *e*).

source: With two arguments, return the logarithm of *x* to the given *base*, calculated as ``log(x)/log(base)``.
uk: З двома аргументами повертає логарифм від *x* до заданої *основи*, обчислений як ``log(x)/log(основа)``.

source: Return the natural logarithm of *1+x* (base *e*). The result is calculated in a way which is accurate for *x* near zero.
uk: Повертає натуральний логарифм *1+x* (за основою *e*). Результат обчислюється таким чином, що є точним для *x* біля нуля.

source: Return the base-2 logarithm of *x*. This is usually more accurate than ``log(x, 2)``.
uk: Повертає логарифм *x* за основою 2. Зазвичай це точніше, ніж ``log(x, 2)``.

source: :meth:`int.bit_length` returns the number of bits necessary to represent an integer in binary, excluding the sign and leading zeros.
uk: :meth:`int.bit_length` повертає кількість бітів, необхідну для представлення цілого числа в двійковій формі, за винятком знака та нулів на початку.

source: Return the base-10 logarithm of *x*. This is usually more accurate than ``log(x, 10)``.
uk: Повертає логарифм *x* за основою 10. Зазвичай це точніше, ніж ``log(x, 10)``.

source: Unlike the built-in ``**`` operator, :func:`math.pow` converts both its arguments to type :class:`float`. Use ``**`` or the built-in :func:`pow` function for computing exact integer powers.
uk: На відміну від вбудованого оператора ``**``, :func:`math.pow` перетворює обидва свої аргументи на тип :class:`float`. Використовуйте ``**`` або вбудовану функцію :func:`pow` для обчислення точних цілих степенів.

source: Return the square root of *x*.
uk: Повертає квадратний корінь з *x*.

source: Trigonometric functions
uk: Тригонометричні функції
