Repository: seanpm2001/python-docs-uk
Catalog: library/math.po
Languages: uk

source: Return the arc cosine of *x*, in radians. The result is between ``0`` and ``pi``.
uk: Повертає арккосинус *x* у радіанах. Результат між ``0`` і ``pi``.

source: Return the arc sine of *x*, in radians. The result is between ``-pi/2`` and ``pi/2``.
uk: Повертає арксинус *x* у радіанах. Результат знаходиться між ``-pi/2`` і ``pi/2``.

source: Return the arc tangent of *x*, in radians. The result is between ``-pi/2`` and ``pi/2``.
uk: Повертає арктангенс *x* у радіанах. Результат знаходиться між ``-pi/2`` і ``pi/2``.

source: Return ``atan(y / x)``, in radians. The result is between ``-pi`` and ``pi``. The vector in the plane from the origin to point ``(x, y)`` makes this angle with the positive X axis. The point of :func:`atan2` is that the signs of both inputs are known to it, so it can compute the correct quadrant for the angle. For example, ``atan(1)`` and ``atan2(1, 1)`` are both ``pi/4``, but ``atan2(-1, -1)`` is ``-3*pi/4``.
uk: Повертає ``atan(y / x)``, у радіанах. Результат знаходиться між ``-pi`` і ``pi``. Вектор у площині від початку координат до точки "(x, y)" утворює цей кут із додатною віссю X. Суть :func:`atan2` полягає в тому, що йому відомі знаки обох вхідних даних, тому він може обчислити правильний квадрант для кута. Наприклад, ``atan(1)`` і ``atan2(1, 1)`` обидва є ``pi/4``, але ``atan2(-1, -1)`` є ``-3*pi/4``.

source: Return the cosine of *x* radians.
uk: Повертає косинус *x* радіан.

source: Return the Euclidean distance between two points *p* and *q*, each given as a sequence (or iterable) of coordinates. The two points must have the same dimension.
uk: Повертає евклідову відстань між двома точками *p* і *q*, кожна з яких задана як послідовність (або повторювана) координат. Дві точки повинні мати однаковий розмір.

source: Roughly equivalent to::
uk: Приблизно еквівалентно::

source: Return the Euclidean norm, ``sqrt(sum(x**2 for x in coordinates))``. This is the length of the vector from the origin to the point given by the coordinates.
uk: Повертає евклідову норму, ``sqrt(sum(x**2 для x у координатах))``. Це довжина вектора від початку координат до точки, заданої координатами.

source: For a two dimensional point ``(x, y)``, this is equivalent to computing the hypotenuse of a right triangle using the Pythagorean theorem, ``sqrt(x*x + y*y)``.
uk: Для двовимірної точки ``(x, y)`` це еквівалентно обчисленню гіпотенузи прямокутного трикутника за допомогою теореми Піфагора ``sqrt(x*x + y*y)``.

source: Added support for n-dimensional points. Formerly, only the two dimensional case was supported.
uk: Додано підтримку n-вимірних точок. Раніше підтримувався лише двовимірний випадок.

source: Improved the algorithm's accuracy so that the maximum error is under 1 ulp (unit in the last place). More typically, the result is almost always correctly rounded to within 1/2 ulp.
uk: Покращено точність алгоритму, щоб максимальна помилка була менше 1 ulp (одиниця на останньому місці). Як правило, результат майже завжди правильно округлюється з точністю до 1/2 ulp.

source: Return the sine of *x* radians.
uk: Повернути синус *x* радіан.

source: Return the tangent of *x* radians.
uk: Повертає тангенс *x* радіан.

source: Angular conversion
uk: Кутове перетворення

source: Convert angle *x* from radians to degrees.
uk: Перетворіть кут *x* з радіан на градуси.

source: Convert angle *x* from degrees to radians.
uk: Переведіть кут *x* із градусів у радіани.

source: Hyperbolic functions
uk: Гіперболічні функції

source: `Hyperbolic functions <https://en.wikipedia.org/wiki/Hyperbolic_function>`_ are analogs of trigonometric functions that are based on hyperbolas instead of circles.
uk: `Гіперболічні функції <https://en.wikipedia.org/wiki/Hyperbolic_function>`_ є аналогами тригонометричних функцій, які засновані на гіперболах замість кіл.

source: Return the inverse hyperbolic cosine of *x*.
uk: Повертає арккосинус *x*.

source: Return the inverse hyperbolic sine of *x*.
uk: Повертає гіперболічний арксинус *x*.

source: Return the inverse hyperbolic tangent of *x*.
uk: Повертає гіперболічний обернений тангенс *x*.

source: Return the hyperbolic cosine of *x*.
uk: Повертає гіперболічний косинус *x*.

source: Return the hyperbolic sine of *x*.
uk: Повернути гіперболічний синус *x*.

source: Return the hyperbolic tangent of *x*.
uk: Поверніть гіперболічний тангенс *x*.

source: Special functions
uk: Спеціальні функції

source: Return the `error function <https://en.wikipedia.org/wiki/Error_function>`_ at *x*.
uk: Повертає `функцію помилки <https://en.wikipedia.org/wiki/Error_function>`_ у *x*.

source: Return the complementary error function at *x*. The `complementary error function <https://en.wikipedia.org/wiki/Error_function>`_ is defined as ``1.0 - erf(x)``. It is used for large values of *x* where a subtraction from one would cause a `loss of significance <https://en.wikipedia.org/wiki/Loss_of_significance>`_\.
uk: Повертає функцію додаткової помилки в *x*. `Додаткова функція помилок <https://en.wikipedia.org/wiki/Error_function>`_ визначається як ``1.0 - erf(x)``. Він використовується для великих значень *x*, де віднімання від одиниці спричинило б `втрату значущості <https://en.wikipedia.org/wiki/Loss_of_significance>`_\.

source: Return the `Gamma function <https://en.wikipedia.org/wiki/Gamma_function>`_ at *x*.
uk: Повертає `Гамма-функцію <https://en.wikipedia.org/wiki/Gamma_function>`_ у *x*.

source: Return the natural logarithm of the absolute value of the Gamma function at *x*.
uk: Повертає натуральний логарифм абсолютного значення гамма-функції при *x*.

source: Constants
uk: Константи

source: The mathematical constant *π* = 3.141592..., to available precision.
uk: Математична константа *π* = 3,141592... з доступною точністю.

source: The mathematical constant *e* = 2.718281..., to available precision.
uk: Математична константа *e* = 2,718281... з доступною точністю.

source: The mathematical constant *τ* = 6.283185..., to available precision. Tau is a circle constant equal to 2\ *π*, the ratio of a circle's circumference to its radius. To learn more about Tau, check out Vi Hart's video `Pi is (still) Wrong <https://www.youtube.com/watch?v=jG7vhMMXagQ>`_, and start celebrating `Tau day <https://tauday.com/>`_ by eating twice as much pie!
uk: Математична константа *τ* = 6,283185... з доступною точністю. Tau — постійна величина кола, що дорівнює 2\ *π*, відношенню довжини кола до його радіуса. Щоб дізнатися більше про Тау, перегляньте відео Ві Харт `Пі (все ще) неправильне <https://www.youtube.com/watch?v=jG7vhMMXagQ>`_, і почніть святкувати `День Тау <https://tauday.com/>`_, з’ївши вдвічі більше пирога!

source: A floating-point positive infinity. (For negative infinity, use ``-math.inf``.) Equivalent to the output of ``float('inf')``.
uk: Додатна нескінченність із плаваючою комою. (Для негативної нескінченності використовуйте ``-math.inf``.) Еквівалент виведення ``float('inf')``.

source: A floating-point "not a number" (NaN) value. Equivalent to the output of ``float('nan')``. Due to the requirements of the `IEEE-754 standard <https://en.wikipedia.org/wiki/IEEE_754>`_, ``math.nan`` and ``float('nan')`` are not considered to equal to any other numeric value, including themselves. To check whether a number is a NaN, use the :func:`isnan` function to test for NaNs instead of ``is`` or ``==``. Example::
uk: Значення з плаваючою комою "не число" (NaN). Еквівалент виведення ``float('nan')``. Відповідно до вимог стандарту `IEEE-754 <https://en.wikipedia.org/wiki/IEEE_754>`_, ``math.nan`` і ``float('nan')`` не вважаються рівними будь-якому іншому числовому значенню, включно з ними самими. Щоб перевірити, чи є число NaN, використовуйте функцію :func:`isnan` для перевірки NaN замість ``is`` або ``==``. Приклад::

source: The :mod:`math` module consists mostly of thin wrappers around the platform C math library functions. Behavior in exceptional cases follows Annex F of the C99 standard where appropriate. The current implementation will raise :exc:`ValueError` for invalid operations like ``sqrt(-1.0)`` or ``log(0.0)`` (where C99 Annex F recommends signaling invalid operation or divide-by-zero), and :exc:`OverflowError` for results that overflow (for example, ``exp(1000.0)``). A NaN will not be returned from any of the functions above unless one or more of the input arguments was a NaN; in that case, most functions will return a NaN, but (again following C99 Annex F) there are some exceptions to this rule, for example ``pow(float('nan'), 0.0)`` or ``hypot(float('nan'), float('inf'))``.
uk: Модуль :mod:`math` складається здебільшого з тонких обгорток навколо функцій математичної бібліотеки платформи C. Поведінка у виняткових випадках відповідає додатку F стандарту C99, де це необхідно. Поточна реалізація викличе :exc:`ValueError` для недійсних операцій, таких як ``sqrt(-1.0)`` або ``log(0.0)`` (де C99 Додаток F рекомендує сигналізувати про недійсну операцію або ділення на нуль), і :exc:`OverflowError` для результатів, які переповнюються (наприклад, ``exp(1000.0)``). NaN не буде повернено жодною з наведених вище функцій, якщо один або більше вхідних аргументів не були NaN; у цьому випадку більшість функцій повертатиме NaN, але (знову ж таки відповідно до Додатку F C99) є деякі винятки з цього правила, наприклад ``pow(float('nan'), 0.0)`` або ``hypot(float ('nan'), float('inf'))``.

source: Note that Python makes no effort to distinguish signaling NaNs from quiet NaNs, and behavior for signaling NaNs remains unspecified. Typical behavior is to treat all NaNs as though they were quiet.
uk: Зауважте, що Python не робить жодних зусиль, щоб відрізнити сигнальні NaN від тихих NaN, і поведінка для сигнальних NaN залишається невизначеною. Типовою поведінкою є ставлення до всіх NaN так, ніби вони тихі.

source: Module :mod:`cmath`
uk: Модуль :mod:`cmath`

source: Complex number versions of many of these functions.
uk: Версії комплексних чисел багатьох із цих функцій.
