Repository: seanpm2001/python-docs-uk
Catalog: library/nis.po
Languages: uk

source: :mod:`nis` --- Interface to Sun's NIS (Yellow Pages)
uk: :mod:`nis` --- Інтерфейс до NIS Sun (Жовті сторінки)

source: The :mod:`nis` module is deprecated (see :pep:`PEP 594 <594#nis>` for details).
uk: Модуль :mod:`nis` є застарілим (див. :pep:`PEP 594 <594#nis>` для деталей).

source: The :mod:`nis` module gives a thin wrapper around the NIS library, useful for central administration of several hosts.
uk: Модуль :mod:`nis` забезпечує тонку оболонку бібліотеки NIS, корисну для центрального адміністрування кількох хостів.

source: Because NIS exists only on Unix systems, this module is only available for Unix.
uk: Оскільки NIS існує лише в системах Unix, цей модуль доступний лише для Unix.

source: The :mod:`nis` module defines the following functions:
uk: Модуль :mod:`nis` визначає такі функції:

source: Return the match for *key* in map *mapname*, or raise an error (:exc:`nis.error`) if there is none. Both should be strings, *key* is 8-bit clean. Return value is an arbitrary array of bytes (may contain ``NULL`` and other joys).
uk: Повернути збіг для *key* у карті *mapname* або викликати помилку (:exc:`nis.error`), якщо її немає. Обидва мають бути рядками, *ключ* є 8-бітним чистим. Значення, що повертається, є довільним масивом байтів (може містити ``NULL`` та інші радості).

source: Note that *mapname* is first checked if it is an alias to another name.
uk: Зауважте, що *mapname* спочатку перевіряється, чи є воно псевдонімом іншого імені.

source: The *domain* argument allows overriding the NIS domain used for the lookup. If unspecified, lookup is in the default NIS domain.
uk: Аргумент *domain* дозволяє замінити домен NIS, який використовується для пошуку. Якщо не вказано, пошук виконується в домені NIS за умовчанням.

source: Return a dictionary mapping *key* to *value* such that ``match(key, mapname)==value``. Note that both keys and values of the dictionary are arbitrary arrays of bytes.
uk: Повертає *ключ* словника, який зіставляє *значення* таким чином, що ``match(key, mapname)==value``. Зверніть увагу, що і ключі, і значення словника є довільними масивами байтів.

source: Return a list of all valid maps.
uk: Повернути список усіх дійсних карт.

source: Return the system default NIS domain.
uk: Повернути системний домен NIS за умовчанням.

source: The :mod:`nis` module defines the following exception:
uk: Модуль :mod:`nis` визначає такий виняток:

source: An error raised when a NIS function returns an error code.
uk: Коли функція NIS повертає код помилки, виникає помилка.
