Repository: seanpm2001/python-docs-uk
Catalog: library/pdb.po
Languages: uk

source: :mod:`pdb` --- The Python Debugger
uk: :mod:`pdb` --- Налагоджувач Python

source: **Source code:** :source:`Lib/pdb.py`
uk: **Вихідний код:** :source:`Lib/pdb.py`

source: The module :mod:`pdb` defines an interactive source code debugger for Python programs. It supports setting (conditional) breakpoints and single stepping at the source line level, inspection of stack frames, source code listing, and evaluation of arbitrary Python code in the context of any stack frame. It also supports post-mortem debugging and can be called under program control.
uk: Модуль :mod:`pdb` визначає інтерактивний налагоджувач вихідного коду для програм Python. Він підтримує встановлення (умовних) точок зупину та один крок на рівні вихідного рядка, перевірку фреймів стеку, перелік вихідного коду та оцінку довільного коду Python у контексті будь-якого фрейму стеку. Він також підтримує посмертне налагодження та може бути викликаний під керуванням програми.

source: The debugger is extensible -- it is actually defined as the class :class:`Pdb`. This is currently undocumented but easily understood by reading the source. The extension interface uses the modules :mod:`bdb` and :mod:`cmd`.
uk: Налагоджувач є розширюваним - він фактично визначений як клас :class:`Pdb`. Наразі це незадокументовано, але легко зрозуміти, прочитавши джерело. Інтерфейс розширення використовує модулі :mod:`bdb` і :mod:`cmd`.

source: The debugger's prompt is ``(Pdb)``. Typical usage to run a program under control of the debugger is::
uk: Підказка налагоджувача: ``(Pdb)``. Типове використання для запуску програми під керуванням відладчика:

source: Tab-completion via the :mod:`readline` module is available for commands and command arguments, e.g. the current global and local names are offered as arguments of the ``p`` command.
uk: Завершення табуляції через модуль :mod:`readline` доступне для команд і аргументів команд, напр. поточні глобальні та локальні імена пропонуються як аргументи команди ``p``.

source: :file:`pdb.py` can also be invoked as a script to debug other scripts. For example::
uk: :file:`pdb.py` також можна викликати як сценарій для налагодження інших сценаріїв. Наприклад::

source: When invoked as a script, pdb will automatically enter post-mortem debugging if the program being debugged exits abnormally. After post-mortem debugging (or after normal exit of the program), pdb will restart the program. Automatic restarting preserves pdb's state (such as breakpoints) and in most cases is more useful than quitting the debugger upon program's exit.
uk: Під час виклику як сценарію pdb автоматично ввійде до посмертного налагодження, якщо програма, яка налагоджується, закривається ненормально. Після посмертного налагодження (або після звичайного виходу з програми) pdb перезапустить програму. Автоматичний перезапуск зберігає стан pdb (наприклад, точки зупину) і в більшості випадків є більш корисним, ніж вихід з налагоджувача після виходу з програми.

source: :file:`pdb.py` now accepts a ``-c`` option that executes commands as if given in a :file:`.pdbrc` file, see :ref:`debugger-commands`.
uk: :file:`pdb.py` тепер приймає опцію ``-c``, яка виконує команди так, ніби вони подані у файлі :file:`.pdbrc`, див. :ref:`debugger-commands`.

source: :file:`pdb.py` now accepts a ``-m`` option that execute modules similar to the way ``python3 -m`` does. As with a script, the debugger will pause execution just before the first line of the module.
uk: :file:`pdb.py` тепер приймає параметр ``-m``, який виконує модулі подібно до того, як це робить ``python3 -m``. Як і у випадку зі сценарієм, налагоджувач призупинить виконання безпосередньо перед першим рядком модуля.

source: The typical usage to break into the debugger is to insert::
uk: Типовим використанням для проникнення в налагоджувач є вставка::

source: at the location you want to break into the debugger, and then run the program. You can then step through the code following this statement, and continue running without the debugger using the :pdbcmd:`continue` command.
uk: у місці, куди потрібно зламати налагоджувач, а потім запустіть програму. Потім ви можете покроково виконувати код, який слідує за цією інструкцією, і продовжити роботу без відладчика за допомогою команди :pdbcmd:`continue`.

source: The built-in :func:`breakpoint()`, when called with defaults, can be used instead of ``import pdb; pdb.set_trace()``.
uk: Вбудований :func:`breakpoint()`, коли викликається із значеннями за замовчуванням, можна використовувати замість ``import pdb; pdb.set_trace()``.

source: The typical usage to inspect a crashed program is::
uk: Типове використання для перевірки збійної програми:

source: The module defines the following functions; each enters the debugger in a slightly different way:
uk: Модуль визначає такі функції; кожен входить до відладчика дещо іншим способом:

source: Execute the *statement* (given as a string or a code object) under debugger control. The debugger prompt appears before any code is executed; you can set breakpoints and type :pdbcmd:`continue`, or you can step through the statement using :pdbcmd:`step` or :pdbcmd:`next` (all these commands are explained below). The optional *globals* and *locals* arguments specify the environment in which the code is executed; by default the dictionary of the module :mod:`__main__` is used. (See the explanation of the built-in :func:`exec` or :func:`eval` functions.)
uk: Виконайте *інструкцію* (у вигляді рядка або об’єкта коду) під керуванням налагоджувача. Підказка налагоджувача з'являється перед виконанням будь-якого коду; ви можете встановити точки зупинки та ввести :pdbcmd:`continue` або ви можете покроково виконувати оператор за допомогою :pdbcmd:`step` або :pdbcmd:`next` (усі ці команди пояснюються нижче). Необов'язкові аргументи *globals* і *locals* визначають середовище, в якому виконується код; за замовчуванням використовується словник модуля :mod:`__main__`. (Див. пояснення вбудованих функцій :func:`exec` або :func:`eval`.)

source: Evaluate the *expression* (given as a string or a code object) under debugger control. When :func:`runeval` returns, it returns the value of the expression. Otherwise this function is similar to :func:`run`.
uk: Оцініть *вираз* (у вигляді рядка або об’єкта коду) під керуванням налагоджувача. Коли :func:`runeval` повертає значення виразу. В іншому ця функція схожа на :func:`run`.

source: Call the *function* (a function or method object, not a string) with the given arguments. When :func:`runcall` returns, it returns whatever the function call returned. The debugger prompt appears as soon as the function is entered.
uk: Викличте *функцію* (об’єкт функції чи методу, а не рядок) із заданими аргументами. Коли :func:`runcall` повертає, він повертає те, що повернув виклик функції. Підказка налагоджувача з’являється, щойно вводиться функція.

source: Enter the debugger at the calling stack frame. This is useful to hard-code a breakpoint at a given point in a program, even if the code is not otherwise being debugged (e.g. when an assertion fails). If given, *header* is printed to the console just before debugging begins.
uk: Введіть налагоджувач у кадрі стека викликів. Це корисно для жорсткого кодування точки зупину в певній точці програми, навіть якщо код іншим чином не налагоджується (наприклад, коли твердження не виконується). Якщо задано, *заголовок* друкується на консолі безпосередньо перед початком налагодження.

source: The keyword-only argument *header*.
uk: Лише ключовий аргумент *header*.

source: Enter post-mortem debugging of the given *traceback* object. If no *traceback* is given, it uses the one of the exception that is currently being handled (an exception must be being handled if the default is to be used).
uk: Введіть посмертне налагодження даного об’єкта *traceback*. Якщо *traceback* не надано, використовується виняткова ситуація, яка зараз обробляється (виняток має оброблятися, якщо має використовуватись типове значення).

source: Enter post-mortem debugging of the traceback found in :data:`sys.last_traceback`.
uk: Введіть посмертне налагодження зворотного відстеження, знайденого в :data:`sys.last_traceback`.

source: The ``run*`` functions and :func:`set_trace` are aliases for instantiating the :class:`Pdb` class and calling the method of the same name. If you want to access further features, you have to do this yourself:
uk: Функції ``run*`` і :func:`set_trace` є псевдонімами для створення екземпляра класу :class:`Pdb` і виклику однойменного методу. Якщо ви хочете отримати доступ до інших функцій, ви повинні зробити це самостійно:

source: :class:`Pdb` is the debugger class.
uk: :class:`Pdb` — це клас налагоджувача.

source: The *completekey*, *stdin* and *stdout* arguments are passed to the underlying :class:`cmd.Cmd` class; see the description there.
uk: Аргументи *completekey*, *stdin* і *stdout* передаються базовому класу :class:`cmd.Cmd`; дивіться опис там.

source: The *skip* argument, if given, must be an iterable of glob-style module name patterns. The debugger will not step into frames that originate in a module that matches one of these patterns. [1]_
uk: Аргумент *skip*, якщо він наданий, має бути повторюваним шаблоном імен модулів у стилі glob. Налагоджувач не ввійде в кадри, які походять із модуля, який відповідає одному з цих шаблонів. [1]_

source: By default, Pdb sets a handler for the SIGINT signal (which is sent when the user presses :kbd:`Ctrl-C` on the console) when you give a ``continue`` command. This allows you to break into the debugger again by pressing :kbd:`Ctrl-C`. If you want Pdb not to touch the SIGINT handler, set *nosigint* to true.
uk: За замовчуванням Pdb встановлює обробник для сигналу SIGINT (який надсилається, коли користувач натискає :kbd:`Ctrl-C` на консолі), коли ви даєте команду ``продовжити``. Це дозволить вам знову увійти в налагоджувач, натиснувши :kbd:`Ctrl-C`. Якщо ви хочете, щоб Pdb не торкався обробника SIGINT, установіть для *nosigint* значення true.

source: The *readrc* argument defaults to true and controls whether Pdb will load .pdbrc files from the filesystem.
uk: Аргумент *readrc* за замовчуванням має значення true та визначає, чи буде Pdb завантажувати файли .pdbrc із файлової системи.

source: Example call to enable tracing with *skip*::
uk: Приклад виклику для ввімкнення трасування за допомогою *skip*::

source: Raises an :ref:`auditing event <auditing>` ``pdb.Pdb`` with no arguments.
uk: Викликає :ref:`подію аудиту <auditing>` ``pdb.Pdb`` без аргументів.

source: The *skip* argument.
uk: Аргумент *пропустити*.

source: The *nosigint* argument. Previously, a SIGINT handler was never set by Pdb.
uk: Аргумент *nosigint*. Раніше обробник SIGINT ніколи не встановлювався Pdb.

source: The *readrc* argument.
uk: Аргумент *readrc*.

source: See the documentation for the functions explained above.
uk: Дивіться документацію щодо функцій, описаних вище.

source: Debugger Commands
uk: Команди налагоджувача

source: The commands recognized by the debugger are listed below. Most commands can be abbreviated to one or two letters as indicated; e.g. ``h(elp)`` means that either ``h`` or ``help`` can be used to enter the help command (but not ``he`` or ``hel``, nor ``H`` or ``Help`` or ``HELP``). Arguments to commands must be separated by whitespace (spaces or tabs). Optional arguments are enclosed in square brackets (``[]``) in the command syntax; the square brackets must not be typed. Alternatives in the command syntax are separated by a vertical bar (``|``).
uk: Нижче наведено команди, які розпізнає налагоджувач. Більшість команд можна скоротити до однієї або двох букв, як зазначено; напр. ``h(elp)`` означає, що ``h`` або ``help`` можна використовувати для введення команди довідки (але не ``he`` або ``hel``, ані ``H`` або ``Довідка`` або ``ДОПОМОГА``). Аргументи команд повинні бути розділені пробілами (пробілами або табуляцією). Необов’язкові аргументи в синтаксисі команди беруться у квадратні дужки (``[]``); квадратні дужки не можна вводити. Альтернативи в синтаксисі команди розділені вертикальною рискою (``|``).

source: Entering a blank line repeats the last command entered. Exception: if the last command was a :pdbcmd:`list` command, the next 11 lines are listed.
uk: Введення порожнього рядка повторює останню введену команду. Виняток: якщо останньою командою була команда :pdbcmd:`list`, буде показано наступні 11 рядків.

source: Commands that the debugger doesn't recognize are assumed to be Python statements and are executed in the context of the program being debugged. Python statements can also be prefixed with an exclamation point (``!``). This is a powerful way to inspect the program being debugged; it is even possible to change a variable or call a function. When an exception occurs in such a statement, the exception name is printed but the debugger's state is not changed.
uk: Команди, які не розпізнає налагоджувач, вважаються операторами Python і виконуються в контексті програми, що налагоджується. Інструкції Python також можуть мати префікс знаком оклику (``!``). Це потужний спосіб перевірити програму, яка налагоджується; можна навіть змінити змінну або викликати функцію. Коли в такому операторі виникає виняток, ім’я виключення друкується, але стан налагоджувача не змінюється.

source: The debugger supports :ref:`aliases <debugger-aliases>`. Aliases can have parameters which allows one a certain level of adaptability to the context under examination.
uk: Налагоджувач підтримує :ref:`псевдоніми <debugger-aliases>`. Псевдоніми можуть мати параметри, які дозволяють певний рівень адаптації до досліджуваного контексту.

source: Multiple commands may be entered on a single line, separated by ``;;``. (A single ``;`` is not used as it is the separator for multiple commands in a line that is passed to the Python parser.) No intelligence is applied to separating the commands; the input is split at the first ``;;`` pair, even if it is in the middle of a quoted string. A workaround for strings with double semicolons is to use implicit string concatenation ``';'';'`` or ``";"";"``.
uk: Кілька команд можна ввести в одному рядку, розділених символом ``;;``. (Один символ ``;`` не використовується, оскільки він є роздільником для кількох команд у рядку, який передається синтаксичному аналізатору Python.) Для розділення команд не застосовано жодного розуму; вхідні дані розбиваються на першу пару ``;;``, навіть якщо вона знаходиться в середині рядка в лапках. Обхідним шляхом для рядків із подвійною крапкою з комою є використання неявної конкатенації рядків ``';'';''`` або ``";"";"``.

source: :file:`.pdbrc` can now contain commands that continue debugging, such as :pdbcmd:`continue` or :pdbcmd:`next`. Previously, these commands had no effect.
uk: :file:`.pdbrc` тепер може містити команди, які продовжують налагодження, наприклад :pdbcmd:`continue` або :pdbcmd:`next`. Раніше ці команди не діяли.

source: Without argument, print the list of available commands. With a *command* as argument, print help about that command. ``help pdb`` displays the full documentation (the docstring of the :mod:`pdb` module). Since the *command* argument must be an identifier, ``help exec`` must be entered to get help on the ``!`` command.
uk: Без аргументів вивести список доступних команд. З *командою* як аргументом надрукуйте довідку про цю команду. ``help pdb`` відображає повну документацію (рядок документації модуля :mod:`pdb`). Оскільки аргумент *command* має бути ідентифікатором, необхідно ввести ``help exec``, щоб отримати довідку щодо команди ``!``.

source: Print a stack trace, with the most recent frame at the bottom. An arrow indicates the current frame, which determines the context of most commands.
uk: Надрукуйте трасування стека з останнім кадром унизу. Стрілка вказує на поточний кадр, який визначає контекст більшості команд.

source: Move the current frame *count* (default one) levels down in the stack trace (to a newer frame).
uk: Перемістіть поточний кадр *кількість* (за замовчуванням) на рівні трасування стека (до нового кадру).

source: Move the current frame *count* (default one) levels up in the stack trace (to an older frame).
uk: Перемістити поточний кадр *кількість* (за замовчуванням) вгору в трасуванні стека (до старішого кадру).

source: With a *lineno* argument, set a break there in the current file. With a *function* argument, set a break at the first executable statement within that function. The line number may be prefixed with a filename and a colon, to specify a breakpoint in another file (probably one that hasn't been loaded yet). The file is searched on :data:`sys.path`. Note that each breakpoint is assigned a number to which all the other breakpoint commands refer.
uk: За допомогою аргументу *lineno* встановіть розрив у поточному файлі. За допомогою аргументу *function* установіть перерву в першому виконуваному операторі в цій функції. Номер рядка може мати префікс назви файлу та двокрапки, щоб вказати точку зупину в іншому файлі (ймовірно, ще не завантаженому). Файл шукається за :data:`sys.path`. Зауважте, що кожній точці зупину присвоєно номер, на який посилаються всі інші команди точки зупину.

source: If a second argument is present, it is an expression which must evaluate to true before the breakpoint is honored.
uk: Якщо присутній другий аргумент, це вираз, який повинен отримати значення true перед тим, як буде враховано точку зупину.

source: Without argument, list all breaks, including for each breakpoint, the number of times that breakpoint has been hit, the current ignore count, and the associated condition if any.
uk: Без аргументів, перерахуйте всі розриви, включно з кожною точкою зупину, кількість разів, коли ця точка зупину було досягнуто, поточну кількість ігнорування та пов’язану умову, якщо така є.

source: Temporary breakpoint, which is removed automatically when it is first hit. The arguments are the same as for :pdbcmd:`break`.
uk: Тимчасова контрольна точка, яка видаляється автоматично при першому попаданні. Аргументи такі ж, як і для :pdbcmd:`break`.

source: With a *filename:lineno* argument, clear all the breakpoints at this line. With a space separated list of breakpoint numbers, clear those breakpoints. Without argument, clear all breaks (but first ask confirmation).
uk: За допомогою аргументу *filename:lineno* очистіть усі точки зупину в цьому рядку. За допомогою списку номерів точок зупину, розділених пробілами, очистіть ці точки зупину. Без суперечок очистіть усі розриви (але спочатку запитайте підтвердження).

source: Disable the breakpoints given as a space separated list of breakpoint numbers. Disabling a breakpoint means it cannot cause the program to stop execution, but unlike clearing a breakpoint, it remains in the list of breakpoints and can be (re-)enabled.
uk: Вимкніть точки зупину, надані як список номерів точок зупину, розділених пробілами. Вимкнення точки зупину означає, що це не може призвести до зупинки виконання програми, але на відміну від очищення точки зупину, вона залишається в списку точок зупину та може бути (знову) увімкнена.

source: Enable the breakpoints specified.
uk: Увімкніть вказані точки зупину.

source: Set the ignore count for the given breakpoint number. If count is omitted, the ignore count is set to 0. A breakpoint becomes active when the ignore count is zero. When non-zero, the count is decremented each time the breakpoint is reached and the breakpoint is not disabled and any associated condition evaluates to true.
uk: Встановіть кількість ігнорувань для заданого номера контрольної точки. Якщо лічильник опущено, для лічильника ігнорування встановлюється значення 0. Точка зупину стає активною, коли лічильник ігнорування дорівнює нулю. Якщо значення відмінне від нуля, кількість зменшується щоразу, коли досягається точка зупину, і точка зупину не вимикається, а будь-яка пов’язана умова оцінюється як істинна.

source: Set a new *condition* for the breakpoint, an expression which must evaluate to true before the breakpoint is honored. If *condition* is absent, any existing condition is removed; i.e., the breakpoint is made unconditional.
uk: Встановіть нову *умову* для точки зупину, вираз, який повинен мати значення true, перш ніж точка зупину буде виконана. Якщо *умова* відсутня, усі наявні умови видаляються; тобто точка зупину стає безумовною.

source: Specify a list of commands for breakpoint number *bpnumber*. The commands themselves appear on the following lines. Type a line containing just ``end`` to terminate the commands. An example::
uk: Укажіть список команд для точки зупину з номером *bpnumber*. Самі команди відображаються в наступних рядках. Введіть рядок, що містить лише ``end``, щоб завершити команди. Приклад::

source: To remove all commands from a breakpoint, type ``commands`` and follow it immediately with ``end``; that is, give no commands.
uk: Щоб видалити всі команди з точки зупину, введіть ``commands`` і негайно введіть ``end``; тобто не давати команд.

source: With no *bpnumber* argument, ``commands`` refers to the last breakpoint set.
uk: Без аргументу *bpnumber* ``commands`` посилається на останній набір точок зупину.

source: You can use breakpoint commands to start your program up again. Simply use the :pdbcmd:`continue` command, or :pdbcmd:`step`, or any other command that resumes execution.
uk: Ви можете використовувати команди точки зупинки, щоб знову запустити програму. Просто скористайтеся командою :pdbcmd:`continue` або :pdbcmd:`step` або будь-якою іншою командою, яка відновлює виконання.

source: Specifying any command resuming execution (currently :pdbcmd:`continue`, :pdbcmd:`step`, :pdbcmd:`next`, :pdbcmd:`return`, :pdbcmd:`jump`, :pdbcmd:`quit` and their abbreviations) terminates the command list (as if that command was immediately followed by end). This is because any time you resume execution (even with a simple next or step), you may encounter another breakpoint—which could have its own command list, leading to ambiguities about which list to execute.
uk: Вказівка будь-якої команди, яка продовжує виконання (наразі :pdbcmd:`continue`, :pdbcmd:`step`, :pdbcmd:`next`, :pdbcmd:`return`, :pdbcmd:`jump`, :pdbcmd:`quit` та їхні абревіатури) завершує список команд (так, ніби за цією командою відразу йде end). Це пояснюється тим, що кожного разу, коли ви відновлюєте виконання (навіть із простим наступним або кроком), ви можете зустріти іншу точку зупину, яка може мати власний список команд, що призводить до неоднозначності щодо того, який список виконати.

source: If you use the 'silent' command in the command list, the usual message about stopping at a breakpoint is not printed. This may be desirable for breakpoints that are to print a specific message and then continue. If none of the other commands print anything, you see no sign that the breakpoint was reached.
uk: Якщо ви використовуєте команду "silent" у списку команд, звичайне повідомлення про зупинку на точці зупинки не друкується. Це може бути бажаним для точок зупину, які повинні надрукувати певне повідомлення, а потім продовжити. Якщо жодна з інших команд нічого не друкує, ви не побачите ознак того, що точка зупину досягнута.

source: Execute the current line, stop at the first possible occasion (either in a function that is called or on the next line in the current function).
uk: Виконати поточний рядок, зупинитися при першому можливому випадку (або у функції, яка викликається, або на наступному рядку в поточній функції).
