Repository: seanpm2001/python-docs-uk
Catalog: library/pdb.po
Languages: uk

source: Continue execution until the next line in the current function is reached or it returns. (The difference between :pdbcmd:`next` and :pdbcmd:`step` is that :pdbcmd:`step` stops inside a called function, while :pdbcmd:`next` executes called functions at (nearly) full speed, only stopping at the next line in the current function.)
uk: Продовжуйте виконання, доки не буде досягнуто наступного рядка в поточній функції або вона не повернеться. (Різниця між :pdbcmd:`next` і :pdbcmd:`step` полягає в тому, що :pdbcmd:`step` зупиняється всередині викликаної функції, тоді як :pdbcmd:`next` виконує викликані функції на (майже) повній швидкості, лише зупиняючись у наступному рядку поточної функції.)

source: Without argument, continue execution until the line with a number greater than the current one is reached.
uk: Без аргументів продовжувати виконання, доки не буде досягнуто рядок з номером, більшим за поточний.

source: With a line number, continue execution until a line with a number greater or equal to that is reached. In both cases, also stop when the current frame returns.
uk: З номером рядка продовжуйте виконання, доки не буде досягнуто рядок з номером, більшим або рівним цьому. В обох випадках також зупиніться, коли повернеться поточний кадр.

source: Allow giving an explicit line number.
uk: Дозволяє вказувати явний номер рядка.

source: Continue execution until the current function returns.
uk: Продовжуйте виконання, доки поточна функція не повернеться.

source: Continue execution, only stop when a breakpoint is encountered.
uk: Продовжувати виконання, зупинятися лише тоді, коли зустрічається точка зупину.

source: Set the next line that will be executed. Only available in the bottom-most frame. This lets you jump back and execute code again, or jump forward to skip code that you don't want to run.
uk: Встановіть наступний рядок, який буде виконано. Доступно лише в нижній рамці. Це дає змогу повернутися назад і виконати код знову або перейти вперед, щоб пропустити код, який ви не хочете запускати.

source: It should be noted that not all jumps are allowed -- for instance it is not possible to jump into the middle of a :keyword:`for` loop or out of a :keyword:`finally` clause.
uk: Слід зазначити, що не всі переходи дозволені - наприклад, неможливо перейти в середину циклу :keyword:`for` або з пункту :keyword:`finally`.

source: List source code for the current file. Without arguments, list 11 lines around the current line or continue the previous listing. With ``.`` as argument, list 11 lines around the current line. With one argument, list 11 lines around at that line. With two arguments, list the given range; if the second argument is less than the first, it is interpreted as a count.
uk: Список вихідного коду для поточного файлу. Без аргументів перелічити 11 рядків навколо поточного рядка або продовжити попередній список. З аргументом ``.`` перелічити 11 рядків навколо поточного рядка. З одним аргументом перелічіть 11 рядків навколо цього рядка. З двома аргументами перелічіть заданий діапазон; якщо другий аргумент менший за перший, він інтерпретується як підрахунок.

source: The current line in the current frame is indicated by ``->``. If an exception is being debugged, the line where the exception was originally raised or propagated is indicated by ``>>``, if it differs from the current line.
uk: Поточний рядок у поточному кадрі позначається ``->``. Якщо виняток налагоджується, рядок, де виняток було спочатку викликано або поширено, позначається ``>>``, якщо він відрізняється від поточного рядка.

source: The ``>>`` marker.
uk: Маркер ``>>``.

source: List all source code for the current function or frame. Interesting lines are marked as for :pdbcmd:`list`.
uk: Перерахувати весь вихідний код для поточної функції або кадру. Цікаві рядки позначені як для :pdbcmd:`list`.

source: Print the argument list of the current function.
uk: Вивести список аргументів поточної функції.

source: Evaluate the *expression* in the current context and print its value.
uk: Оцініть *вираз* у поточному контексті та надрукуйте його значення.

source: ``print()`` can also be used, but is not a debugger command --- this executes the Python :func:`print` function.
uk: ``print()`` також можна використовувати, але це не команда відладчика --- вона виконує функцію :func:`print` Python.

source: Like the :pdbcmd:`p` command, except the value of the expression is pretty-printed using the :mod:`pprint` module.
uk: Подібно до команди :pdbcmd:`p`, за винятком того, що значення виразу надруковано за допомогою модуля :mod:`pprint`.

source: Print the type of the *expression*.
uk: Виведіть тип *виразу*.

source: Try to get source code for the given object and display it.
uk: Спробуйте отримати вихідний код даного об'єкта та відобразити його.

source: Display the value of the expression if it changed, each time execution stops in the current frame.
uk: Відображати значення виразу, якщо воно змінилося, кожного разу, коли виконання зупиняється в поточному кадрі.

source: Without expression, list all display expressions for the current frame.
uk: Без виразу, список усіх виразів відображення для поточного кадру.

source: Do not display the expression any more in the current frame. Without expression, clear all display expressions for the current frame.
uk: Більше не відображати вираз у поточному кадрі. Без виразу, очистити всі вирази відображення для поточного кадру.

source: Start an interactive interpreter (using the :mod:`code` module) whose global namespace contains all the (global and local) names found in the current scope.
uk: Запустіть інтерактивний інтерпретатор (за допомогою модуля :mod:`code`), глобальний простір імен якого містить усі (глобальні та локальні) імена, знайдені в поточній області.

source: Create an alias called *name* that executes *command*. The command must *not* be enclosed in quotes. Replaceable parameters can be indicated by ``%1``, ``%2``, and so on, while ``%*`` is replaced by all the parameters. If no command is given, the current alias for *name* is shown. If no arguments are given, all aliases are listed.
uk: Створіть псевдонім під назвою *name*, який виконує *command*. Команда *не* повинна бути взята в лапки. Параметри, які можна замінити, можуть позначатися символами "%1", "%2" тощо, тоді як "%*" замінюється всіма параметрами. Якщо жодної команди не надано, відображається поточний псевдонім для *name*. Якщо аргументи не вказано, перераховуються всі псевдоніми.

source: Aliases may be nested and can contain anything that can be legally typed at the pdb prompt. Note that internal pdb commands *can* be overridden by aliases. Such a command is then hidden until the alias is removed. Aliasing is recursively applied to the first word of the command line; all other words in the line are left alone.
uk: Псевдоніми можуть бути вкладеними та можуть містити будь-що, що можна легально ввести в підказці pdb. Зауважте, що внутрішні команди pdb *можна* замінити псевдонімами. Потім така команда приховується, доки псевдонім не буде видалено. Псевдоніми рекурсивно застосовуються до першого слова командного рядка; всі інші слова в рядку залишаються окремо.

source: As an example, here are two useful aliases (especially when placed in the :file:`.pdbrc` file)::
uk: Як приклад, ось два корисні псевдоніми (особливо якщо їх розміщено у файлі :file:`.pdbrc`):

source: Delete the specified alias.
uk: Видалити вказаний псевдонім.

source: Execute the (one-line) *statement* in the context of the current stack frame. The exclamation point can be omitted unless the first word of the statement resembles a debugger command. To set a global variable, you can prefix the assignment command with a :keyword:`global` statement on the same line, e.g.::
uk: Виконайте (однорядковий) *інструкцію* в контексті поточного кадру стека. Знак оклику можна опустити, якщо перше слово оператора не нагадує команду відладчика. Щоб встановити глобальну змінну, ви можете додати до команди призначення оператор :keyword:`global` у тому самому рядку, наприклад::

source: Restart the debugged Python program. If an argument is supplied, it is split with :mod:`shlex` and the result is used as the new :data:`sys.argv`. History, breakpoints, actions and debugger options are preserved. :pdbcmd:`restart` is an alias for :pdbcmd:`run`.
uk: Перезапустіть налагоджену програму Python. Якщо вказано аргумент, він розділяється за допомогою :mod:`shlex`, а результат використовується як новий :data:`sys.argv`. Історія, точки зупинки, дії та параметри налагоджувача зберігаються. :pdbcmd:`restart` — це псевдонім для :pdbcmd:`run`.

source: Quit from the debugger. The program being executed is aborted.
uk: Вийти з налагоджувача. Програма, що виконується, переривається.

source: Enter a recursive debugger that steps through the code argument (which is an arbitrary expression or statement to be executed in the current environment).
uk: Введіть рекурсивний налагоджувач, який покроково виконує аргумент коду (який є довільним виразом або інструкцією, що виконується в поточному середовищі).

source: Print the return value for the last return of a function.
uk: Надрукувати значення, що повертається для останнього повернення функції.

source: Footnotes
uk: Виноски

source: Whether a frame is considered to originate in a certain module is determined by the ``__name__`` in the frame globals.
uk: Чи вважається, що фрейм походить із певного модуля, визначається ``__name__`` у глобальних параметрах фрейму.
