Repository: seanpm2001/python-docs-uk
Catalog: library/random.po
Languages: uk

source: In the future, the *seed* must be one of the following types: :class:`NoneType`, :class:`int`, :class:`float`, :class:`str`, :class:`bytes`, or :class:`bytearray`.
uk: У майбутньому *seed* має мати один із таких типів: :class:`NoneType`, :class:`int`, :class:`float`, :class:`str`, :class:`bytes` або :class:`bytearray`.

source: Class that uses the :func:`os.urandom` function for generating random numbers from sources provided by the operating system. Not available on all systems. Does not rely on software state, and sequences are not reproducible. Accordingly, the :meth:`seed` method has no effect and is ignored. The :meth:`getstate` and :meth:`setstate` methods raise :exc:`NotImplementedError` if called.
uk: Клас, який використовує функцію :func:`os.urandom` для генерації випадкових чисел із джерел, наданих операційною системою. Доступно не на всіх системах. Не залежить від стану програмного забезпечення, і послідовності не відтворюються. Відповідно, метод :meth:`seed` не має ефекту та ігнорується. Методи :meth:`getstate` і :meth:`setstate` під час виклику викликають :exc:`NotImplementedError`.

source: Notes on Reproducibility
uk: Примітки щодо відтворюваності

source: Sometimes it is useful to be able to reproduce the sequences given by a pseudo-random number generator. By re-using a seed value, the same sequence should be reproducible from run to run as long as multiple threads are not running.
uk: Іноді корисно мати можливість відтворити послідовності, задані генератором псевдовипадкових чисел. Завдяки повторному використанню початкового значення одна і та ж послідовність повинна відтворюватися від прогону до прогону, доки не запущено кілька потоків.

source: Most of the random module's algorithms and seeding functions are subject to change across Python versions, but two aspects are guaranteed not to change:
uk: Більшість алгоритмів і функцій заповнення випадкового модуля можуть змінюватися в різних версіях Python, але два аспекти гарантовано не зміняться:

source: If a new seeding method is added, then a backward compatible seeder will be offered.
uk: Якщо додано новий метод посіву, буде запропоновано зворотно сумісний сівалка.

source: The generator's :meth:`~Random.random` method will continue to produce the same sequence when the compatible seeder is given the same seed.
uk: Метод генератора :meth:`~Random.random` продовжуватиме створювати ту саму послідовність, коли сумісному розсівачу буде надано те саме початкове значення.

source: Examples
uk: Приклади

source: Basic examples::
uk: Основні приклади::

source: Simulations::
uk: Симуляції::

source: Example of `statistical bootstrapping <https://en.wikipedia.org/wiki/Bootstrapping_(statistics)>`_ using resampling with replacement to estimate a confidence interval for the mean of a sample::
uk: Приклад `статистичного завантаження <https://en.wikipedia.org/wiki/Bootstrapping_(statistics)>`_ з використанням повторної вибірки із заміною для оцінки довірчого інтервалу для середнього значення вибірки:

source: Example of a `resampling permutation test <https://en.wikipedia.org/wiki/Resampling_(statistics)#Permutation_tests>`_ to determine the statistical significance or `p-value <https://en.wikipedia.org/wiki/P-value>`_ of an observed difference between the effects of a drug versus a placebo::
uk: Приклад `перестановочного тесту повторної вибірки <https://en.wikipedia.org/wiki/Resampling_(statistics)#Permutation_tests>`_ для визначення статистичної значущості або `p-значення <https://en.wikipedia.org/wiki/P-value>`_ спостережуваної різниці між ефектами препарату та плацебо::

source: Simulation of arrival times and service deliveries for a multiserver queue::
uk: Симуляція часу прибуття та надання послуг для багатосерверної черги::

source: `Statistics for Hackers <https://www.youtube.com/watch?v=Iq9DzN6mvYA>`_ a video tutorial by `Jake Vanderplas <https://us.pycon.org/2016/speaker/profile/295/>`_ on statistical analysis using just a few fundamental concepts including simulation, sampling, shuffling, and cross-validation.
uk: `Statistics for Hackers <https://www.youtube.com/watch?v=Iq9DzN6mvYA>`_ відеоурок від `Jake Vanderplas <https://us.pycon.org/2016/speaker/profile/295/>`_ зі статистичного аналізу з використанням лише кількох фундаментальних концепцій, включаючи моделювання, вибірку, перетасування та перехресну перевірку.

source: Recipes
uk: рецепти

source: The default :func:`.random` returns multiples of 2⁻⁵³ in the range *0.0 ≤ x < 1.0*. All such numbers are evenly spaced and are exactly representable as Python floats. However, many other representable floats in that interval are not possible selections. For example, ``0.05954861408025609`` isn't an integer multiple of 2⁻⁵³.
uk: За умовчанням :func:`.random` повертає кратні 2⁻⁵³ у діапазоні *0,0 ≤ x < 1,0*. Усі такі числа розташовані на рівних інтервалах і точно представлені як плаваючі числа Python. Однак багато інших репрезентованих плаваючих значень у цьому інтервалі не є можливим вибором. Наприклад, ``0,05954861408025609`` не є цілим числом, кратним 2⁻⁵³.

source: The following recipe takes a different approach. All floats in the interval are possible selections. The mantissa comes from a uniform distribution of integers in the range *2⁵² ≤ mantissa < 2⁵³*. The exponent comes from a geometric distribution where exponents smaller than *-53* occur half as often as the next larger exponent.
uk: Наступний рецепт передбачає інший підхід. Усі плаваючі значення в інтервалі є можливими виборами. Мантиса походить від рівномірного розподілу цілих чисел у діапазоні *2⁵² ≤ мантиса < 2⁵³*. Показник степеня походить із геометричного розподілу, де показники степеня, менші за *-53*, зустрічаються вдвічі рідше, ніж наступний більший показник степеня.

source: All :ref:`real valued distributions <real-valued-distributions>` in the class will use the new method::
uk: Усі :ref:`дійсні розподіли <real-valued-distributions>` у класі використовуватимуть новий метод::

source: The recipe is conceptually equivalent to an algorithm that chooses from all the multiples of 2⁻¹⁰⁷⁴ in the range *0.0 ≤ x < 1.0*. All such numbers are evenly spaced, but most have to be rounded down to the nearest representable Python float. (The value 2⁻¹⁰⁷⁴ is the smallest positive unnormalized float and is equal to ``math.ulp(0.0)``.)
uk: Рецепт концептуально еквівалентний алгоритму, який вибирає з усіх кратних 2⁻¹⁰⁷⁴ у діапазоні *0,0 ≤ x < 1,0*. Усі такі числа розташовані рівномірно, але більшість із них має бути округлено до найближчого числа з плаваючою точкою, яке можна представити Python. (Значення 2⁻¹⁰⁷⁴ є найменшим позитивним ненормалізованим числом із плаваючою точкою та дорівнює ``math.ulp(0.0)``.)

source: `Generating Pseudo-random Floating-Point Values <https://allendowney.com/research/rand/downey07randfloat.pdf>`_ a paper by Allen B. Downey describing ways to generate more fine-grained floats than normally generated by :func:`.random`.
uk: `Generating Pseudo-random Floating-Point Values <https://allendowney.com/research/rand/downey07randfloat.pdf>`_ стаття Аллена Б. Дауні, яка описує способи генерації більш дрібнозернистих значень з плаваючою комою, ніж зазвичай генерує :func:`.random`.
