Repository: seanpm2001/python-docs-uk
Catalog: library/random.po
Languages: uk

source: :mod:`random` --- Generate pseudo-random numbers
uk: :mod:`random` --- Генерація псевдовипадкових чисел

source: **Source code:** :source:`Lib/random.py`
uk: **Вихідний код:** :source:`Lib/random.py`

source: This module implements pseudo-random number generators for various distributions.
uk: Цей модуль реалізує генератори псевдовипадкових чисел для різних розподілів.

source: For integers, there is uniform selection from a range. For sequences, there is uniform selection of a random element, a function to generate a random permutation of a list in-place, and a function for random sampling without replacement.
uk: Для цілих чисел існує рівномірний вибір із діапазону. Для послідовностей існує рівномірний вибір випадкового елемента, функція для створення випадкової перестановки списку на місці та функція для випадкової вибірки без заміни.

source: On the real line, there are functions to compute uniform, normal (Gaussian), lognormal, negative exponential, gamma, and beta distributions. For generating distributions of angles, the von Mises distribution is available.
uk: На реальній лінії існують функції для обчислення рівномірного, нормального (гауссового), логарифмічного нормального, від’ємного експоненціального, гамма- та бета-розподілу. Для генерації розподілу кутів доступний розподіл фон Мізеса.

source: Almost all module functions depend on the basic function :func:`.random`, which generates a random float uniformly in the semi-open range [0.0, 1.0). Python uses the Mersenne Twister as the core generator. It produces 53-bit precision floats and has a period of 2\*\*19937-1. The underlying implementation in C is both fast and threadsafe. The Mersenne Twister is one of the most extensively tested random number generators in existence. However, being completely deterministic, it is not suitable for all purposes, and is completely unsuitable for cryptographic purposes.
uk: Майже всі функції модуля залежать від базової функції :func:`.random`, яка рівномірно генерує випадкове число з плаваючою точкою в напіввідкритому діапазоні [0.0, 1.0). Python використовує Mersenne Twister як основний генератор. Він створює 53-розрядні числа з плаваючою точністю та має період 2\*\*19937-1. Базова реалізація в C є одночасно швидкою та потокобезпечною. Mersenne Twister є одним із найбільш протестованих генераторів випадкових чисел. Однак, будучи повністю детермінованим, він не підходить для всіх цілей і зовсім непридатний для криптографічних цілей.

source: The functions supplied by this module are actually bound methods of a hidden instance of the :class:`random.Random` class. You can instantiate your own instances of :class:`Random` to get generators that don't share state.
uk: Функції, які надає цей модуль, насправді є зв’язаними методами прихованого екземпляра класу :class:`random.Random`. Ви можете створити власні екземпляри :class:`Random`, щоб отримати генератори, які не мають спільного стану.

source: Class :class:`Random` can also be subclassed if you want to use a different basic generator of your own devising: in that case, override the :meth:`~Random.random`, :meth:`~Random.seed`, :meth:`~Random.getstate`, and :meth:`~Random.setstate` methods. Optionally, a new generator can supply a :meth:`~Random.getrandbits` method --- this allows :meth:`randrange` to produce selections over an arbitrarily large range.
uk: Клас :class:`Random` також може бути підкласом, якщо ви бажаєте використати інший базовий генератор за власним вигадуванням: у такому випадку замініть :meth:`~Random.random`, :meth:`~Random.seed` , :meth:`~Random.getstate` і :meth:`~Random.setstate` методи. За бажанням новий генератор може надати метод :meth:`~Random.getrandbits` --- це дозволяє :meth:`randrange` виробляти вибірки в довільно великому діапазоні.

source: The :mod:`random` module also provides the :class:`SystemRandom` class which uses the system function :func:`os.urandom` to generate random numbers from sources provided by the operating system.
uk: Модуль :mod:`random` також надає клас :class:`SystemRandom`, який використовує системну функцію :func:`os.urandom` для генерування випадкових чисел із джерел, наданих операційною системою.

source: The pseudo-random generators of this module should not be used for security purposes. For security or cryptographic uses, see the :mod:`secrets` module.
uk: Псевдовипадкові генератори цього модуля не слід використовувати з метою безпеки. Щоб отримати відомості про безпеку чи криптографію, перегляньте модуль :mod:`secrets`.

source: M. Matsumoto and T. Nishimura, "Mersenne Twister: A 623-dimensionally equidistributed uniform pseudorandom number generator", ACM Transactions on Modeling and Computer Simulation Vol. 8, No. 1, January pp.3--30 1998.
uk: M. Matsumoto and T. Nishimura, "Mersenne Twister: 623-dimensionally equidistributed uniform pseudorandom number generator", ACM Transactions on Modeling and Computer Simulation Vol. 8, № 1, січень 3-30 1998.

source: `Complementary-Multiply-with-Carry recipe <https://code.activestate.com/recipes/576707/>`_ for a compatible alternative random number generator with a long period and comparatively simple update operations.
uk: `Рецепт додаткового множення з переносом <https://code.activestate.com/recipes/576707/>`_ для сумісного альтернативного генератора випадкових чисел із тривалим періодом і відносно простими операціями оновлення.

source: Bookkeeping functions
uk: Бухгалтерські функції

source: Initialize the random number generator.
uk: Ініціалізуйте генератор випадкових чисел.

source: If *a* is omitted or ``None``, the current system time is used. If randomness sources are provided by the operating system, they are used instead of the system time (see the :func:`os.urandom` function for details on availability).
uk: Якщо *a* пропущено або ``None``, використовується поточний системний час. Якщо джерела випадковості надаються операційною системою, вони використовуються замість системного часу (дивіться функцію :func:`os.urandom`, щоб дізнатися більше про доступність).

source: If *a* is an int, it is used directly.
uk: Якщо *a* є int, воно використовується безпосередньо.

source: With version 2 (the default), a :class:`str`, :class:`bytes`, or :class:`bytearray` object gets converted to an :class:`int` and all of its bits are used.
uk: У версії 2 (за замовчуванням) об’єкт :class:`str`, :class:`bytes` або :class:`bytearray` перетворюється на :class:`int` і використовуються всі його біти.

source: With version 1 (provided for reproducing random sequences from older versions of Python), the algorithm for :class:`str` and :class:`bytes` generates a narrower range of seeds.
uk: У версії 1 (надається для відтворення випадкових послідовностей зі старих версій Python) алгоритм для :class:`str` і :class:`bytes` генерує вужчий діапазон початкових значень.

source: Moved to the version 2 scheme which uses all of the bits in a string seed.
uk: Перенесено на схему версії 2, яка використовує всі біти початкового рядка.

source: Return an object capturing the current internal state of the generator. This object can be passed to :func:`setstate` to restore the state.
uk: Повертає об’єкт, що фіксує поточний внутрішній стан генератора. Цей об’єкт можна передати :func:`setstate` для відновлення стану.

source: *state* should have been obtained from a previous call to :func:`getstate`, and :func:`setstate` restores the internal state of the generator to what it was at the time :func:`getstate` was called.
uk: *state* мав бути отриманий з попереднього виклику :func:`getstate`, а :func:`setstate` відновлює внутрішній стан генератора до того, яким він був на момент виклику :func:`getstate`.

source: Functions for bytes
uk: Функції для байтів

source: Generate *n* random bytes.
uk: Згенерувати *n* випадкових байтів.

source: This method should not be used for generating security tokens. Use :func:`secrets.token_bytes` instead.
uk: Цей метод не слід використовувати для генерації маркерів безпеки. Натомість використовуйте :func:`secrets.token_bytes`.

source: Functions for integers
uk: Функції для цілих чисел

source: Return a randomly selected element from ``range(start, stop, step)``. This is equivalent to ``choice(range(start, stop, step))``, but doesn't actually build a range object.
uk: Повертає випадково вибраний елемент із ``діапазону (початок, зупинка, крок)``. Це еквівалентно ``choice(range(start, stop, step))``, але фактично не створює об’єкт діапазону.

source: The positional argument pattern matches that of :func:`range`. Keyword arguments should not be used because the function may use them in unexpected ways.
uk: Шаблон позиційного аргументу відповідає шаблону :func:`range`. Не слід використовувати аргументи ключових слів, оскільки функція може використати їх несподіваним чином.

source: :meth:`randrange` is more sophisticated about producing equally distributed values. Formerly it used a style like ``int(random()*n)`` which could produce slightly uneven distributions.
uk: :meth:`randrange` більш складний у створенні рівномірно розподілених значень. Раніше він використовував такий стиль, як ``int(random()*n)``, який міг створити дещо нерівномірний розподіл.

source: The automatic conversion of non-integer types to equivalent integers is deprecated. Currently ``randrange(10.0)`` is losslessly converted to ``randrange(10)``. In the future, this will raise a :exc:`TypeError`.
uk: Автоматичне перетворення нецілих типів на еквівалентні цілі застаріло. Наразі ``randrange(10.0)`` без втрат перетворюється на ``randrange(10)``. У майбутньому це викличе :exc:`TypeError`.

source: The exception raised for non-integral values such as ``randrange(10.5)`` or ``randrange('10')`` will be changed from :exc:`ValueError` to :exc:`TypeError`.
uk: Виняток, створений для нецілісних значень, таких як ``randrange(10.5)`` або ``randrange('10')`` буде змінено з :exc:`ValueError` на :exc:`TypeError`.

source: Return a random integer *N* such that ``a <= N <= b``. Alias for ``randrange(a, b+1)``.
uk: Повертає випадкове ціле число *N* таке, що ``a <= N <= b``. Псевдонім для ``randrange(a, b+1)``.

source: Returns a non-negative Python integer with *k* random bits. This method is supplied with the MersenneTwister generator and some other generators may also provide it as an optional part of the API. When available, :meth:`getrandbits` enables :meth:`randrange` to handle arbitrarily large ranges.
uk: Повертає невід’ємне ціле число Python із *k* випадковими бітами. Цей метод постачається з генератором MersenneTwister, а деякі інші генератори також можуть надавати його як необов’язкову частину API. Якщо доступний, :meth:`getrandbits` дозволяє :meth:`randrange` обробляти довільно великі діапазони.

source: This method now accepts zero for *k*.
uk: Цей метод тепер приймає нуль для *k*.

source: Functions for sequences
uk: Функції для послідовностей

source: Return a random element from the non-empty sequence *seq*. If *seq* is empty, raises :exc:`IndexError`.
uk: Повертає випадковий елемент із непорожньої послідовності *seq*. Якщо *seq* порожній, викликає :exc:`IndexError`.

source: Return a *k* sized list of elements chosen from the *population* with replacement. If the *population* is empty, raises :exc:`IndexError`.
uk: Повертає список елементів розміром *k*, вибраних із *популяції* із заміною. Якщо *популяція* порожня, викликає :exc:`IndexError`.

source: If a *weights* sequence is specified, selections are made according to the relative weights. Alternatively, if a *cum_weights* sequence is given, the selections are made according to the cumulative weights (perhaps computed using :func:`itertools.accumulate`). For example, the relative weights ``[10, 5, 30, 5]`` are equivalent to the cumulative weights ``[10, 15, 45, 50]``. Internally, the relative weights are converted to cumulative weights before making selections, so supplying the cumulative weights saves work.
uk: Якщо вказано послідовність *ваг*, вибір робиться відповідно до відносних ваг. Крім того, якщо вказано послідовність *cum_weights*, вибір робиться відповідно до кумулятивних ваг (можливо, обчислених за допомогою :func:`itertools.accumulate`). Наприклад, відносні ваги ``[10, 5, 30, 5]`` еквівалентні кумулятивним вагам ``[10, 15, 45, 50]``. Внутрішньо відносні ваги перетворюються на кумулятивні ваги перед вибором, тому надання кумулятивних ваг економить роботу.

source: If neither *weights* nor *cum_weights* are specified, selections are made with equal probability. If a weights sequence is supplied, it must be the same length as the *population* sequence. It is a :exc:`TypeError` to specify both *weights* and *cum_weights*.
uk: Якщо ані *weights*, ані *cum_weights* не вказано, вибір робиться з рівною ймовірністю. Якщо надається послідовність ваг, вона має бути такої ж довжини, що й послідовність *населеності*. Це :exc:`TypeError`, якщо вказати *weights* і *cum_weights*.

source: The *weights* or *cum_weights* can use any numeric type that interoperates with the :class:`float` values returned by :func:`random` (that includes integers, floats, and fractions but excludes decimals). Weights are assumed to be non-negative and finite. A :exc:`ValueError` is raised if all weights are zero.
uk: *Weights* або *cum_weights* можуть використовувати будь-який числовий тип, який взаємодіє зі значеннями :class:`float`, які повертає :func:`random` (це включає цілі числа, числа з плаваючою точкою та дроби, але виключає десяткові). Ваги вважаються невід’ємними та кінцевими. Помилка :exc:`ValueError` виникає, якщо всі ваги дорівнюють нулю.

source: For a given seed, the :func:`choices` function with equal weighting typically produces a different sequence than repeated calls to :func:`choice`. The algorithm used by :func:`choices` uses floating point arithmetic for internal consistency and speed. The algorithm used by :func:`choice` defaults to integer arithmetic with repeated selections to avoid small biases from round-off error.
uk: Для певного початкового числа функція :func:`choices` з однаковою вагою зазвичай створює іншу послідовність, ніж повторювані виклики :func:`choice`. Алгоритм, який використовує :func:`choices`, використовує арифметику з плаваючою комою для внутрішньої узгодженості та швидкості. Алгоритм, який використовує :func:`choice`, за замовчуванням використовує цілочисельну арифметику з повторюваними виборами, щоб уникнути невеликих відхилень через помилку округлення.

source: Raises a :exc:`ValueError` if all weights are zero.
uk: Викликає :exc:`ValueError`, якщо всі ваги дорівнюють нулю.

source: Shuffle the sequence *x* in place.
uk: Перемішайте послідовність *x* на місці.

source: To shuffle an immutable sequence and return a new shuffled list, use ``sample(x, k=len(x))`` instead.
uk: Щоб перетасувати незмінну послідовність і повернути новий перетасований список, замість цього використовуйте ``sample(x, k=len(x))``.

source: Note that even for small ``len(x)``, the total number of permutations of *x* can quickly grow larger than the period of most random number generators. This implies that most permutations of a long sequence can never be generated. For example, a sequence of length 2080 is the largest that can fit within the period of the Mersenne Twister random number generator.
uk: Зауважте, що навіть для невеликого ``len(x)`` загальна кількість перестановок *x* може швидко зрости більше, ніж період більшості генераторів випадкових чисел. Це означає, що більшість перестановок довгої послідовності ніколи не можуть бути згенеровані. Наприклад, послідовність довжиною 2080 є найбільшою, яка може поміститися в період генератора випадкових чисел Мерсенна Твістера.

source: The optional parameter *random*.
uk: Додатковий параметр *random*.

source: Returns a new list containing elements from the population while leaving the original population unchanged. The resulting list is in selection order so that all sub-slices will also be valid random samples. This allows raffle winners (the sample) to be partitioned into grand prize and second place winners (the subslices).
uk: Повертає новий список, що містить елементи з сукупності, залишаючи вихідну сукупність без змін. Отриманий список складається в порядку відбору, тому всі підзрізи також будуть дійсними випадковими вибірками. Це дозволяє розділити переможців розіграшу (зразок) на головний приз і переможців, які посідають друге місце (підрозділи).

source: Members of the population need not be :term:`hashable` or unique. If the population contains repeats, then each occurrence is a possible selection in the sample.
uk: Члени сукупності не повинні бути :term:`hashable` або унікальними. Якщо популяція містить повтори, то кожен випадок є можливим вибором у вибірці.

source: Repeated elements can be specified one at a time or with the optional keyword-only *counts* parameter. For example, ``sample(['red', 'blue'], counts=[4, 2], k=5)`` is equivalent to ``sample(['red', 'red', 'red', 'red', 'blue', 'blue'], k=5)``.
uk: Повторювані елементи можна вказувати по одному або за допомогою необов’язкового параметра *counts*, що містить лише ключове слово. Наприклад, ``sample(['red', 'blue'], counts=[4, 2], k=5)`` еквівалентно ``sample(['red', 'red', 'red' , 'червоний', 'синій', 'синій'], k=5)``.

source: To choose a sample from a range of integers, use a :func:`range` object as an argument. This is especially fast and space efficient for sampling from a large population: ``sample(range(10000000), k=60)``.
uk: Щоб вибрати вибірку з діапазону цілих чисел, використовуйте об’єкт :func:`range` як аргумент. Це особливо швидко та ефективно для вибірки з великої сукупності: ``sample(range(10000000), k=60)``.

source: If the sample size is larger than the population size, a :exc:`ValueError` is raised.
uk: Якщо розмір вибірки більший за розмір сукупності, виникає помилка :exc:`ValueError`.

source: Added the *counts* parameter.
uk: Додано параметр *counts*.

source: Real-valued distributions
uk: Дійсні розподіли

source: The following functions generate specific real-valued distributions. Function parameters are named after the corresponding variables in the distribution's equation, as used in common mathematical practice; most of these equations can be found in any statistics text.
uk: Наступні функції генерують конкретні дійсні розподіли. Параметри функції називаються за відповідними змінними в рівнянні розподілу, як це використовується в звичайній математичній практиці; більшість із цих рівнянь можна знайти в будь-якому статистичному тексті.

source: Return the next random floating point number in the range [0.0, 1.0).
uk: Повертає наступне випадкове число з плаваючою комою в діапазоні [0,0, 1,0).

source: Return a random floating point number *N* such that ``a <= N <= b`` for ``a <= b`` and ``b <= N <= a`` for ``b < a``.
uk: Повертає випадкове число з плаваючою комою *N* таке, що ``a <= N <= b`` для ``a <= b`` і ``b <= N <= a`` для ``b < a``.

source: The end-point value ``b`` may or may not be included in the range depending on floating-point rounding in the equation ``a + (b-a) * random()``.
uk: Кінцеве значення ``b`` може або не може бути включено в діапазон залежно від округлення числа з плаваючою комою в рівнянні ``a + (b-a) * random()``.

source: Return a random floating point number *N* such that ``low <= N <= high`` and with the specified *mode* between those bounds. The *low* and *high* bounds default to zero and one. The *mode* argument defaults to the midpoint between the bounds, giving a symmetric distribution.
uk: Повертає випадкове число з плаваючою комою *N* таке, що ``низький <= N <= високий`` і з указаним *режимом* між цими межами. *Низькі* та *високі* межі за умовчанням дорівнюють нулю та одиниці. Аргумент *mode* за замовчуванням дорівнює середній точці між межами, що дає симетричний розподіл.

source: Beta distribution. Conditions on the parameters are ``alpha > 0`` and ``beta > 0``. Returned values range between 0 and 1.
uk: Бета-розповсюдження. Умови параметрів: ``альфа > 0`` і ``бета > 0``. Діапазон повернених значень від 0 до 1.

source: Exponential distribution. *lambd* is 1.0 divided by the desired mean. It should be nonzero. (The parameter would be called "lambda", but that is a reserved word in Python.) Returned values range from 0 to positive infinity if *lambd* is positive, and from negative infinity to 0 if *lambd* is negative.
uk: Експоненціальний розподіл. *lambd* дорівнює 1,0, поділеному на бажане середнє. Воно повинно бути відмінним від нуля. (Параметр мав би назву "лямбда", але це зарезервоване слово в Python.) Повернені значення варіюються від 0 до нескінченності, якщо *lambd* додатне, і від нескінченності до 0, якщо *lambd* є від’ємним.

source: Gamma distribution. (*Not* the gamma function!) Conditions on the parameters are ``alpha > 0`` and ``beta > 0``.
uk: Гамма-розподіл. (*Не* функція гамма!) Умови для параметрів: ``альфа > 0`` і ``бета > 0``.

source: The probability distribution function is::
uk: Функція розподілу ймовірностей:

source: Normal distribution, also called the Gaussian distribution. *mu* is the mean, and *sigma* is the standard deviation. This is slightly faster than the :func:`normalvariate` function defined below.
uk: Нормальний розподіл, також званий розподілом Гауса. *mu* — середнє, а *sigma* — стандартне відхилення. Це трохи швидше, ніж функція :func:`normalvariate`, визначена нижче.

source: Multithreading note: When two threads call this function simultaneously, it is possible that they will receive the same return value. This can be avoided in three ways. 1) Have each thread use a different instance of the random number generator. 2) Put locks around all calls. 3) Use the slower, but thread-safe :func:`normalvariate` function instead.
uk: Примітка щодо багатопоточності: коли два потоки викликають цю функцію одночасно, можливо, вони отримають однакове повернуте значення. Цього можна уникнути трьома способами. 1) Нехай кожен потік використовує окремий екземпляр генератора випадкових чисел. 2) Заблокуйте всі дзвінки. 3) Натомість використовуйте повільнішу, але потокобезпечну функцію :func:`normalvariate`.

source: Log normal distribution. If you take the natural logarithm of this distribution, you'll get a normal distribution with mean *mu* and standard deviation *sigma*. *mu* can have any value, and *sigma* must be greater than zero.
uk: Лог нормального розподілу. Якщо взяти натуральний логарифм цього розподілу, ви отримаєте нормальний розподіл із середнім *mu* і стандартним відхиленням *sigma*. *mu* може мати будь-яке значення, а *sigma* має бути більше нуля.

source: Normal distribution. *mu* is the mean, and *sigma* is the standard deviation.
uk: Нормальний розподіл. *mu* — середнє, а *sigma* — стандартне відхилення.

source: *mu* is the mean angle, expressed in radians between 0 and 2\*\ *pi*, and *kappa* is the concentration parameter, which must be greater than or equal to zero. If *kappa* is equal to zero, this distribution reduces to a uniform random angle over the range 0 to 2\*\ *pi*.
uk: *mu* — середній кут, виражений у радіанах між 0 і 2\*\ *pi*, а *kappa* — параметр концентрації, який має бути більшим або дорівнювати нулю. Якщо *kappa* дорівнює нулю, цей розподіл зменшується до рівномірного випадкового кута в діапазоні від 0 до 2\*\ *pi*.

source: Pareto distribution. *alpha* is the shape parameter.
uk: Розподіл Парето. *альфа* — це параметр форми.

source: Weibull distribution. *alpha* is the scale parameter and *beta* is the shape parameter.
uk: Розподіл Вейбулла. *альфа* — параметр масштабу, а *бета* — параметр форми.

source: Alternative Generator
uk: Альтернативний генератор

source: Class that implements the default pseudo-random number generator used by the :mod:`random` module.
uk: Клас, який реалізує генератор псевдовипадкових чисел за замовчуванням, який використовується модулем :mod:`random`.
