Repository: seanpm2001/python-docs-uk
Catalog: library/statistics.po
Languages: uk

source: Return the sample variance of *data*, an iterable of at least two real-valued numbers. Variance, or second moment about the mean, is a measure of the variability (spread or dispersion) of data. A large variance indicates that the data is spread out; a small variance indicates it is clustered closely around the mean.
uk: Повертає вибіркову дисперсію *data*, повторюваного принаймні двох дійсних чисел. Дисперсія, або другий момент відносно середнього, є мірою мінливості (розкиду або дисперсії) даних. Велика дисперсія вказує на те, що дані розкидані; невелика дисперсія вказує на те, що вона щільно згрупована навколо середнього значення.

source: If the optional second argument *xbar* is given, it should be the mean of *data*. If it is missing or ``None`` (the default), the mean is automatically calculated.
uk: Якщо задано необов’язковий другий аргумент *xbar*, це має бути середнє значення *data*. Якщо воно відсутнє або ``None`` (за замовчуванням), середнє значення обчислюється автоматично.

source: Use this function when your data is a sample from a population. To calculate the variance from the entire population, see :func:`pvariance`.
uk: Використовуйте цю функцію, якщо ваші дані є вибіркою із генеральної сукупності. Щоб обчислити дисперсію для всієї сукупності, перегляньте :func:`pvariance`.

source: Raises :exc:`StatisticsError` if *data* has fewer than two values.
uk: Викликає :exc:`StatisticsError`, якщо *data* має менше двох значень.

source: If you have already calculated the mean of your data, you can pass it as the optional second argument *xbar* to avoid recalculation:
uk: Якщо ви вже обчислили середнє значення ваших даних, ви можете передати його як необов’язковий другий аргумент *xbar*, щоб уникнути повторного обчислення:

source: This function does not attempt to verify that you have passed the actual mean as *xbar*. Using arbitrary values for *xbar* can lead to invalid or impossible results.
uk: Ця функція не намагається перевірити, що ви передали фактичне середнє як *xbar*. Використання довільних значень для *xbar* може призвести до недійсних або неможливих результатів.

source: Decimal and Fraction values are supported:
uk: Підтримуються десяткові та дробові значення:

source: This is the sample variance s² with Bessel's correction, also known as variance with N-1 degrees of freedom. Provided that the data points are representative (e.g. independent and identically distributed), the result should be an unbiased estimate of the true population variance.
uk: Це вибіркова дисперсія s² з поправкою Бесселя, також відома як дисперсія з N-1 ступенями свободи. За умови, що точки даних є репрезентативними (наприклад, незалежними та однаково розподіленими), результат має бути неупередженою оцінкою справжньої дисперсії сукупності.

source: If you somehow know the actual population mean μ you should pass it to the :func:`pvariance` function as the *mu* parameter to get the variance of a sample.
uk: Якщо ви якимось чином знаєте фактичне середнє значення μ, ви повинні передати його функції :func:`pvariance` як параметр *mu*, щоб отримати дисперсію вибірки.

source: Divide *data* into *n* continuous intervals with equal probability. Returns a list of ``n - 1`` cut points separating the intervals.
uk: Розділіть *дані* на *n* безперервних інтервалів з рівною ймовірністю. Повертає список ``n - 1`` точок розрізу, що розділяють інтервали.

source: Set *n* to 4 for quartiles (the default). Set *n* to 10 for deciles. Set *n* to 100 for percentiles which gives the 99 cuts points that separate *data* into 100 equal sized groups. Raises :exc:`StatisticsError` if *n* is not least 1.
uk: Встановіть *n* на 4 для квартилів (за замовчуванням). Встановіть *n* на 10 для децилів. Встановіть *n* на 100 для процентилів, що дає 99 точок розрізу, які розділяють *дані* на 100 груп однакового розміру. Викликає :exc:`StatisticsError`, якщо *n* не менше 1.

source: The *data* can be any iterable containing sample data. For meaningful results, the number of data points in *data* should be larger than *n*. Raises :exc:`StatisticsError` if there are not at least two data points.
uk: *data* може бути будь-яким iterable, що містить вибіркові дані. Для значущих результатів кількість точок даних у *data* має бути більшою за *n*. Викликає :exc:`StatisticsError`, якщо немає принаймні двох точок даних.

source: The cut points are linearly interpolated from the two nearest data points. For example, if a cut point falls one-third of the distance between two sample values, ``100`` and ``112``, the cut-point will evaluate to ``104``.
uk: Точки розрізу лінійно інтерполюються з двох найближчих точок даних. Наприклад, якщо точка зрізу падає на одну третину відстані між двома значеннями вибірки, ``100`` і ``112``, точка зрізу буде оцінена як ``104``.

source: The *method* for computing quantiles can be varied depending on whether the *data* includes or excludes the lowest and highest possible values from the population.
uk: *Метод* для обчислення квантилів може варіюватися залежно від того, чи *дані* включають чи виключають найнижчі та найвищі можливі значення з сукупності.

source: The default *method* is "exclusive" and is used for data sampled from a population that can have more extreme values than found in the samples. The portion of the population falling below the *i-th* of *m* sorted data points is computed as ``i / (m + 1)``. Given nine sample values, the method sorts them and assigns the following percentiles: 10%, 20%, 30%, 40%, 50%, 60%, 70%, 80%, 90%.
uk: *Метод* за замовчуванням є "ексклюзивним" і використовується для даних, відібраних із сукупності, яка може мати більш екстремальні значення, ніж у вибірках. Частка генеральної сукупності, яка знаходиться нижче *i-ї* з *m* відсортованих точок даних, обчислюється як ``i / (m + 1)``. Маючи дев’ять значень вибірки, метод сортує їх і призначає наступні процентилі: 10%, 20%, 30%, 40%, 50%, 60%, 70%, 80%, 90%.

source: Setting the *method* to "inclusive" is used for describing population data or for samples that are known to include the most extreme values from the population. The minimum value in *data* is treated as the 0th percentile and the maximum value is treated as the 100th percentile. The portion of the population falling below the *i-th* of *m* sorted data points is computed as ``(i - 1) / (m - 1)``. Given 11 sample values, the method sorts them and assigns the following percentiles: 0%, 10%, 20%, 30%, 40%, 50%, 60%, 70%, 80%, 90%, 100%.
uk: Встановлення *методу* на "включно" використовується для опису даних сукупності або для вибірок, які, як відомо, включають найбільш екстремальні значення сукупності. Мінімальне значення в *даних* розглядається як 0-й процентиль, а максимальне значення розглядається як 100-й процентиль. Частка генеральної сукупності, що опускається нижче *i-ї* з *m* відсортованих точок даних, обчислюється як ``(i - 1) / (m - 1)``. Враховуючи 11 значень вибірки, метод сортує їх і призначає наступні процентилі: 0%, 10%, 20%, 30%, 40%, 50%, 60%, 70%, 80%, 90%, 100%.

source: Return the sample covariance of two inputs *x* and *y*. Covariance is a measure of the joint variability of two inputs.
uk: Повертає зразкову коваріацію двох вхідних даних *x* і *y*. Коваріація є мірою спільної мінливості двох вхідних даних.

source: Both inputs must be of the same length (no less than two), otherwise :exc:`StatisticsError` is raised.
uk: Обидва входи мають бути однакової довжини (не менше двох), інакше виникає :exc:`StatisticsError`.

source: Return the `Pearson's correlation coefficient <https://en.wikipedia.org/wiki/Pearson_correlation_coefficient>`_ for two inputs. Pearson's correlation coefficient *r* takes values between -1 and +1. It measures the strength and direction of the linear relationship, where +1 means very strong, positive linear relationship, -1 very strong, negative linear relationship, and 0 no linear relationship.
uk: Повертає `коефіцієнт кореляції Пірсона <https://en.wikipedia.org/wiki/Pearson_correlation_coefficient>`_ для двох вхідних даних. Коефіцієнт кореляції Пірсона *r* приймає значення від -1 до +1. Він вимірює силу та напрямок лінійного зв’язку, де +1 означає дуже сильний, позитивний лінійний зв’язок, -1 – дуже сильний, негативний лінійний зв’язок, а 0 – відсутність лінійного зв’язку.

source: Both inputs must be of the same length (no less than two), and need not to be constant, otherwise :exc:`StatisticsError` is raised.
uk: Обидва вхідні дані мають бути однакової довжини (не менше двох) і не повинні бути постійними, інакше виникає :exc:`StatisticsError`.

source: Return the slope and intercept of `simple linear regression <https://en.wikipedia.org/wiki/Simple_linear_regression>`_ parameters estimated using ordinary least squares. Simple linear regression describes the relationship between an independent variable *x* and a dependent variable *y* in terms of this linear function:
uk: Повертає нахил і відрізок параметрів `простої лінійної регресії <https://en.wikipedia.org/wiki/Simple_linear_regression>`_, оцінених за допомогою звичайних методів найменших квадратів. Проста лінійна регресія описує зв’язок між незалежною змінною *x* і залежною змінною *y* в термінах цієї лінійної функції:

source: *y = slope \* x + intercept + noise*
uk: *y = нахил \* x + перехоплення + шум*

source: where ``slope`` and ``intercept`` are the regression parameters that are estimated, and ``noise`` represents the variability of the data that was not explained by the linear regression (it is equal to the difference between predicted and actual values of the dependent variable).
uk: де ``нахил`` і ``перетин`` є параметрами регресії, які оцінюються, а ``шум`` представляє мінливість даних, яка не була пояснена лінійною регресією (він дорівнює різниці між прогнозованим і фактичні значення залежної змінної).

source: Both inputs must be of the same length (no less than two), and the independent variable *x* cannot be constant; otherwise a :exc:`StatisticsError` is raised.
uk: Обидва входи повинні мати однакову довжину (не менше двох), а незалежна змінна *x* не може бути постійною; інакше виникає :exc:`StatisticsError`.

source: For example, we can use the `release dates of the Monty Python films <https://en.wikipedia.org/wiki/Monty_Python#Films>`_ to predict the cumulative number of Monty Python films that would have been produced by 2019 assuming that they had kept the pace.
uk: Наприклад, ми можемо використати `дати виходу фільмів Монті Пайтона <https://en.wikipedia.org/wiki/Monty_Python#Films>`_, щоб передбачити загальну кількість фільмів Монті Пайтона, які були б створені до 2019 року, якщо припустити, що вони тримали темп.

source: Exceptions
uk: Винятки

source: A single exception is defined:
uk: Визначено єдиний виняток:

source: Subclass of :exc:`ValueError` for statistics-related exceptions.
uk: Підклас :exc:`ValueError` для винятків, пов’язаних зі статистикою.

source: :class:`NormalDist` objects
uk: :class:`NormalDist` об’єкти

source: :class:`NormalDist` is a tool for creating and manipulating normal distributions of a `random variable <http://www.stat.yale.edu/Courses/1997-98/101/ranvar.htm>`_. It is a class that treats the mean and standard deviation of data measurements as a single entity.
uk: :class:`NormalDist` — це інструмент для створення та керування нормальними розподілами `випадкової змінної <http://www.stat.yale.edu/Courses/1997-98/101/ranvar.htm>`_. Це клас, який розглядає середнє значення та стандартне відхилення вимірювань даних як єдине ціле.

source: Normal distributions arise from the `Central Limit Theorem <https://en.wikipedia.org/wiki/Central_limit_theorem>`_ and have a wide range of applications in statistics.
uk: Нормальні розподіли випливають із `Центральної граничної теореми <https://en.wikipedia.org/wiki/Central_limit_theorem>`_ і мають широкий спектр застосувань у статистиці.

source: Returns a new *NormalDist* object where *mu* represents the `arithmetic mean <https://en.wikipedia.org/wiki/Arithmetic_mean>`_ and *sigma* represents the `standard deviation <https://en.wikipedia.org/wiki/Standard_deviation>`_.
uk: Повертає новий об’єкт *NormalDist*, де *mu* представляє `середнє арифметичне <https://en.wikipedia.org/wiki/Arithmetic_mean>`_, а *sigma* являє собою `стандартне відхилення <https://en.wikipedia.org/wiki/Standard_deviation>`_.

source: If *sigma* is negative, raises :exc:`StatisticsError`.
uk: Якщо *сигма* від'ємна, викликає :exc:`StatisticsError`.

source: A read-only property for the `arithmetic mean <https://en.wikipedia.org/wiki/Arithmetic_mean>`_ of a normal distribution.
uk: Властивість лише для читання для `середнього арифметичного <https://en.wikipedia.org/wiki/Arithmetic_mean>`_ нормального розподілу.

source: A read-only property for the `median <https://en.wikipedia.org/wiki/Median>`_ of a normal distribution.
uk: Властивість лише для читання для `медіани <https://en.wikipedia.org/wiki/Median>`_ нормального розподілу.

source: A read-only property for the `mode <https://en.wikipedia.org/wiki/Mode_(statistics)>`_ of a normal distribution.
uk: Властивість лише для читання для `mode <https://en.wikipedia.org/wiki/Mode_(statistics)>`_ нормального розподілу.

source: A read-only property for the `standard deviation <https://en.wikipedia.org/wiki/Standard_deviation>`_ of a normal distribution.
uk: Властивість лише для читання для `стандартного відхилення <https://en.wikipedia.org/wiki/Standard_deviation>`_ нормального розподілу.

source: A read-only property for the `variance <https://en.wikipedia.org/wiki/Variance>`_ of a normal distribution. Equal to the square of the standard deviation.
uk: Властивість лише для читання для `variance <https://en.wikipedia.org/wiki/Variance>`_ нормального розподілу. Дорівнює квадрату стандартного відхилення.

source: Makes a normal distribution instance with *mu* and *sigma* parameters estimated from the *data* using :func:`fmean` and :func:`stdev`.
uk: Створює звичайний екземпляр розподілу з параметрами *mu* і *sigma*, оціненими з *data* за допомогою :func:`fmean` і :func:`stdev`.

source: The *data* can be any :term:`iterable` and should consist of values that can be converted to type :class:`float`. If *data* does not contain at least two elements, raises :exc:`StatisticsError` because it takes at least one point to estimate a central value and at least two points to estimate dispersion.
uk: *Data* може бути будь-яким :term:`iterable` і має складатися зі значень, які можна перетворити на тип :class:`float`. Якщо *data* не містить принаймні двох елементів, виникає :exc:`StatisticsError`, оскільки для оцінки центрального значення потрібна принаймні одна точка, а для оцінки дисперсії — принаймні дві точки.

source: Generates *n* random samples for a given mean and standard deviation. Returns a :class:`list` of :class:`float` values.
uk: Генерує *n* випадкових вибірок для заданого середнього значення та стандартного відхилення. Повертає :class:`list` значень :class:`float`.

source: If *seed* is given, creates a new instance of the underlying random number generator. This is useful for creating reproducible results, even in a multi-threading context.
uk: Якщо задано *seed*, створюється новий екземпляр основного генератора випадкових чисел. Це корисно для створення відтворюваних результатів, навіть у багатопоточному контексті.

source: Using a `probability density function (pdf) <https://en.wikipedia.org/wiki/Probability_density_function>`_, compute the relative likelihood that a random variable *X* will be near the given value *x*. Mathematically, it is the limit of the ratio ``P(x <= X < x+dx) / dx`` as *dx* approaches zero.
uk: Використовуючи `функцію щільності ймовірності (pdf) <https://en.wikipedia.org/wiki/Probability_density_function>`_, обчисліть відносну ймовірність того, що випадкова змінна *X* буде близько заданого значення *x*. Математично, це межа відношення ``P(x <= X < x+dx) / dx``, коли *dx* наближається до нуля.

source: Using a `cumulative distribution function (cdf) <https://en.wikipedia.org/wiki/Cumulative_distribution_function>`_, compute the probability that a random variable *X* will be less than or equal to *x*. Mathematically, it is written ``P(X <= x)``.
uk: Використовуючи `кумулятивну функцію розподілу (cdf) <https://en.wikipedia.org/wiki/Cumulative_distribution_function>`_, обчисліть імовірність того, що випадкова змінна *X* буде меншою або дорівнює *x*. Математично це пишеться як ``P(X <= x)``.

source: Finds the value *x* of the random variable *X* such that the probability of the variable being less than or equal to that value equals the given probability *p*.
uk: Знаходить таке значення *x* випадкової змінної *X*, що ймовірність того, що змінна буде меншою або дорівнює цьому значенню, дорівнює заданій ймовірності *p*.

source: Measures the agreement between two normal probability distributions. Returns a value between 0.0 and 1.0 giving `the overlapping area for the two probability density functions <https://www.rasch.org/rmt/rmt101r.htm>`_.
uk: Вимірює узгодженість між двома нормальними розподілами ймовірностей. Повертає значення від 0,0 до 1,0, що дає `область перекриття для двох функцій щільності ймовірності <https://www.rasch.org/rmt/rmt101r.htm>`_.

source: Divide the normal distribution into *n* continuous intervals with equal probability. Returns a list of (n - 1) cut points separating the intervals.
uk: Розділіть нормальний розподіл на *n* безперервних інтервалів з рівною ймовірністю. Повертає список (n - 1) точок розрізу, що розділяють інтервали.

source: Set *n* to 4 for quartiles (the default). Set *n* to 10 for deciles. Set *n* to 100 for percentiles which gives the 99 cuts points that separate the normal distribution into 100 equal sized groups.
uk: Встановіть *n* на 4 для квартилів (за замовчуванням). Встановіть *n* на 10 для децилів. Встановіть *n* на 100 для процентилів, що дає 99 точок розсічення, які поділяють нормальний розподіл на 100 груп однакового розміру.

source: Compute the `Standard Score <https://www.statisticshowto.com/probability-and-statistics/z-score/>`_ describing *x* in terms of the number of standard deviations above or below the mean of the normal distribution: ``(x - mean) / stdev``.
uk: Обчисліть `Стандартну оцінку <https://www.statisticshowto.com/probability-and-statistics/z-score/>`_, що описує *x* у термінах кількості стандартних відхилень вище або нижче середнього нормального розподілу: ``(x - середнє) / стандартне відхилення``.

source: Instances of :class:`NormalDist` support addition, subtraction, multiplication and division by a constant. These operations are used for translation and scaling. For example:
uk: Екземпляри :class:`NormalDist` підтримують додавання, віднімання, множення та ділення на константу. Ці операції використовуються для перекладу та масштабування. Наприклад:

source: Dividing a constant by an instance of :class:`NormalDist` is not supported because the result wouldn't be normally distributed.
uk: Ділення константи на екземпляр :class:`NormalDist` не підтримується, оскільки результат не розподілятиметься нормально.

source: Since normal distributions arise from additive effects of independent variables, it is possible to `add and subtract two independent normally distributed random variables <https://en.wikipedia.org/wiki/Sum_of_normally_distributed_random_variables>`_ represented as instances of :class:`NormalDist`. For example:
uk: Оскільки нормальний розподіл виникає внаслідок адитивних ефектів незалежних змінних, можна `додавати та віднімати дві незалежні нормально розподілені випадкові змінні <https://en.wikipedia.org/wiki/Sum_of_normally_distributed_random_variables>`_, представлені як екземпляри :class:`NormalDist`. Наприклад:

source: :class:`NormalDist` Examples and Recipes
uk: :class:`NormalDist` Приклади та рецепти

source: :class:`NormalDist` readily solves classic probability problems.
uk: :class:`NormalDist` легко вирішує класичні ймовірнісні проблеми.

source: For example, given `historical data for SAT exams <https://nces.ed.gov/programs/digest/d17/tables/dt17_226.40.asp>`_ showing that scores are normally distributed with a mean of 1060 and a standard deviation of 195, determine the percentage of students with test scores between 1100 and 1200, after rounding to the nearest whole number:
uk: Наприклад, враховуючи `історичні дані для іспитів SAT <https://nces.ed.gov/programs/digest/d17/tables/dt17_226.40.asp>`_, які показують, що бали зазвичай розподіляються із середнім значенням 1060 і стандартним відхиленням 195, визначте відсоток студентів із тестовими балами між 1100 і 1200 після округлення до найближчого цілого номер:

source: Find the `quartiles <https://en.wikipedia.org/wiki/Quartile>`_ and `deciles <https://en.wikipedia.org/wiki/Decile>`_ for the SAT scores:
uk: Знайдіть `квартилі <https://en.wikipedia.org/wiki/Quartile>`_ і `децилі <https://en.wikipedia.org/wiki/Decile>`_ для результатів SAT:

source: To estimate the distribution for a model than isn't easy to solve analytically, :class:`NormalDist` can generate input samples for a `Monte Carlo simulation <https://en.wikipedia.org/wiki/Monte_Carlo_method>`_:
uk: Щоб оцінити розподіл для моделі, яку нелегко розв’язати аналітично, :class:`NormalDist` може генерувати вхідні зразки для `симуляції Монте-Карло <https://en.wikipedia.org/wiki/Monte_Carlo_method>`_:

source: For example, an open source conference has 750 attendees and two rooms with a 500 person capacity. There is a talk about Python and another about Ruby. In previous conferences, 65% of the attendees preferred to listen to Python talks. Assuming the population preferences haven't changed, what is the probability that the Python room will stay within its capacity limits?
uk: Наприклад, конференція з відкритим кодом має 750 учасників і дві кімнати на 500 осіб. Є розмова про Python, а інша про Ruby. На попередніх конференціях 65% відвідувачів воліли слухати доповіді на Python. Якщо припустити, що переваги населення не змінилися, яка ймовірність того, що кімната Python залишиться в межах своїх можливостей?

source: Normal distributions commonly arise in machine learning problems.
uk: Нормальний розподіл зазвичай виникає в задачах машинного навчання.

source: We're given a training dataset with measurements for eight people. The measurements are assumed to be normally distributed, so we summarize the data with :class:`NormalDist`:
uk: Нам надається навчальний набір даних із вимірюваннями для восьми осіб. Припускається, що вимірювання мають нормальний розподіл, тому ми підсумовуємо дані за допомогою :class:`NormalDist`:

source: Next, we encounter a new person whose feature measurements are known but whose gender is unknown:
uk: Далі ми зустрічаємо нову людину, характеристики якої відомі, але стать невідома:

source: Starting with a 50% `prior probability <https://en.wikipedia.org/wiki/Prior_probability>`_ of being male or female, we compute the posterior as the prior times the product of likelihoods for the feature measurements given the gender:
uk: Починаючи з 50% `попередньої ймовірності <https://en.wikipedia.org/wiki/Prior_probability>`_ бути чоловіком чи жінкою, ми обчислюємо апостеріор як попередній час добуток ймовірностей для вимірювань ознаки з урахуванням статі:

source: The final prediction goes to the largest posterior. This is known as the `maximum a posteriori <https://en.wikipedia.org/wiki/Maximum_a_posteriori_estimation>`_ or MAP:
uk: Остаточне передбачення йде до найбільшого заднього. Це відомо як `maximum a posteriori <https://en.wikipedia.org/wiki/Maximum_a_posteriori_estimation>`_ або MAP:
