Repository: seanpm2001/python-docs-uk
Catalog: library/statistics.po
Languages: uk

source: :mod:`statistics` --- Mathematical statistics functions
uk: :mod:`statistics` --- Функції математичної статистики

source: **Source code:** :source:`Lib/statistics.py`
uk: **Вихідний код:** :source:`Lib/statistics.py`

source: This module provides functions for calculating mathematical statistics of numeric (:class:`~numbers.Real`-valued) data.
uk: Цей модуль надає функції для обчислення математичної статистики числових (:class:`~numbers.Real`-значних) даних.

source: The module is not intended to be a competitor to third-party libraries such as `NumPy <https://numpy.org>`_, `SciPy <https://www.scipy.org/>`_, or proprietary full-featured statistics packages aimed at professional statisticians such as Minitab, SAS and Matlab. It is aimed at the level of graphing and scientific calculators.
uk: Модуль не призначений для конкуренції стороннім бібліотекам, таким як `NumPy <https://numpy.org>`_, `SciPy <https://www.scipy.org/>`_, або власним повнофункціональним пакетам статистики, призначеним для професійних статистиків, таким як Minitab, SAS і Matlab. Він орієнтований на рівень графічних і наукових калькуляторів.

source: Unless explicitly noted, these functions support :class:`int`, :class:`float`, :class:`~decimal.Decimal` and :class:`~fractions.Fraction`. Behaviour with other types (whether in the numeric tower or not) is currently unsupported. Collections with a mix of types are also undefined and implementation-dependent. If your input data consists of mixed types, you may be able to use :func:`map` to ensure a consistent result, for example: ``map(float, input_data)``.
uk: Якщо не зазначено явно, ці функції підтримують :class:`int`, :class:`float`, :class:`~decimal.Decimal` і :class:`~fractions.Fraction`. Поведінка з іншими типами (у числовій вежі чи ні) наразі не підтримується. Колекції з сумішшю типів також не визначені та залежать від реалізації. Якщо ваші вхідні дані складаються зі змішаних типів, ви можете використовувати :func:`map`, щоб забезпечити послідовний результат, наприклад: ``map(float, input_data)``.

source: Averages and measures of central location
uk: Середні значення та міри центрального розташування

source: These functions calculate an average or typical value from a population or sample.
uk: Ці функції обчислюють середнє або типове значення з генеральної сукупності чи вибірки.

source: Arithmetic mean ("average") of data.
uk: Середнє арифметичне ("середнє") даних.

source: :func:`geometric_mean`
uk: :func:`геометричне_середнє`

source: Geometric mean of data.
uk: Середнє геометричне даних.

source: Harmonic mean of data.
uk: Середнє гармонійне даних.

source: Median (middle value) of data.
uk: Медіана (середнє значення) даних.

source: Low median of data.
uk: Низька медіана даних.

source: High median of data.
uk: Висока медіана даних.

source: Median, or 50th percentile, of grouped data.
uk: Медіана, або 50-й процентиль, згрупованих даних.

source: Single mode (most common value) of discrete or nominal data.
uk: Одиночний режим (найпоширеніше значення) дискретних або номінальних даних.

source: List of modes (most common values) of discrete or nominal data.
uk: Список режимів (найпоширеніших значень) дискретних або номінальних даних.

source: Divide data into intervals with equal probability.
uk: Розділіть дані на інтервали з рівною ймовірністю.

source: Measures of spread
uk: Міри поширення

source: These functions calculate a measure of how much the population or sample tends to deviate from the typical or average values.
uk: Ці функції обчислюють міру того, наскільки генеральна сукупність або вибірка має тенденцію відхилятися від типових чи середніх значень.

source: Population standard deviation of data.
uk: Стандартне відхилення сукупності даних.

source: Population variance of data.
uk: Популяційна дисперсія даних.

source: Sample standard deviation of data.
uk: Стандартне відхилення вибірки даних.

source: Sample variance of data.
uk: Вибіркова дисперсія даних.

source: Statistics for relations between two inputs
uk: Статистика для відносин між двома вхідними даними

source: These functions calculate statistics regarding relations between two inputs.
uk: Ці функції обчислюють статистичні дані щодо зв’язків між двома входами.

source: Sample covariance for two variables.
uk: Вибіркова коваріація для двох змінних.

source: Pearson's correlation coefficient for two variables.
uk: Коефіцієнт кореляції Пірсона для двох змінних.

source: :func:`linear_regression`
uk: :func:`лінійна_регресія`

source: Slope and intercept for simple linear regression.
uk: Нахил і відрізок для простої лінійної регресії.

source: Function details
uk: Деталі функції

source: Note: The functions do not require the data given to them to be sorted. However, for reading convenience, most of the examples show sorted sequences.
uk: Примітка. Функції не вимагають сортування наданих їм даних. Однак для зручності читання більшість прикладів показують відсортовані послідовності.

source: Return the sample arithmetic mean of *data* which can be a sequence or iterable.
uk: Повертає зразкове середнє арифметичне *даних*, яке може бути послідовністю або ітерованим.

source: The arithmetic mean is the sum of the data divided by the number of data points. It is commonly called "the average", although it is only one of many different mathematical averages. It is a measure of the central location of the data.
uk: Середнє арифметичне — це сума даних, поділена на кількість точок даних. Його зазвичай називають "середнім", хоча це лише одне з багатьох різних математичних середніх. Це міра центрального розташування даних.

source: If *data* is empty, :exc:`StatisticsError` will be raised.
uk: Якщо *data* порожній, буде викликано :exc:`StatisticsError`.

source: Some examples of use:
uk: Деякі приклади використання:

source: The mean is strongly affected by `outliers <https://en.wikipedia.org/wiki/Outlier>`_ and is not necessarily a typical example of the data points. For a more robust, although less efficient, measure of `central tendency <https://en.wikipedia.org/wiki/Central_tendency>`_, see :func:`median`.
uk: На середнє значення сильно впливають `викиди <https://en.wikipedia.org/wiki/Outlier>`_ і не обов’язково є типовим прикладом точок даних. Для більш надійного, хоча й менш ефективного вимірювання `центральної тенденції <https://en.wikipedia.org/wiki/Central_tendency>`_, див. :func:`median`.

source: The sample mean gives an unbiased estimate of the true population mean, so that when taken on average over all the possible samples, ``mean(sample)`` converges on the true mean of the entire population. If *data* represents the entire population rather than a sample, then ``mean(data)`` is equivalent to calculating the true population mean μ.
uk: Середнє значення вибірки дає неупереджену оцінку справжнього середнього значення генеральної сукупності, так що, узявши середнє значення за всіма можливими вибірками, "середнє (вибірка)" збігається зі справжнім середнім значенням усієї генеральної сукупності. Якщо *data* представляє всю генеральну сукупність, а не вибірку, тоді ``середнє (дані)`` еквівалентно обчисленню справжнього середнього µ генеральної сукупності.

source: Convert *data* to floats and compute the arithmetic mean.
uk: Перетворіть *дані* на числа з плаваючою точкою та обчисліть середнє арифметичне.

source: This runs faster than the :func:`mean` function and it always returns a :class:`float`. The *data* may be a sequence or iterable. If the input dataset is empty, raises a :exc:`StatisticsError`.
uk: Це працює швидше, ніж функція :func:`mean`, і завжди повертає :class:`float`. *Дані* можуть бути послідовністю або ітерованими. Якщо вхідний набір даних порожній, виникає :exc:`StatisticsError`.

source: Added support for *weights*.
uk: Додано підтримку *ваги*.

source: Convert *data* to floats and compute the geometric mean.
uk: Перетворіть *дані* на числа з плаваючою точкою та обчисліть середнє геометричне.

source: The geometric mean indicates the central tendency or typical value of the *data* using the product of the values (as opposed to the arithmetic mean which uses their sum).
uk: Середнє геометричне вказує на центральну тенденцію або типове значення *даних* за допомогою добутку значень (на відміну від середнього арифметичного, яке використовує їх суму).

source: Raises a :exc:`StatisticsError` if the input dataset is empty, if it contains a zero, or if it contains a negative value. The *data* may be a sequence or iterable.
uk: Викликає :exc:`StatisticsError`, якщо вхідний набір даних порожній, містить нуль або містить від’ємне значення. *Дані* можуть бути послідовністю або ітерованими.

source: No special efforts are made to achieve exact results. (However, this may change in the future.)
uk: Особливих зусиль для досягнення точних результатів не докладається. (Однак це може змінитися в майбутньому.)

source: Return the harmonic mean of *data*, a sequence or iterable of real-valued numbers. If *weights* is omitted or *None*, then equal weighting is assumed.
uk: Повертає середнє гармонічне *даних*, послідовності чи ітерації дійсних чисел. Якщо *weights* пропущено або *None*, тоді передбачається однакове зважування.

source: The harmonic mean is the reciprocal of the arithmetic :func:`mean` of the reciprocals of the data. For example, the harmonic mean of three values *a*, *b* and *c* will be equivalent to ``3/(1/a + 1/b + 1/c)``. If one of the values is zero, the result will be zero.
uk: Середнє гармонічне є зворотним арифметичним :func:`mean` зворотних величин даних. Наприклад, середнє гармонійне трьох значень *a*, *b* і *c* буде еквівалентним ``3/(1/a + 1/b + 1/c)``. Якщо одне зі значень дорівнює нулю, результат буде нульовим.

source: The harmonic mean is a type of average, a measure of the central location of the data. It is often appropriate when averaging ratios or rates, for example speeds.
uk: Середнє гармонічне — це тип середнього значення, міра центрального розташування даних. Це часто доцільно під час усереднення співвідношень або швидкості, наприклад швидкості.

source: Suppose a car travels 10 km at 40 km/hr, then another 10 km at 60 km/hr. What is the average speed?
uk: Припустимо, автомобіль проїжджає 10 км зі швидкістю 40 км/год, потім ще 10 км зі швидкістю 60 км/год. Яка середня швидкість?

source: Suppose a car travels 40 km/hr for 5 km, and when traffic clears, speeds-up to 60 km/hr for the remaining 30 km of the journey. What is the average speed?
uk: Припустімо, що автомобіль їде зі швидкістю 40 км/год протягом 5 км, а коли рух припиниться, розвиває швидкість до 60 км/год протягом решти 30 км шляху. Яка середня швидкість?

source: :exc:`StatisticsError` is raised if *data* is empty, any element is less than zero, or if the weighted sum isn't positive.
uk: :exc:`StatisticsError` виникає, якщо *data* порожні, будь-який елемент менше нуля або якщо зважена сума не додатна.

source: The current algorithm has an early-out when it encounters a zero in the input. This means that the subsequent inputs are not tested for validity. (This behavior may change in the future.)
uk: Поточний алгоритм має ранній вихід, коли він зустрічає нуль у вхідних даних. Це означає, що наступні вхідні дані не перевіряються на дійсність. (Ця поведінка може змінитися в майбутньому.)

source: Return the median (middle value) of numeric data, using the common "mean of middle two" method. If *data* is empty, :exc:`StatisticsError` is raised. *data* can be a sequence or iterable.
uk: Повертає медіану (середнє значення) числових даних, використовуючи поширений метод "середнього середнього двох". Якщо *data* порожній, виникає :exc:`StatisticsError`. *data* може бути послідовністю або ітерованою.

source: The median is a robust measure of central location and is less affected by the presence of outliers. When the number of data points is odd, the middle data point is returned:
uk: Медіана є надійним показником центрального розташування, і на неї менше впливає наявність викидів. Якщо кількість точок даних непарна, повертається середня точка даних:

source: When the number of data points is even, the median is interpolated by taking the average of the two middle values:
uk: Якщо кількість точок даних парна, медіана інтерполюється, беручи середнє значення двох середніх значень:

source: This is suited for when your data is discrete, and you don't mind that the median may not be an actual data point.
uk: Це підходить, коли ваші дані є дискретними, і ви не заперечуєте, що медіана може не бути фактичною точкою даних.

source: If the data is ordinal (supports order operations) but not numeric (doesn't support addition), consider using :func:`median_low` or :func:`median_high` instead.
uk: Якщо дані є порядковими (підтримують операції порядку), але не числовими (не підтримують додавання), подумайте про використання :func:`median_low` або :func:`median_high` натомість.

source: Return the low median of numeric data. If *data* is empty, :exc:`StatisticsError` is raised. *data* can be a sequence or iterable.
uk: Повертає нижню медіану числових даних. Якщо *data* порожній, виникає :exc:`StatisticsError`. *data* може бути послідовністю або ітерованою.

source: The low median is always a member of the data set. When the number of data points is odd, the middle value is returned. When it is even, the smaller of the two middle values is returned.
uk: Нижня медіана завжди є членом набору даних. Якщо кількість точок даних непарна, повертається середнє значення. Якщо воно парне, повертається менше з двох середніх значень.

source: Use the low median when your data are discrete and you prefer the median to be an actual data point rather than interpolated.
uk: Використовуйте низьку медіану, якщо ваші дані є дискретними, і ви віддаєте перевагу, щоб медіана була фактичною точкою даних, а не інтерпольованою.

source: Return the high median of data. If *data* is empty, :exc:`StatisticsError` is raised. *data* can be a sequence or iterable.
uk: Повернути високу медіану даних. Якщо *data* порожній, виникає :exc:`StatisticsError`. *data* може бути послідовністю або ітерованою.

source: The high median is always a member of the data set. When the number of data points is odd, the middle value is returned. When it is even, the larger of the two middle values is returned.
uk: Верхня медіана завжди є членом набору даних. Якщо кількість точок даних непарна, повертається середнє значення. Якщо воно парне, повертається більше з двох середніх значень.

source: Use the high median when your data are discrete and you prefer the median to be an actual data point rather than interpolated.
uk: Використовуйте високу медіану, якщо ваші дані є дискретними, і ви віддаєте перевагу, щоб медіана була фактичною точкою даних, а не інтерпольованою.

source: Return the median of grouped continuous data, calculated as the 50th percentile, using interpolation. If *data* is empty, :exc:`StatisticsError` is raised. *data* can be a sequence or iterable.
uk: Повертає медіану згрупованих безперервних даних, обчислену як 50-й процентиль, використовуючи інтерполяцію. Якщо *data* порожній, виникає :exc:`StatisticsError`. *data* може бути послідовністю або ітерованою.

source: In the following example, the data are rounded, so that each value represents the midpoint of data classes, e.g. 1 is the midpoint of the class 0.5--1.5, 2 is the midpoint of 1.5--2.5, 3 is the midpoint of 2.5--3.5, etc. With the data given, the middle value falls somewhere in the class 3.5--4.5, and interpolation is used to estimate it:
uk: У наступному прикладі дані округлені, так що кожне значення представляє середину класів даних, напр. 1 — середина класу 0,5--1,5, 2 — середина 1,5--2,5, 3 — середина 2,5--3,5 і т. д. З наведеними даними середнє значення потрапляє десь у клас 3,5-- 4.5, а для його оцінки використовується інтерполяція:

source: Optional argument *interval* represents the class interval, and defaults to 1. Changing the class interval naturally will change the interpolation:
uk: Необов’язковий аргумент *інтервал* представляє інтервал класу та за замовчуванням дорівнює 1. Зміна інтервалу класу природно змінить інтерполяцію:

source: This function does not check whether the data points are at least *interval* apart.
uk: Ця функція не перевіряє, чи точки даних розташовані одна від одної принаймні на *інтервал*.

source: Under some circumstances, :func:`median_grouped` may coerce data points to floats. This behaviour is likely to change in the future.
uk: За деяких обставин :func:`median_grouped` може примусово використовувати точки даних для плаваючих значень. Ймовірно, ця поведінка зміниться в майбутньому.

source: "Statistics for the Behavioral Sciences", Frederick J Gravetter and Larry B Wallnau (8th Edition).
uk: "Статистика для поведінкових наук", Фредерік Дж. Граветтер і Ларрі Б. Валнау (8-е видання).

source: The `SSMEDIAN <https://help.gnome.org/users/gnumeric/stable/gnumeric.html#gnumeric-function-SSMEDIAN>`_ function in the Gnome Gnumeric spreadsheet, including `this discussion <https://mail.gnome.org/archives/gnumeric-list/2011-April/msg00018.html>`_.
uk: Функція `SSMEDIAN <https://help.gnome.org/users/gnumeric/stable/gnumeric.html#gnumeric-function-SSMEDIAN>`_ в електронній таблиці Gnome Gnumeric, включаючи `це обговорення <https://mail.gnome.org/archives/gnumeric-list/2011-April/msg00018.html>`_.

source: Return the single most common data point from discrete or nominal *data*. The mode (when it exists) is the most typical value and serves as a measure of central location.
uk: Повертає єдину найпоширенішу точку даних із дискретних або номінальних *даних*. Режим (якщо він існує) є найбільш типовим значенням і служить мірою центрального розташування.

source: If there are multiple modes with the same frequency, returns the first one encountered in the *data*. If the smallest or largest of those is desired instead, use ``min(multimode(data))`` or ``max(multimode(data))``. If the input *data* is empty, :exc:`StatisticsError` is raised.
uk: Якщо є кілька режимів з однаковою частотою, повертає перший, який зустрічається в *даних*. Якщо натомість потрібне найменше або найбільше з них, використовуйте ``min(multimode(data))`` або ``max(multimode(data))``. Якщо введення *data* порожнє, виникає :exc:`StatisticsError`.

source: ``mode`` assumes discrete data and returns a single value. This is the standard treatment of the mode as commonly taught in schools:
uk: ``mode`` передбачає дискретні дані та повертає одне значення. Це стандартне лікування режиму, якому зазвичай навчають у школах:

source: The mode is unique in that it is the only statistic in this package that also applies to nominal (non-numeric) data:
uk: Режим унікальний тим, що це єдина статистика в цьому пакеті, яка також застосовується до номінальних (нечислових) даних:

source: Now handles multimodal datasets by returning the first mode encountered. Formerly, it raised :exc:`StatisticsError` when more than one mode was found.
uk: Тепер обробляє мультимодальні набори даних, повертаючи перший зустрічається режим. Раніше він викликав :exc:`StatisticsError`, коли було знайдено більше ніж один режим.

source: Return a list of the most frequently occurring values in the order they were first encountered in the *data*. Will return more than one result if there are multiple modes or an empty list if the *data* is empty:
uk: Повертає список значень, які найчастіше зустрічаються, у тому порядку, в якому вони були вперше зустрінуті в *даних*. Поверне більше одного результату, якщо існує кілька режимів, або порожній список, якщо *дані* порожні:

source: Return the population standard deviation (the square root of the population variance). See :func:`pvariance` for arguments and other details.
uk: Повертає стандартне відхилення сукупності (квадратний корінь із дисперсії сукупності). Перегляньте :func:`pvariance` для отримання аргументів та інших деталей.

source: Return the population variance of *data*, a non-empty sequence or iterable of real-valued numbers. Variance, or second moment about the mean, is a measure of the variability (spread or dispersion) of data. A large variance indicates that the data is spread out; a small variance indicates it is clustered closely around the mean.
uk: Повертає дисперсію сукупності *даних*, непорожню послідовність або ітерацію дійсних чисел. Дисперсія, або другий момент відносно середнього, є мірою мінливості (розкиду або дисперсії) даних. Велика дисперсія вказує на те, що дані розкидані; невелика дисперсія вказує на те, що вона згрупована близько середнього значення.

source: If the optional second argument *mu* is given, it is typically the mean of the *data*. It can also be used to compute the second moment around a point that is not the mean. If it is missing or ``None`` (the default), the arithmetic mean is automatically calculated.
uk: Якщо задано необов’язковий другий аргумент *mu*, зазвичай це середнє значення *data*. Його також можна використовувати для обчислення другого моменту навколо точки, яка не є середнім. Якщо воно відсутнє або ``None`` (за замовчуванням), автоматично обчислюється середнє арифметичне.

source: Use this function to calculate the variance from the entire population. To estimate the variance from a sample, the :func:`variance` function is usually a better choice.
uk: Використовуйте цю функцію, щоб обчислити дисперсію для всієї сукупності. Щоб оцінити дисперсію за вибіркою, функція :func:`variance` зазвичай є кращим вибором.

source: Raises :exc:`StatisticsError` if *data* is empty.
uk: Викликає :exc:`StatisticsError`, якщо *data* порожні.

source: Examples:
uk: приклади:

source: If you have already calculated the mean of your data, you can pass it as the optional second argument *mu* to avoid recalculation:
uk: Якщо ви вже обчислили середнє значення своїх даних, ви можете передати його як необов’язковий другий аргумент *mu*, щоб уникнути перерахунку:

source: Decimals and Fractions are supported:
uk: Підтримуються десяткові знаки та дроби:

source: When called with the entire population, this gives the population variance σ². When called on a sample instead, this is the biased sample variance s², also known as variance with N degrees of freedom.
uk: При виклику з усією сукупністю це дає дисперсію сукупності σ². Якщо замість цього викликати вибірку, це є дисперсія зміщеної вибірки s², також відома як дисперсія з N ступенями свободи.

source: If you somehow know the true population mean μ, you may use this function to calculate the variance of a sample, giving the known population mean as the second argument. Provided the data points are a random sample of the population, the result will be an unbiased estimate of the population variance.
uk: Якщо ви якимось чином знаєте справжнє середнє значення сукупності μ, ви можете використати цю функцію для обчислення дисперсії вибірки, вказавши відоме середнє значення сукупності як другий аргумент. За умови, що точки даних є випадковою вибіркою сукупності, результатом буде неупереджена оцінка дисперсії генеральної сукупності.

source: Return the sample standard deviation (the square root of the sample variance). See :func:`variance` for arguments and other details.
uk: Повертає стандартне відхилення вибірки (квадратний корінь із дисперсії вибірки). Перегляньте :func:`variance` для отримання аргументів та інших деталей.
