Repository: seanpm2001/python-docs-uk
Catalog: library/sys.po
Languages: uk

source: These objects contain the original values of ``breakpointhook``, ``displayhook``, ``excepthook``, and ``unraisablehook`` at the start of the program. They are saved so that ``breakpointhook``, ``displayhook`` and ``excepthook``, ``unraisablehook`` can be restored in case they happen to get replaced with broken or alternative objects.
uk: Ці об’єкти містять вихідні значення ``breakpointhook``, ``displayhook``, ``excepthook`` і ``unraisablehook`` на початку програми. Вони зберігаються, щоб можна було відновити ``breakpointhook``, ``displayhook`` і ``excepthook``, ``unraisablehook``, якщо вони будуть замінені несправними або альтернативними об’єктами.

source: A string giving the site-specific directory prefix where the platform-dependent Python files are installed; by default, this is also ``'/usr/local'``. This can be set at build time with the ``--exec-prefix`` argument to the :program:`configure` script. Specifically, all configuration files (e.g. the :file:`pyconfig.h` header file) are installed in the directory :file:`{exec_prefix}/lib/python{X.Y}/config`, and shared library modules are installed in :file:`{exec_prefix}/lib/python{X.Y}/lib-dynload`, where *X.Y* is the version number of Python, for example ``3.2``.
uk: Рядок, що містить префікс каталогу сайту, де встановлено залежні від платформи файли Python; за замовчуванням це також ``'/usr/local'``. Це можна встановити під час збирання за допомогою аргументу ``--exec-prefix`` сценарію :program:`configure`. Зокрема, усі файли конфігурації (наприклад, файл заголовка :file:`pyconfig.h`) встановлено в каталозі :file:`{exec_prefix}/lib/python{X.Y}/config`, а модулі спільної бібліотеки встановлено в: файл: `{exec_prefix}/lib/python{X.Y}/lib-dynload`, де *X.Y* — це номер версії Python, наприклад ``3.2``.

source: If a :ref:`virtual environment <venv-def>` is in effect, this value will be changed in ``site.py`` to point to the virtual environment. The value for the Python installation will still be available, via :data:`base_exec_prefix`.
uk: Якщо діє :ref:`віртуальне середовище <venv-def>`, це значення буде змінено у ``site.py``, щоб вказувати на віртуальне середовище. Значення для встановлення Python усе ще буде доступним через :data:`base_exec_prefix`.

source: A string giving the absolute path of the executable binary for the Python interpreter, on systems where this makes sense. If Python is unable to retrieve the real path to its executable, :data:`sys.executable` will be an empty string or ``None``.
uk: Рядок, що вказує абсолютний шлях до виконуваного двійкового файлу для інтерпретатора Python у системах, де це має сенс. Якщо Python не може отримати справжній шлях до свого виконуваного файлу, :data:`sys.executable` буде порожнім рядком або ``None``.

source: Raise a :exc:`SystemExit` exception, signaling an intention to exit the interpreter.
uk: Викликати виняток :exc:`SystemExit`, сигналізуючи про намір вийти з інтерпретатора.

source: The optional argument *arg* can be an integer giving the exit status (defaulting to zero), or another type of object. If it is an integer, zero is considered "successful termination" and any nonzero value is considered "abnormal termination" by shells and the like. Most systems require it to be in the range 0--127, and produce undefined results otherwise. Some systems have a convention for assigning specific meanings to specific exit codes, but these are generally underdeveloped; Unix programs generally use 2 for command line syntax errors and 1 for all other kind of errors. If another type of object is passed, ``None`` is equivalent to passing zero, and any other object is printed to :data:`stderr` and results in an exit code of 1. In particular, ``sys.exit("some error message")`` is a quick way to exit a program when an error occurs.
uk: Необов’язковий аргумент *arg* може бути цілим числом, що дає статус виходу (за замовчуванням нуль), або іншим типом об’єкта. Якщо це ціле число, нуль вважається "успішним завершенням", а будь-яке ненульове значення вважається "ненормальним завершенням" оболонками тощо. Більшість систем вимагають, щоб він знаходився в діапазоні 0--127, і в іншому випадку дають невизначені результати. У деяких системах є угода про призначення конкретних значень конкретним кодам виходу, але вони, як правило, недостатньо розроблені; Програми Unix зазвичай використовують 2 для синтаксичних помилок командного рядка та 1 для всіх інших видів помилок. Якщо передається інший тип об’єкта, ``None`` еквівалентно передачі нуля, а будь-який інший об’єкт друкується в :data:`stderr` і призводить до коду виходу 1. Зокрема, ``sys.exit( "повідомлення про помилку")`` — це швидкий спосіб вийти з програми, коли виникає помилка.

source: Since :func:`exit` ultimately "only" raises an exception, it will only exit the process when called from the main thread, and the exception is not intercepted. Cleanup actions specified by finally clauses of :keyword:`try` statements are honored, and it is possible to intercept the exit attempt at an outer level.
uk: Оскільки :func:`exit` зрештою "тільки" викликає виняток, він вийде з процесу лише під час виклику з основного потоку, і виняток не перехоплюється. Дії очищення, визначені пунктами finally операторів :keyword:`try`, виконуються, і можна перехопити спробу виходу на зовнішньому рівні.

source: If an error occurs in the cleanup after the Python interpreter has caught :exc:`SystemExit` (such as an error flushing buffered data in the standard streams), the exit status is changed to 120.
uk: Якщо під час очищення виникає помилка після того, як інтерпретатор Python переловив :exc:`SystemExit` (наприклад, помилка очищення буферизованих даних у стандартних потоках), статус виходу змінюється на 120.

source: The :term:`named tuple` *flags* exposes the status of command line flags. The attributes are read only.
uk: :term:`named tuple` *flags* показує статус прапорів командного рядка. Атрибути доступні лише для читання.

source: attribute
uk: атрибут

source: flag
uk: прапор

source: :option:`-O` or :option:`-OO`
uk: :option:`-O` або :option:`-OO`

source: :option:`-X dev <-X>` (:ref:`Python Development Mode <devmode>`)
uk: :option:`-X dev <-X>` (:ref:`Режим розробки Python <devmode>`)

source: Added ``quiet`` attribute for the new :option:`-q` flag.
uk: Додано атрибут ``quiet`` для нового прапора :option:`-q`.

source: The ``hash_randomization`` attribute.
uk: Атрибут ``hash_randomization``.

source: Removed obsolete ``division_warning`` attribute.
uk: Видалено застарілий атрибут ``division_warning``.

source: Added ``isolated`` attribute for :option:`-I` ``isolated`` flag.
uk: Додано атрибут ``isolated`` для прапора :option:`-I` ``isolated``.

source: Added the ``dev_mode`` attribute for the new :ref:`Python Development Mode <devmode>` and the ``utf8_mode`` attribute for the new :option:`-X` ``utf8`` flag.
uk: Додано атрибут ``dev_mode`` для нового режиму розробки :ref:`Python <devmode>` і атрибут ``utf8_mode`` для нового прапора :option:`-X` ``utf8``.

source: A :term:`named tuple` holding information about the float type. It contains low level information about the precision and internal representation. The values correspond to the various floating-point constants defined in the standard header file :file:`float.h` for the 'C' programming language; see section 5.2.4.2.2 of the 1999 ISO/IEC C standard [C99]_, 'Characteristics of floating types', for details.
uk: :term:`named tuple`, що містить інформацію про тип float. Він містить інформацію низького рівня про точність і внутрішнє представлення. Значення відповідають різним константам із плаваючою комою, визначеним у стандартному файлі заголовків :file:`float.h` для мови програмування "C"; подробиці див. у розділі 5.2.4.2.2 стандарту ISO/IEC C [C99]_, "Характеристики плаваючих типів" 1999 року.

source: float.h macro
uk: макрос float.h

source: explanation
uk: пояснення

source: difference between 1.0 and the least value greater than 1.0 that is representable as a float
uk: різниця між 1,0 і найменшим значенням, більшим за 1,0, яке можна представити як число з плаваючою точкою

source: See also :func:`math.ulp`.
uk: Дивіться також :func:`math.ulp`.

source: maximum number of decimal digits that can be faithfully represented in a float; see below
uk: максимальна кількість десяткових цифр, які можуть бути точно представлені в float; Дивіться нижче

source: float precision: the number of base-``radix`` digits in the significand of a float
uk: точність числа з плаваючою точкою: кількість базових ``основних цифр`` у значенні числа з плаваючою точкою

source: maximum representable positive finite float
uk: максимально репрезентований додатний кінцевий float

source: maximum integer *e* such that ``radix**(e-1)`` is a representable finite float
uk: максимальне ціле число *e* таке, що ``radix**(e-1)`` є кінцевим числом з плаваючою точкою, яке можна представити

source: maximum integer *e* such that ``10**e`` is in the range of representable finite floats
uk: максимальне ціле число *e* таке, що ``10**e`` знаходиться в діапазоні представлених кінцевих чисел з плаваючою точкою

source: minimum representable positive *normalized* float
uk: мінімально представлений додатний *нормалізований* float

source: Use :func:`math.ulp(0.0) <math.ulp>` to get the smallest positive *denormalized* representable float.
uk: Використовуйте :func:`math.ulp(0.0) <math.ulp>`, щоб отримати найменше додатне *денормалізоване* число з плаваючою точкою, яке можна представити.

source: minimum integer *e* such that ``radix**(e-1)`` is a normalized float
uk: мінімальне ціле число *e* таке, що ``radix**(e-1)`` є нормалізованим числом з плаваючою точкою

source: minimum integer *e* such that ``10**e`` is a normalized float
uk: мінімальне ціле число *e* таке, що ``10**e`` є нормалізованим числом з плаваючою точкою

source: radix of exponent representation
uk: радікс представлення степеня

source: integer constant representing the rounding mode used for arithmetic operations. This reflects the value of the system FLT_ROUNDS macro at interpreter startup time. See section 5.2.4.2.2 of the C99 standard for an explanation of the possible values and their meanings.
uk: ціла константа, що представляє режим округлення, що використовується для арифметичних операцій. Це відображає значення системного макросу FLT_ROUNDS під час запуску інтерпретатора. Дивіться розділ 5.2.4.2.2 стандарту C99 для пояснення можливих значень та їх значень.

source: The attribute :attr:`sys.float_info.dig` needs further explanation. If ``s`` is any string representing a decimal number with at most :attr:`sys.float_info.dig` significant digits, then converting ``s`` to a float and back again will recover a string representing the same decimal value::
uk: Атрибут :attr:`sys.float_info.dig` потребує додаткового пояснення. Якщо ``s`` є будь-яким рядком, що представляє десяткове число, що містить щонайбільше :attr:`sys.float_info.dig` значущих цифр, тоді перетворення ``s`` на число з плаваючою точкою і назад відновить рядок, що представляє той самий десятковий дроб значення::

source: But for strings with more than :attr:`sys.float_info.dig` significant digits, this isn't always true::
uk: Але для рядків із більш ніж :attr:`sys.float_info.dig` значущими цифрами це не завжди вірно::

source: A string indicating how the :func:`repr` function behaves for floats. If the string has value ``'short'`` then for a finite float ``x``, ``repr(x)`` aims to produce a short string with the property that ``float(repr(x)) == x``. This is the usual behaviour in Python 3.1 and later. Otherwise, ``float_repr_style`` has value ``'legacy'`` and ``repr(x)`` behaves in the same way as it did in versions of Python prior to 3.1.
uk: Рядок, що вказує, як функція :func:`repr` поводиться для чисел з плаваючою точкою. Якщо рядок має значення ``'short``, тоді для кінцевого числа ``x``, ``repr(x)`` має на меті створити короткий рядок із властивістю ``float(repr(x)) == x``. Це звичайна поведінка в Python 3.1 і пізніших версіях. В іншому випадку ``float_repr_style`` має значення ``'legacy'``, а ``repr(x)`` поводиться так само, як і у версіях Python до 3.1.

source: Return the number of memory blocks currently allocated by the interpreter, regardless of their size. This function is mainly useful for tracking and debugging memory leaks. Because of the interpreter's internal caches, the result can vary from call to call; you may have to call :func:`_clear_type_cache()` and :func:`gc.collect()` to get more predictable results.
uk: Повертає кількість блоків пам'яті, виділених інтерпретатором, незалежно від їх розміру. Ця функція в основному корисна для відстеження та усунення витоків пам'яті. Через внутрішні кеші інтерпретатора результат може відрізнятися від виклику до виклику; можливо, вам доведеться викликати :func:`_clear_type_cache()` і :func:`gc.collect()`, щоб отримати більш передбачувані результати.

source: If a Python build or implementation cannot reasonably compute this information, :func:`getallocatedblocks()` is allowed to return 0 instead.
uk: Якщо збірка або реалізація Python не може обґрунтовано обчислити цю інформацію, :func:`getallocatedblocks()` може замість цього повертати 0.

source: Return the build time API version of Android as an integer.
uk: Повертає версію API часу збірки Android як ціле число.

source: :ref:`Availability <availability>`: Android.
uk: :ref:`Наявність <availability>`: Android.

source: Return the name of the current default string encoding used by the Unicode implementation.
uk: Повертає назву поточного стандартного кодування рядка, яке використовується реалізацією Unicode.

source: Return the current value of the flags that are used for :c:func:`dlopen` calls. Symbolic names for the flag values can be found in the :mod:`os` module (``RTLD_xxx`` constants, e.g. :data:`os.RTLD_LAZY`).
uk: Повертає поточне значення прапорів, які використовуються для викликів :c:func:`dlopen`. Символічні назви для значень прапорів можна знайти в модулі :mod:`os` (константи ``RTLD_xxx``, наприклад :data:`os.RTLD_LAZY`).

source: :ref:`Availability <availability>`: Unix.
uk: :ref:`Наявність <availability>`: Unix.

source: Get the :term:`filesystem encoding <filesystem encoding and error handler>`: the encoding used with the :term:`filesystem error handler <filesystem encoding and error handler>` to convert between Unicode filenames and bytes filenames. The filesystem error handler is returned from :func:`getfilesystemencoding`.
uk: Отримайте :term:`кодування файлової системи <filesystem encoding and error handler>`: кодування, яке використовується з :term:`обробником помилок файлової системи <filesystem encoding and error handler>` для перетворення між іменами файлів Unicode та іменами файлів байтів. Обробник помилок файлової системи повертається з :func:`getfilesystemencoding`.

source: For best compatibility, str should be used for filenames in all cases, although representing filenames as bytes is also supported. Functions accepting or returning filenames should support either str or bytes and internally convert to the system's preferred representation.
uk: Для найкращої сумісності str слід використовувати для імен файлів у всіх випадках, хоча представлення імен файлів у вигляді байтів також підтримується. Функції, що приймають або повертають імена файлів, повинні підтримувати str або bytes і внутрішньо конвертувати до бажаного представлення системи.

source: :func:`os.fsencode` and :func:`os.fsdecode` should be used to ensure that the correct encoding and errors mode are used.
uk: :func:`os.fsencode` і :func:`os.fsdecode` слід використовувати, щоб переконатися, що використовується правильне кодування та режим помилок.

source: The :term:`filesystem encoding and error handler` are configured at Python startup by the :c:func:`PyConfig_Read` function: see :c:member:`~PyConfig.filesystem_encoding` and :c:member:`~PyConfig.filesystem_errors` members of :c:type:`PyConfig`.
uk: :term:`filesystem encoding and error handler` налаштовуються під час запуску Python за допомогою функції :c:func:`PyConfig_Read`: див. :c:member:`~PyConfig.filesystem_encoding` і :c:member:`~PyConfig. filesystem_errors` члени :c:type:`PyConfig`.

source: :func:`getfilesystemencoding` result cannot be ``None`` anymore.
uk: Результат :func:`getfilesystemencoding` більше не може бути ``None``.

source: Windows is no longer guaranteed to return ``'mbcs'``. See :pep:`529` and :func:`_enablelegacywindowsfsencoding` for more information.
uk: Windows більше не гарантовано повертатиме ``'mbcs'``. Дивіться :pep:`529` і :func:`_enablelegacywindowsfsencoding` для отримання додаткової інформації.

source: Return ``'utf-8'`` if the :ref:`Python UTF-8 Mode <utf8-mode>` is enabled.
uk: Повертає ``'utf-8''``, якщо :ref:`Python UTF-8 Mode <utf8-mode>` увімкнено.

source: Get the :term:`filesystem error handler <filesystem encoding and error handler>`: the error handler used with the :term:`filesystem encoding <filesystem encoding and error handler>` to convert between Unicode filenames and bytes filenames. The filesystem encoding is returned from :func:`getfilesystemencoding`.
uk: Отримайте :term:`обробник помилок файлової системи <filesystem encoding and error handler>`: обробник помилок, який використовується з :term:`кодуванням файлової системи <filesystem encoding and error handler>` для перетворення між іменами файлів Unicode та іменами файлів байтів. Кодування файлової системи повертається з :func:`getfilesystemencoding`.

source: Return the reference count of the *object*. The count returned is generally one higher than you might expect, because it includes the (temporary) reference as an argument to :func:`getrefcount`.
uk: Повертає кількість посилань на *об’єкт*. Лічильник, який повертається, зазвичай на одиницю більший, ніж ви могли б очікувати, оскільки він включає (тимчасове) посилання як аргумент для :func:`getrefcount`.

source: Return the current value of the recursion limit, the maximum depth of the Python interpreter stack. This limit prevents infinite recursion from causing an overflow of the C stack and crashing Python. It can be set by :func:`setrecursionlimit`.
uk: Повертає поточне значення обмеження рекурсії, максимальну глибину стека інтерпретатора Python. Це обмеження запобігає нескінченній рекурсії від переповнення стека C і збою Python. Його можна встановити за допомогою :func:`setrecursionlimit`.

source: Return the size of an object in bytes. The object can be any type of object. All built-in objects will return correct results, but this does not have to hold true for third-party extensions as it is implementation specific.
uk: Повертає розмір об'єкта в байтах. Об’єктом може бути будь-який тип об’єкта. Усі вбудовані об’єкти повертатимуть правильні результати, але це не обов’язково стосується сторонніх розширень, оскільки це залежить від реалізації.

source: Only the memory consumption directly attributed to the object is accounted for, not the memory consumption of objects it refers to.
uk: Враховується лише споживання пам’яті, безпосередньо пов’язане з об’єктом, а не споживання пам’яті об’єктами, на які він посилається.

source: If given, *default* will be returned if the object does not provide means to retrieve the size. Otherwise a :exc:`TypeError` will be raised.
uk: Якщо задано, *default* буде повернуто, якщо об’єкт не надає засобів для отримання розміру. Інакше буде викликано :exc:`TypeError`.

source: :func:`getsizeof` calls the object's ``__sizeof__`` method and adds an additional garbage collector overhead if the object is managed by the garbage collector.
uk: :func:`getsizeof` викликає метод об’єкта ``__sizeof__`` і додає додаткові накладні витрати на збирач сміття, якщо об’єктом керує збирач сміття.

source: See `recursive sizeof recipe <https://code.activestate.com/recipes/577504>`_ for an example of using :func:`getsizeof` recursively to find the size of containers and all their contents.
uk: Перегляньте `recursive sizeof recipe <https://code.activestate.com/recipes/577504>`_ для прикладу використання :func:`getsizeof` рекурсивно для визначення розміру контейнерів і всього їхнього вмісту.

source: Return the interpreter's "thread switch interval"; see :func:`setswitchinterval`.
uk: Повертає інтерпретатору "інтервал перемикання потоків"; див. :func:`setswitchinterval`.

source: Return a frame object from the call stack. If optional integer *depth* is given, return the frame object that many calls below the top of the stack. If that is deeper than the call stack, :exc:`ValueError` is raised. The default for *depth* is zero, returning the frame at the top of the call stack.
uk: Повернути об’єкт кадру зі стеку викликів. Якщо задано необов’язкове ціле число *depth*, поверніть об’єкт фрейму, який багато викликає, нижче верхньої частини стека. Якщо це глибше, ніж стек викликів, виникає :exc:`ValueError`. За замовчуванням для *depth* дорівнює нулю, повертаючи кадр у верхній частині стека викликів.

source: This function should be used for internal and specialized purposes only. It is not guaranteed to exist in all implementations of Python.
uk: Цю функцію слід використовувати лише для внутрішніх і спеціальних цілей. Не гарантовано його існування у всіх реалізаціях Python.

source: Get the profiler function as set by :func:`setprofile`.
uk: Отримайте функцію профайлера, встановлену :func:`setprofile`.

source: Get the trace function as set by :func:`settrace`.
uk: Отримайте функцію трасування, встановлену :func:`settrace`.

source: The :func:`gettrace` function is intended only for implementing debuggers, profilers, coverage tools and the like. Its behavior is part of the implementation platform, rather than part of the language definition, and thus may not be available in all Python implementations.
uk: Функція :func:`gettrace` призначена лише для реалізації налагоджувачів, профайлерів, інструментів покриття тощо. Його поведінка є частиною платформи реалізації, а не частиною визначення мови, і тому може бути недоступною в усіх реалізаціях Python.

source: Return a named tuple describing the Windows version currently running. The named elements are *major*, *minor*, *build*, *platform*, *service_pack*, *service_pack_minor*, *service_pack_major*, *suite_mask*, *product_type* and *platform_version*. *service_pack* contains a string, *platform_version* a 3-tuple and all other values are integers. The components can also be accessed by name, so ``sys.getwindowsversion()[0]`` is equivalent to ``sys.getwindowsversion().major``. For compatibility with prior versions, only the first 5 elements are retrievable by indexing.
uk: Повертає іменований кортеж, що описує поточну запущену версію Windows. Іменовані елементи: *major*, *minor*, *build*, *platform*, *service_pack*, *service_pack_minor*, *service_pack_major*, *suite_mask*, *product_type* і *platform_version*. *service_pack* містить рядок, *platform_version* — 3-кортеж, а всі інші значення — цілі числа. До компонентів також можна отримати доступ за іменем, тому ``sys.getwindowsversion()[0]`` еквівалентно ``sys.getwindowsversion().major``. Для сумісності з попередніми версіями лише перші 5 елементів можна отримати за допомогою індексування.

source: *platform* will be :const:`2 (VER_PLATFORM_WIN32_NT)`.
uk: *платформа* буде :const:`2 (VER_PLATFORM_WIN32_NT)`.

source: *product_type* may be one of the following values:
uk: *product_type* може бути одним із таких значень:

source: Constant
uk: Постійний

source: Meaning
uk: Значення

source: The system is a workstation.
uk: Система являє собою робочу станцію.

source: The system is a domain controller.
uk: Система є контролером домену.

source: The system is a server, but not a domain controller.
uk: Система є сервером, але не контролером домену.
