Repository: seanpm2001/python-docs-uk
Catalog: library/sys.po
Languages: uk

source: If a :ref:`virtual environment <venv-def>` is in effect, this value will be changed in ``site.py`` to point to the virtual environment. The value for the Python installation will still be available, via :data:`base_prefix`.
uk: Якщо діє :ref:`віртуальне середовище <venv-def>`, це значення буде змінено у ``site.py``, щоб вказувати на віртуальне середовище. Значення для встановлення Python усе ще буде доступним через :data:`base_prefix`.

source: Strings specifying the primary and secondary prompt of the interpreter. These are only defined if the interpreter is in interactive mode. Their initial values in this case are ``'>>> '`` and ``'... '``. If a non-string object is assigned to either variable, its :func:`str` is re-evaluated each time the interpreter prepares to read a new interactive command; this can be used to implement a dynamic prompt.
uk: Рядки, що вказують основну та додаткову підказки інтерпретатора. Вони визначаються, лише якщо інтерпретатор перебуває в інтерактивному режимі. Їх початковими значеннями в цьому випадку є ``'>>> '`` і ``'... '``. Якщо будь-якій змінній присвоєно нерядковий об’єкт, його :func:`str` переоцінюється щоразу, коли інтерпретатор готується прочитати нову інтерактивну команду; це можна використовувати для реалізації динамічного підказки.

source: Set the flags used by the interpreter for :c:func:`dlopen` calls, such as when the interpreter loads extension modules. Among other things, this will enable a lazy resolving of symbols when importing a module, if called as ``sys.setdlopenflags(0)``. To share symbols across extension modules, call as ``sys.setdlopenflags(os.RTLD_GLOBAL)``. Symbolic names for the flag values can be found in the :mod:`os` module (``RTLD_xxx`` constants, e.g. :data:`os.RTLD_LAZY`).
uk: Установіть прапорці, які використовуються інтерпретатором для викликів :c:func:`dlopen`, наприклад, коли інтерпретатор завантажує модулі розширення. Серед іншого, це дозволить відкладено розпізнавати символи під час імпортування модуля, якщо він викликається як ``sys.setdlopenflags(0)``. Щоб поділитися символами між модулями розширення, викличте ``sys.setdlopenflags(os.RTLD_GLOBAL)``. Символічні назви для значень прапорів можна знайти в модулі :mod:`os` (константи ``RTLD_xxx``, наприклад :data:`os.RTLD_LAZY`).

source: Set the system's profile function, which allows you to implement a Python source code profiler in Python. See chapter :ref:`profile` for more information on the Python profiler. The system's profile function is called similarly to the system's trace function (see :func:`settrace`), but it is called with different events, for example it isn't called for each executed line of code (only on call and return, but the return event is reported even when an exception has been set). The function is thread-specific, but there is no way for the profiler to know about context switches between threads, so it does not make sense to use this in the presence of multiple threads. Also, its return value is not used, so it can simply return ``None``. Error in the profile function will cause itself unset.
uk: Встановіть функцію профілю системи, яка дозволяє реалізувати профайлер вихідного коду Python у Python. Перегляньте розділ :ref:`profile` для отримання додаткової інформації про профайлер Python. Функція профілю системи викликається подібно до функції трасування системи (див. :func:`settrace`), але вона викликається з різними подіями, наприклад, вона не викликається для кожного виконаного рядка коду (тільки під час виклику та повернення, але подія повернення повідомляється, навіть якщо встановлено виняток). Ця функція залежить від потоку, але профайлер не може дізнатися про перемикання контексту між потоками, тому немає сенсу використовувати це за наявності кількох потоків. Крім того, його повертане значення не використовується, тому воно може просто повернути ``None``. Помилка у функції профілю призведе до самої неналаштування.

source: Profile functions should have three arguments: *frame*, *event*, and *arg*. *frame* is the current stack frame. *event* is a string: ``'call'``, ``'return'``, ``'c_call'``, ``'c_return'``, or ``'c_exception'``. *arg* depends on the event type.
uk: Функції профілю повинні мати три аргументи: *frame*, *event* і *arg*. *frame* — поточний кадр стека. *подія* — це рядок: ``'call'``, ``'return'``, ``'c_call'``, ``'c_return'`` або ``'c_exception'``. *arg* залежить від типу події.

source: Raises an :ref:`auditing event <auditing>` ``sys.setprofile`` with no arguments.
uk: Викликає :ref:`подію аудиту <auditing>` ``sys.setprofile`` без аргументів.

source: The events have the following meaning:
uk: Події мають таке значення:

source: ``'call'``
uk: ``'дзвінок'``

source: A function is called (or some other code block entered). The profile function is called; *arg* is ``None``.
uk: Викликається функція (або вводиться інший блок коду). Функція профілю викликається; *arg* — це ``None``.

source: ``'return'``
uk: ``'повернення'``

source: A function (or other code block) is about to return. The profile function is called; *arg* is the value that will be returned, or ``None`` if the event is caused by an exception being raised.
uk: Функція (або інший блок коду) збирається повернутися. Функція профілю викликається; *arg* — це значення, яке буде повернуто, або ``None``, якщо подія спричинена винятковою ситуацією.

source: A C function is about to be called. This may be an extension function or a built-in. *arg* is the C function object.
uk: Ось-ось буде викликана функція C. Це може бути функція розширення або вбудована. *arg* — об’єкт функції C.

source: A C function has returned. *arg* is the C function object.
uk: Функція C повернулася. *arg* — об’єкт функції C.

source: ``'c_exception'``
uk: ``'c_виняток'``

source: A C function has raised an exception. *arg* is the C function object.
uk: Функція C викликала виняток. *arg* — об’єкт функції C.

source: Set the maximum depth of the Python interpreter stack to *limit*. This limit prevents infinite recursion from causing an overflow of the C stack and crashing Python.
uk: Встановіть максимальну глибину стека інтерпретатора Python на *limit*. Це обмеження запобігає нескінченній рекурсії від переповнення стека C і збою Python.

source: The highest possible limit is platform-dependent. A user may need to set the limit higher when they have a program that requires deep recursion and a platform that supports a higher limit. This should be done with care, because a too-high limit can lead to a crash.
uk: Найвищий можливий ліміт залежить від платформи. Користувачеві може знадобитися встановити вищий ліміт, якщо у нього є програма, яка потребує глибокої рекурсії, і платформа, яка підтримує вищий ліміт. Це слід робити обережно, тому що занадто високий ліміт може призвести до збою.

source: If the new limit is too low at the current recursion depth, a :exc:`RecursionError` exception is raised.
uk: Якщо новий ліміт занизький для поточної глибини рекурсії, виникає виняток :exc:`RecursionError`.

source: A :exc:`RecursionError` exception is now raised if the new limit is too low at the current recursion depth.
uk: Виняток :exc:`RecursionError` тепер викликається, якщо нове обмеження занизьке на поточній глибині рекурсії.

source: Set the interpreter's thread switch interval (in seconds). This floating-point value determines the ideal duration of the "timeslices" allocated to concurrently running Python threads. Please note that the actual value can be higher, especially if long-running internal functions or methods are used. Also, which thread becomes scheduled at the end of the interval is the operating system's decision. The interpreter doesn't have its own scheduler.
uk: Встановити інтервал перемикання потоків інтерпретатора (у секундах). Це значення з плаваючою комою визначає ідеальну тривалість "часових інтервалів", виділених одночасно запущеним потокам Python. Зверніть увагу, що фактичне значення може бути вищим, особливо якщо використовуються довгострокові внутрішні функції або методи. Крім того, операційна система вирішує, який потік буде заплановано в кінці інтервалу. Інтерпретатор не має власного планувальника.

source: Set the system's trace function, which allows you to implement a Python source code debugger in Python. The function is thread-specific; for a debugger to support multiple threads, it must register a trace function using :func:`settrace` for each thread being debugged or use :func:`threading.settrace`.
uk: Налаштуйте функцію трасування системи, яка дозволяє реалізувати налагоджувач вихідного коду Python у Python. Функція залежить від потоку; щоб налагоджувач підтримував кілька потоків, він повинен зареєструвати функцію трасування за допомогою :func:`settrace` для кожного потоку, який налагоджується, або використовувати :func:`threading.settrace`.

source: Trace functions should have three arguments: *frame*, *event*, and *arg*. *frame* is the current stack frame. *event* is a string: ``'call'``, ``'line'``, ``'return'``, ``'exception'`` or ``'opcode'``. *arg* depends on the event type.
uk: Функції трасування повинні мати три аргументи: *frame*, *event* і *arg*. *frame* — поточний кадр стека. *подія* — це рядок: ``'виклик'``, ``'рядок'``, ``'повернення'``, ``'виняток'`` або ``'код операції'``. *arg* залежить від типу події.

source: The trace function is invoked (with *event* set to ``'call'``) whenever a new local scope is entered; it should return a reference to a local trace function to be used for the new scope, or ``None`` if the scope shouldn't be traced.
uk: Функція трасування викликається (з *event* встановленим на ``'call'``) кожного разу, коли вводиться нова локальна область; він повинен повертати посилання на локальну функцію трасування, яка буде використана для нової області, або ``None``, якщо область не повинна відстежуватися.

source: The local trace function should return a reference to itself (or to another function for further tracing in that scope), or ``None`` to turn off tracing in that scope.
uk: Функція локальної трасування має повертати посилання на себе (або на іншу функцію для подальшого трасування в цій області), або ``None``, щоб вимкнути трасування в цій області.

source: If there is any error occurred in the trace function, it will be unset, just like ``settrace(None)`` is called.
uk: Якщо у функції відстеження сталася будь-яка помилка, вона буде скинута, як і виклик ``settrace(None)``.

source: A function is called (or some other code block entered). The global trace function is called; *arg* is ``None``; the return value specifies the local trace function.
uk: Викликається функція (або вводиться інший блок коду). Глобальна функція трасування називається; *arg* є ``None``; значення, що повертається, визначає локальну функцію трасування.

source: ``'line'``
uk: ``''рядок'``

source: The interpreter is about to execute a new line of code or re-execute the condition of a loop. The local trace function is called; *arg* is ``None``; the return value specifies the new local trace function. See :file:`Objects/lnotab_notes.txt` for a detailed explanation of how this works. Per-line events may be disabled for a frame by setting :attr:`f_trace_lines` to :const:`False` on that frame.
uk: Інтерпретатор збирається виконати новий рядок коду або повторно виконати умову циклу. Викликається функція локального трасування; *arg* є ``None``; значення, що повертається, визначає нову локальну функцію трасування. Перегляньте :file:`Objects/lnotab_notes.txt` для детального пояснення того, як це працює. Порядкові події можна вимкнути для кадру, встановивши :attr:`f_trace_lines` на :const:`False` для цього кадру.

source: A function (or other code block) is about to return. The local trace function is called; *arg* is the value that will be returned, or ``None`` if the event is caused by an exception being raised. The trace function's return value is ignored.
uk: Функція (або інший блок коду) збирається повернутися. Викликається функція локального трасування; *arg* — це значення, яке буде повернуто, або ``None``, якщо подія спричинена винятковою ситуацією. Повернене значення функції трасування ігнорується.

source: ``'exception'``
uk: ``'виняток'``

source: An exception has occurred. The local trace function is called; *arg* is a tuple ``(exception, value, traceback)``; the return value specifies the new local trace function.
uk: Стався виняток. Викликається функція локального трасування; *arg* — це кортеж ``(виключення, значення, відстеження)``; значення, що повертається, визначає нову локальну функцію трасування.

source: ``'opcode'``
uk: ``'код операції'``

source: The interpreter is about to execute a new opcode (see :mod:`dis` for opcode details). The local trace function is called; *arg* is ``None``; the return value specifies the new local trace function. Per-opcode events are not emitted by default: they must be explicitly requested by setting :attr:`f_trace_opcodes` to :const:`True` on the frame.
uk: Інтерпретатор збирається виконати новий код операції (дивіться :mod:`dis` для деталей коду операції). Викликається функція локального трасування; *arg* є ``None``; значення, що повертається, визначає нову локальну функцію трасування. Події для кожного коду операції не генеруються за замовчуванням: їх потрібно явно запитати, встановивши для :attr:`f_trace_opcodes` значення :const:`True` у кадрі.

source: Note that as an exception is propagated down the chain of callers, an ``'exception'`` event is generated at each level.
uk: Зауважте, що коли виняткова ситуація поширюється вниз по ланцюжку абонентів, на кожному рівні генерується подія ``'виняток'``.

source: For more fine-grained usage, it's possible to set a trace function by assigning ``frame.f_trace = tracefunc`` explicitly, rather than relying on it being set indirectly via the return value from an already installed trace function. This is also required for activating the trace function on the current frame, which :func:`settrace` doesn't do. Note that in order for this to work, a global tracing function must have been installed with :func:`settrace` in order to enable the runtime tracing machinery, but it doesn't need to be the same tracing function (e.g. it could be a low overhead tracing function that simply returns ``None`` to disable itself immediately on each frame).
uk: Для більш точного використання можна встановити функцію трасування, призначивши ``frame.f_trace = tracefunc`` явно, замість того, щоб покладатися на її встановлення опосередковано через значення, яке повертає вже встановлена функція трасування. Це також потрібно для активації функції трасування поточного кадру, чого :func:`settrace` не робить. Зауважте, що для того, щоб це працювало, глобальна функція трасування має бути встановлена разом із :func:`settrace`, щоб увімкнути механізм трасування під час виконання, але це не обов’язково має бути та сама функція трасування (наприклад, це може бути функція відстеження низьких накладних витрат, яка просто повертає ``None``, щоб негайно вимкнути себе в кожному кадрі).

source: For more information on code and frame objects, refer to :ref:`types`.
uk: Для отримання додаткової інформації про код і об’єкти фрейму зверніться до :ref:`types`.

source: Raises an :ref:`auditing event <auditing>` ``sys.settrace`` with no arguments.
uk: Викликає :ref:`подію аудиту <auditing>` ``sys.settrace`` без аргументів.

source: The :func:`settrace` function is intended only for implementing debuggers, profilers, coverage tools and the like. Its behavior is part of the implementation platform, rather than part of the language definition, and thus may not be available in all Python implementations.
uk: Функція :func:`settrace` призначена лише для реалізації налагоджувачів, профайлерів, інструментів покриття тощо. Його поведінка є частиною платформи реалізації, а не частиною визначення мови, і тому може бути недоступною в усіх реалізаціях Python.

source: ``'opcode'`` event type added; :attr:`f_trace_lines` and :attr:`f_trace_opcodes` attributes added to frames
uk: додано тип події ``'opcode'``; Атрибути :attr:`f_trace_lines` і :attr:`f_trace_opcodes` додано до кадрів

source: Accepts two optional keyword arguments which are callables that accept an :term:`asynchronous generator iterator` as an argument. The *firstiter* callable will be called when an asynchronous generator is iterated for the first time. The *finalizer* will be called when an asynchronous generator is about to be garbage collected.
uk: Приймає два необов’язкові аргументи ключових слів, які викликаються та приймають :term:`asynchronous generator iterator` як аргумент. Викликаний *firstiter* буде викликаний, коли асинхронний генератор повторюється вперше. *Finalizer* буде викликано, коли асинхронний генератор збирається зібрати сміття.

source: Raises an :ref:`auditing event <auditing>` ``sys.set_asyncgen_hooks_firstiter`` with no arguments.
uk: Викликає :ref:`подію аудиту <auditing>` ``sys.set_asyncgen_hooks_firstiter`` без аргументів.

source: Raises an :ref:`auditing event <auditing>` ``sys.set_asyncgen_hooks_finalizer`` with no arguments.
uk: Викликає :ref:`подію аудиту <auditing>` ``sys.set_asyncgen_hooks_finalizer`` без аргументів.

source: Two auditing events are raised because the underlying API consists of two calls, each of which must raise its own event.
uk: Викликаються дві події аудиту, оскільки базовий API складається з двох викликів, кожен із яких має викликати власну подію.

source: See :pep:`525` for more details, and for a reference example of a *finalizer* method see the implementation of ``asyncio.Loop.shutdown_asyncgens`` in :source:`Lib/asyncio/base_events.py`
uk: Перегляньте :pep:`525` для отримання додаткової інформації, а для довідкового прикладу методу *finalizer* див. реалізацію ``asyncio.Loop.shutdown_asyncgens`` у :source:`Lib/asyncio/base_events.py`

source: Allows enabling or disabling coroutine origin tracking. When enabled, the ``cr_origin`` attribute on coroutine objects will contain a tuple of (filename, line number, function name) tuples describing the traceback where the coroutine object was created, with the most recent call first. When disabled, ``cr_origin`` will be None.
uk: Дозволяє вмикати або вимикати відстеження походження співпрограми. Якщо ввімкнено, атрибут ``cr_origin`` для об’єктів співпрограми міститиме кортеж кортежів (ім’я файлу, номер рядка, назва функції), що описує відстеження, де було створено об’єкт співпрограми, з останнім викликом першим. Якщо вимкнено, ``cr_origin`` матиме значення None.

source: To enable, pass a *depth* value greater than zero; this sets the number of frames whose information will be captured. To disable, pass set *depth* to zero.
uk: Щоб увімкнути, передайте значення *depth* більше нуля; це встановлює кількість кадрів, інформація яких буде захоплена. Щоб вимкнути, установіть *depth* на нуль.

source: This setting is thread-specific.
uk: Це налаштування залежить від потоку.

source: Changes the :term:`filesystem encoding and error handler` to 'mbcs' and 'replace' respectively, for consistency with versions of Python prior to 3.6.
uk: Змінює :term:`filesystem encoding and error handler` на 'mbcs' і 'replace' відповідно, для узгодженості з версіями Python до 3.6.

source: This is equivalent to defining the :envvar:`PYTHONLEGACYWINDOWSFSENCODING` environment variable before launching Python.
uk: Це еквівалентно визначенню змінної середовища :envvar:`PYTHONLEGACYWINDOWSFSENCODING` перед запуском Python.

source: See also :func:`sys.getfilesystemencoding` and :func:`sys.getfilesystemencodeerrors`.
uk: Дивіться також :func:`sys.getfilesystemencoding` і :func:`sys.getfilesystemencodeerrors`.

source: See :pep:`529` for more details.
uk: Дивіться :pep:`529` для більш детальної інформації.

source: :term:`File objects <file object>` used by the interpreter for standard input, output and errors:
uk: :term:`Файлові об’єкти <file object>`, які використовуються інтерпретатором для стандартного введення, виведення та помилок:

source: ``stdin`` is used for all interactive input (including calls to :func:`input`);
uk: ``stdin`` використовується для всього інтерактивного введення (включаючи виклики :func:`input`);

source: ``stdout`` is used for the output of :func:`print` and :term:`expression` statements and for the prompts of :func:`input`;
uk: ``stdout`` використовується для виведення операторів :func:`print` і :term:`expression` і для підказок :func:`input`;

source: The interpreter's own prompts and its error messages go to ``stderr``.
uk: Власні підказки інтерпретатора та його повідомлення про помилки надходять до ``stderr``.

source: These streams are regular :term:`text files <text file>` like those returned by the :func:`open` function. Their parameters are chosen as follows:
uk: Ці потоки є звичайними :term:`текстовими файлами <text file>`, як ті, що повертаються функцією :func:`open`. Їх параметри вибираються наступним чином:

source: The encoding and error handling are is initialized from :c:member:`PyConfig.stdio_encoding` and :c:member:`PyConfig.stdio_errors`.
uk: Кодування та обробка помилок ініціалізуються з :c:member:`PyConfig.stdio_encoding` і :c:member:`PyConfig.stdio_errors`.

source: On Windows, UTF-8 is used for the console device. Non-character devices such as disk files and pipes use the system locale encoding (i.e. the ANSI codepage). Non-console character devices such as NUL (i.e. where ``isatty()`` returns ``True``) use the value of the console input and output codepages at startup, respectively for stdin and stdout/stderr. This defaults to the system :term:`locale encoding` if the process is not initially attached to a console.
uk: У Windows для консольного пристрою використовується UTF-8. Несимвольні пристрої, такі як дискові файли та канали, використовують системне кодування локалі (тобто кодову сторінку ANSI). Неконсольні символьні пристрої, такі як NUL (тобто де ``isatty()`` повертає ``True``), використовують значення кодових сторінок консолі вводу та виводу під час запуску відповідно для stdin та stdout/stderr. За замовчуванням використовується системне :term:`locale encoding`, якщо процес спочатку не приєднано до консолі.

source: The special behaviour of the console can be overridden by setting the environment variable PYTHONLEGACYWINDOWSSTDIO before starting Python. In that case, the console codepages are used as for any other character device.
uk: Спеціальну поведінку консолі можна змінити, встановивши змінну середовища PYTHONLEGACYWINDOWSSTDIO перед запуском Python. У цьому випадку кодові сторінки консолі використовуються як для будь-якого іншого символьного пристрою.

source: Under all platforms, you can override the character encoding by setting the :envvar:`PYTHONIOENCODING` environment variable before starting Python or by using the new :option:`-X` ``utf8`` command line option and :envvar:`PYTHONUTF8` environment variable. However, for the Windows console, this only applies when :envvar:`PYTHONLEGACYWINDOWSSTDIO` is also set.
uk: На всіх платформах ви можете змінити кодування символів, встановивши змінну середовища :envvar:`PYTHONIOENCODING` перед запуском Python або використовуючи новий параметр командного рядка :option:`-X` ``utf8`` і :envvar:`PYTHONUTF8` змінна середовища. Однак для консолі Windows це стосується лише коли :envvar:`PYTHONLEGACYWINDOWSSTDIO` також встановлено.
