Repository: seanpm2001/python-docs-uk
Catalog: library/sys.po
Languages: uk

source: This function wraps the Win32 :c:func:`GetVersionEx` function; see the Microsoft documentation on :c:func:`OSVERSIONINFOEX` for more information about these fields.
uk: Ця функція обертає функцію Win32 :c:func:`GetVersionEx`; див. документацію Microsoft на :c:func:`OSVERSIONINFOEX` для отримання додаткової інформації про ці поля.

source: *platform_version* returns the major version, minor version and build number of the current operating system, rather than the version that is being emulated for the process. It is intended for use in logging rather than for feature detection.
uk: *platform_version* повертає основну версію, проміжну версію та номер збірки поточної операційної системи, а не версію, яка емулюється для процесу. Він призначений для використання в журналі, а не для виявлення функцій.

source: *platform_version* derives the version from kernel32.dll which can be of a different version than the OS version. Please use :mod:`platform` module for achieving accurate OS version.
uk: *platform_version* отримує версію з kernel32.dll, версія якої може відрізнятися від версії ОС. Будь ласка, використовуйте модуль :mod:`platform` для отримання точної версії ОС.

source: Changed to a named tuple and added *service_pack_minor*, *service_pack_major*, *suite_mask*, and *product_type*.
uk: Змінено на іменований кортеж і додано *service_pack_minor*, *service_pack_major*, *suite_mask* і *product_type*.

source: Added *platform_version*
uk: Додано *версію_платформи*

source: See :pep:`525` for more details.
uk: Дивіться :pep:`525` для більш детальної інформації.

source: This function has been added on a provisional basis (see :pep:`411` for details.)
uk: Цю функцію додано тимчасово (докладніше див. :pep:`411`).

source: Get the current coroutine origin tracking depth, as set by :func:`set_coroutine_origin_tracking_depth`.
uk: Отримати поточну глибину відстеження джерела співпрограми, встановлену :func:`set_coroutine_origin_tracking_depth`.

source: This function has been added on a provisional basis (see :pep:`411` for details.) Use it only for debugging purposes.
uk: Цю функцію додано на тимчасовій основі (докладніше див. :pep:`411`). Використовуйте її лише для налагодження.

source: A :term:`named tuple` giving parameters of the numeric hash implementation. For more details about hashing of numeric types, see :ref:`numeric-hash`.
uk: :term:`named tuple`, що надає параметри реалізації числового хешу. Докладніше про хешування числових типів див. :ref:`numeric-hash`.

source: width in bits used for hash values
uk: ширина в бітах, яка використовується для хеш-значень

source: prime modulus P used for numeric hash scheme
uk: простий модуль P, який використовується для числової хеш-схеми

source: hash value returned for a positive infinity
uk: хеш-значення, що повертається для позитивної нескінченності

source: (this attribute is no longer used)
uk: (цей атрибут більше не використовується)

source: multiplier used for the imaginary part of a complex number
uk: множник, який використовується для уявної частини комплексного числа

source: name of the algorithm for hashing of str, bytes, and memoryview
uk: назва алгоритму хешування str, bytes і memoryview

source: internal output size of the hash algorithm
uk: внутрішній вихідний розмір алгоритму хешування

source: size of the seed key of the hash algorithm
uk: розмір початкового ключа геш-алгоритму

source: Added *algorithm*, *hash_bits* and *seed_bits*
uk: Додано *algorithm*, *hash_bits* і *seed_bits*

source: The version number encoded as a single integer. This is guaranteed to increase with each version, including proper support for non-production releases. For example, to test that the Python interpreter is at least version 1.5.2, use::
uk: Номер версії, закодований як одне ціле число. Це гарантовано зростатиме з кожною версією, включаючи належну підтримку невиробничих випусків. Наприклад, щоб перевірити, що інтерпретатор Python має принаймні версію 1.5.2, використовуйте::

source: This is called ``hexversion`` since it only really looks meaningful when viewed as the result of passing it to the built-in :func:`hex` function. The :term:`named tuple` :data:`sys.version_info` may be used for a more human-friendly encoding of the same information.
uk: Це називається ``hexversion``, оскільки воно справді виглядає значущим лише тоді, коли розглядається як результат передачі його у вбудовану функцію :func:`hex`. :term:`named tuple` :data:`sys.version_info` можна використовувати для більш зручного для людини кодування тієї самої інформації.

source: More details of ``hexversion`` can be found at :ref:`apiabiversion`.
uk: Більш детальну інформацію про ``hexversion`` можна знайти на :ref:`apiabiversion`.

source: An object containing information about the implementation of the currently running Python interpreter. The following attributes are required to exist in all Python implementations.
uk: Об’єкт, що містить інформацію про реалізацію поточного інтерпретатора Python. Наступні атрибути повинні існувати в усіх реалізаціях Python.

source: *name* is the implementation's identifier, e.g. ``'cpython'``. The actual string is defined by the Python implementation, but it is guaranteed to be lower case.
uk: *ім’я* – це ідентифікатор реалізації, напр. ``'cpython'``. Фактичний рядок визначається реалізацією Python, але він гарантовано буде написаний у нижньому регістрі.

source: *version* is a named tuple, in the same format as :data:`sys.version_info`. It represents the version of the Python *implementation*. This has a distinct meaning from the specific version of the Python *language* to which the currently running interpreter conforms, which ``sys.version_info`` represents. For example, for PyPy 1.8 ``sys.implementation.version`` might be ``sys.version_info(1, 8, 0, 'final', 0)``, whereas ``sys.version_info`` would be ``sys.version_info(2, 7, 2, 'final', 0)``. For CPython they are the same value, since it is the reference implementation.
uk: *version* — це іменований кортеж у тому самому форматі, що й :data:`sys.version_info`. Він представляє версію *реалізації* Python. Це має відмінне значення від конкретної версії *мови* Python, якій відповідає поточний інтерпретатор, який представляє ``sys.version_info``. Наприклад, для PyPy 1.8 ``sys.implementation.version`` може бути ``sys.version_info(1, 8, 0, 'final', 0)``, тоді як ``sys.version_info`` буде ``sys.version_info(2, 7, 2, 'final', 0)``. Для CPython вони однакові, оскільки це еталонна реалізація.

source: *hexversion* is the implementation version in hexadecimal format, like :data:`sys.hexversion`.
uk: *hexversion* — це версія реалізації в шістнадцятковому форматі, наприклад :data:`sys.hexversion`.

source: *cache_tag* is the tag used by the import machinery in the filenames of cached modules. By convention, it would be a composite of the implementation's name and version, like ``'cpython-33'``. However, a Python implementation may use some other value if appropriate. If ``cache_tag`` is set to ``None``, it indicates that module caching should be disabled.
uk: *cache_tag* — це тег, який використовується механізмом імпорту в назвах файлів кешованих модулів. Відповідно до домовленості, це буде складене ім’я реалізації та версія, наприклад ``'cpython-33``. Однак реалізація Python може використовувати інше значення, якщо це доречно. Якщо ``cache_tag`` має значення ``None``, це вказує на те, що кешування модуля має бути вимкнено.

source: :data:`sys.implementation` may contain additional attributes specific to the Python implementation. These non-standard attributes must start with an underscore, and are not described here. Regardless of its contents, :data:`sys.implementation` will not change during a run of the interpreter, nor between implementation versions. (It may change between Python language versions, however.) See :pep:`421` for more information.
uk: :data:`sys.implementation` може містити додаткові атрибути, характерні для реалізації Python. Ці нестандартні атрибути мають починатися з підкреслення та тут не описані. Незалежно від його вмісту, :data:`sys.implementation` не змінюватиметься ні під час роботи інтерпретатора, ні між версіями реалізації. (Однак він може змінюватися між версіями мови Python.) Додаткову інформацію див. :pep:`421`.

source: The addition of new required attributes must go through the normal PEP process. See :pep:`421` for more information.
uk: Додавання нових необхідних атрибутів має проходити через звичайний процес PEP. Перегляньте :pep:`421` для отримання додаткової інформації.

source: A :term:`named tuple` that holds information about Python's internal representation of integers. The attributes are read only.
uk: :term:`named tuple`, який містить інформацію про внутрішнє представлення цілих чисел у Python. Атрибути доступні лише для читання.

source: :const:`bits_per_digit`
uk: :const:`біт_на_цифру`

source: number of bits held in each digit. Python integers are stored internally in base ``2**int_info.bits_per_digit``
uk: кількість бітів, що містяться в кожній цифрі. Цілі числа Python зберігаються внутрішньо в базі ``2**int_info.bits_per_digit``

source: size in bytes of the C type used to represent a digit
uk: розмір у байтах типу C, який використовується для представлення цифри

source: When this attribute exists, its value is automatically called (with no arguments) when the interpreter is launched in :ref:`interactive mode <tut-interactive>`. This is done after the :envvar:`PYTHONSTARTUP` file is read, so that you can set this hook there. The :mod:`site` module :ref:`sets this <rlcompleter-config>`.
uk: Якщо цей атрибут існує, його значення викликається автоматично (без аргументів), коли інтерпретатор запускається в :ref:`інтерактивному режимі <tut-interactive>`. Це робиться після того, як файл :envvar:`PYTHONSTARTUP` буде прочитано, щоб ви могли встановити цей хук там. Модуль :mod:`site` :ref:`встановлює цей <rlcompleter-config>`.

source: Raises an :ref:`auditing event <auditing>` ``cpython.run_interactivehook`` with argument ``hook``.
uk: Викликає :ref:`подію аудиту <auditing>` ``cpython.run_interactivehook`` з аргументом ``hook``.

source: Raises an :ref:`auditing event <auditing>` ``cpython.run_interactivehook`` with the hook object as the argument when the hook is called on startup.
uk: Викликає :ref:`подію аудиту <auditing>` ``cpython.run_interactivehook`` з об'єктом підхоплення як аргумент, коли підхоплення викликається під час запуску.

source: Enter *string* in the table of "interned" strings and return the interned string -- which is *string* itself or a copy. Interning strings is useful to gain a little performance on dictionary lookup -- if the keys in a dictionary are interned, and the lookup key is interned, the key comparisons (after hashing) can be done by a pointer compare instead of a string compare. Normally, the names used in Python programs are automatically interned, and the dictionaries used to hold module, class or instance attributes have interned keys.
uk: Введіть *рядок* у таблицю "інтернованих" рядків і поверніть інтернований рядок, який є самим *рядком* або копією. Інтернування рядків корисне для підвищення продуктивності пошуку в словнику — якщо ключі в словнику інтерновані, а ключ пошуку інтернований, порівняння ключів (після хешування) можна виконувати за допомогою порівняння вказівників замість порівняння рядків. Зазвичай імена, які використовуються в програмах Python, автоматично інтернуються, а словники, які використовуються для зберігання атрибутів модуля, класу чи екземпляра, мають інтерновані ключі.

source: Interned strings are not immortal; you must keep a reference to the return value of :func:`intern` around to benefit from it.
uk: Внутрішні рядки не є безсмертними; ви повинні зберігати посилання на значення, що повертається :func:`intern`, щоб отримати від нього користь.

source: Return :const:`True` if the Python interpreter is :term:`shutting down <interpreter shutdown>`, :const:`False` otherwise.
uk: Повертає :const:`True`, якщо інтерпретатор Python :term:`вимикає <interpreter shutdown>`, :const:`False` інакше.

source: These three variables are not always defined; they are set when an exception is not handled and the interpreter prints an error message and a stack traceback. Their intended use is to allow an interactive user to import a debugger module and engage in post-mortem debugging without having to re-execute the command that caused the error. (Typical use is ``import pdb; pdb.pm()`` to enter the post-mortem debugger; see :mod:`pdb` module for more information.)
uk: Ці три змінні не завжди визначені; вони встановлюються, коли виняток не обробляється, і інтерпретатор друкує повідомлення про помилку та стек. Їх призначення полягає в тому, щоб дозволити інтерактивному користувачеві імпортувати модуль налагоджувача та брати участь у посмертному налагодженні без необхідності повторного виконання команди, яка спричинила помилку. (Типовим використанням є ``import pdb; pdb.pm()`` для входу в посмертний налагоджувач; див. модуль :mod:`pdb` для отримання додаткової інформації.)

source: The meaning of the variables is the same as that of the return values from :func:`exc_info` above.
uk: Значення змінних таке ж, як значення, що повертаються з :func:`exc_info` вище.

source: An integer giving the maximum value a variable of type :c:type:`Py_ssize_t` can take. It's usually ``2**31 - 1`` on a 32-bit platform and ``2**63 - 1`` on a 64-bit platform.
uk: Ціле число, яке дає максимальне значення, яке може приймати змінна типу :c:type:`Py_ssize_t`. Зазвичай це ``2**31 - 1`` на 32-розрядній платформі та ``2**63 - 1`` на 64-розрядній платформі.

source: An integer giving the value of the largest Unicode code point, i.e. ``1114111`` (``0x10FFFF`` in hexadecimal).
uk: Ціле число, яке вказує значення найбільшої кодової точки Юнікоду, наприклад ``1114111`` (``0x10FFFF`` у шістнадцятковій системі).

source: Before :pep:`393`, ``sys.maxunicode`` used to be either ``0xFFFF`` or ``0x10FFFF``, depending on the configuration option that specified whether Unicode characters were stored as UCS-2 or UCS-4.
uk: До :pep:`393`, ``sys.maxunicode`` використовувався або ``0xFFFF``, або ``0x10FFFF``, залежно від параметра конфігурації, який вказував, чи зберігаються символи Unicode як UCS-2 або UCS- 4.

source: The abstract base class defining the interface of finder objects on :data:`meta_path`.
uk: Абстрактний базовий клас, що визначає інтерфейс об’єктів пошуку на :data:`meta_path`.

source: The concrete class which :meth:`~importlib.abc.MetaPathFinder.find_spec` should return instances of.
uk: Конкретний клас, який :meth:`~importlib.abc.MetaPathFinder.find_spec` має повертати екземпляри.

source: :term:`Module specs <module spec>` were introduced in Python 3.4, by :pep:`451`. Earlier versions of Python looked for a method called :meth:`~importlib.abc.MetaPathFinder.find_module`. This is still called as a fallback if a :data:`meta_path` entry doesn't have a :meth:`~importlib.abc.MetaPathFinder.find_spec` method.
uk: :term:`Специфікації модуля <module spec>` були представлені в Python 3.4 :pep:`451`. Попередні версії Python шукали метод під назвою :meth:`~importlib.abc.MetaPathFinder.find_module`. Це все ще викликається як запасний, якщо запис :data:`meta_path` не має методу :meth:`~importlib.abc.MetaPathFinder.find_spec`.

source: This is a dictionary that maps module names to modules which have already been loaded. This can be manipulated to force reloading of modules and other tricks. However, replacing the dictionary will not necessarily work as expected and deleting essential items from the dictionary may cause Python to fail. If you want to iterate over this global dictionary always use ``sys.modules.copy()`` or ``tuple(sys.modules)`` to avoid exceptions as its size may change during iteration as a side effect of code or activity in other threads.
uk: Це словник, який зіставляє назви модулів із уже завантаженими модулями. Цим можна маніпулювати, щоб примусово перезавантажувати модулі та виконувати інші трюки. Однак заміна словника не обов’язково працюватиме належним чином, а видалення важливих елементів зі словника може призвести до збою Python. Якщо ви хочете повторити цей глобальний словник, завжди використовуйте ``sys.modules.copy()`` або ``tuple(sys.modules)``, щоб уникнути винятків, оскільки його розмір може змінюватися під час ітерації як побічний ефект коду або діяльність в інших потоках.

source: The list of the original command line arguments passed to the Python executable.
uk: Список оригінальних аргументів командного рядка, переданих у виконуваний файл Python.

source: See also :data:`sys.argv`.
uk: Дивіться також :data:`sys.argv`.

source: A list of strings that specifies the search path for modules. Initialized from the environment variable :envvar:`PYTHONPATH`, plus an installation-dependent default.
uk: Список рядків, який визначає шлях пошуку для модулів. Ініціалізується зі змінної середовища :envvar:`PYTHONPATH`, плюс значення за умовчанням, що залежить від встановлення.

source: Module :mod:`site` This describes how to use .pth files to extend :data:`sys.path`.
uk: Модуль :mod:`site` Тут описано, як використовувати файли .pth для розширення :data:`sys.path`.

source: A list of callables that take a path argument to try to create a :term:`finder` for the path. If a finder can be created, it is to be returned by the callable, else raise :exc:`ImportError`.
uk: Список викликів, які приймають аргумент path, щоб спробувати створити :term:`finder` для шляху. Якщо засіб пошуку можна створити, його має повернути виклик, інакше викликається :exc:`ImportError`.

source: Originally specified in :pep:`302`.
uk: Спочатку вказано в :pep:`302`.

source: A dictionary acting as a cache for :term:`finder` objects. The keys are paths that have been passed to :data:`sys.path_hooks` and the values are the finders that are found. If a path is a valid file system path but no finder is found on :data:`sys.path_hooks` then ``None`` is stored.
uk: Словник, що діє як кеш для об’єктів :term:`finder`. Ключі – це шляхи, які були передані до :data:`sys.path_hooks`, а значення – це знайдені шукачі. Якщо шлях є дійсним шляхом у файловій системі, але в :data:`sys.path_hooks` не знайдено засобу пошуку, тоді зберігається значення "Немає".

source: ``None`` is stored instead of :class:`imp.NullImporter` when no finder is found.
uk: ``None`` зберігається замість :class:`imp.NullImporter`, якщо шукач не знайдено.

source: This string contains a platform identifier that can be used to append platform-specific components to :data:`sys.path`, for instance.
uk: Цей рядок містить ідентифікатор платформи, який можна використовувати, наприклад, для додавання специфічних для платформи компонентів до :data:`sys.path`.

source: For Unix systems, except on Linux and AIX, this is the lowercased OS name as returned by ``uname -s`` with the first part of the version as returned by ``uname -r`` appended, e.g. ``'sunos5'`` or ``'freebsd8'``, *at the time when Python was built*. Unless you want to test for a specific system version, it is therefore recommended to use the following idiom::
uk: Для систем Unix, за винятком Linux і AIX, це назва ОС у нижньому регістрі, яку повертає ``uname -s`` з додаванням першої частини версії, яку повертає ``uname -r``, наприклад. ``'sunos5'`` або ``'freebsd8'``, *на час створення Python*. Якщо ви не бажаєте перевірити конкретну версію системи, тому рекомендується використовувати наступну ідіому:

source: For other systems, the values are:
uk: Для інших систем значення:

source: System
uk: система

source: ``platform`` value
uk: значення ``платформи``

source: Windows
uk: вікна

source: ``'darwin'``
uk: ``''дарвін'``

source: On Linux, :attr:`sys.platform` doesn't contain the major version anymore. It is always ``'linux'``, instead of ``'linux2'`` or ``'linux3'``. Since older Python versions include the version number, it is recommended to always use the ``startswith`` idiom presented above.
uk: У Linux :attr:`sys.platform` більше не містить основної версії. Це завжди ``'linux'`` замість ``'linux2'`` або ``'linux3'``. Оскільки старіші версії Python включають номер версії, рекомендується завжди використовувати ідіому ``startswith``, представлену вище.

source: On AIX, :attr:`sys.platform` doesn't contain the major version anymore. It is always ``'aix'``, instead of ``'aix5'`` or ``'aix7'``. Since older Python versions include the version number, it is recommended to always use the ``startswith`` idiom presented above.
uk: В AIX :attr:`sys.platform` більше не містить основної версії. Це завжди ``'aix``, замість ``'aix5'`` або ``'aix7'``. Оскільки старіші версії Python включають номер версії, рекомендується завжди використовувати ідіому ``startswith``, представлену вище.

source: :attr:`os.name` has a coarser granularity. :func:`os.uname` gives system-dependent version information.
uk: :attr:`os.name` має більш грубу деталізацію. :func:`os.uname` надає інформацію про версію, що залежить від системи.

source: The :mod:`platform` module provides detailed checks for the system's identity.
uk: Модуль :mod:`platform` забезпечує детальну перевірку ідентичності системи.

source: Name of the platform-specific library directory. It is used to build the path of standard library and the paths of installed extension modules.
uk: Назва каталогу бібліотеки для конкретної платформи. Використовується для побудови шляху стандартної бібліотеки та шляхів встановлених модулів розширення.

source: It is equal to ``"lib"`` on most platforms. On Fedora and SuSE, it is equal to ``"lib64"`` on 64-bit platforms which gives the following ``sys.path`` paths (where ``X.Y`` is the Python ``major.minor`` version):
uk: На більшості платформ він дорівнює ``"lib"``. У Fedora та SuSE він дорівнює ``"lib64"`` на 64-розрядних платформах, що дає такі шляхи ``sys.path`` (де ``X.Y`` є ``major.minor`` Python версія):

source: ``/usr/lib64/pythonX.Y/``: Standard library (like ``os.py`` of the :mod:`os` module)
uk: ``/usr/lib64/pythonX.Y/``: Стандартна бібліотека (наприклад, ``os.py`` модуля :mod:`os`)

source: ``/usr/lib64/pythonX.Y/lib-dynload/``: C extension modules of the standard library (like the :mod:`errno` module, the exact filename is platform specific)
uk: ``/usr/lib64/pythonX.Y/lib-dynload/``: модулі розширення C стандартної бібліотеки (наприклад, модуль :mod:`errno`, точна назва файлу залежить від платформи)

source: ``/usr/lib/pythonX.Y/site-packages/`` (always use ``lib``, not :data:`sys.platlibdir`): Third-party modules
uk: ``/usr/lib/pythonX.Y/site-packages/`` (завжди використовуйте ``lib``, а не :data:`sys.platlibdir`): сторонні модулі

source: ``/usr/lib64/pythonX.Y/site-packages/``: C extension modules of third-party packages
uk: ``/usr/lib64/pythonX.Y/site-packages/``: модулі розширення C пакетів сторонніх розробників

source: A string giving the site-specific directory prefix where the platform independent Python files are installed; on Unix, the default is ``'/usr/local'``. This can be set at build time with the ``--prefix`` argument to the :program:`configure` script. See :ref:`installation_paths` for derived paths.
uk: Рядок, що містить префікс каталогу сайту, де встановлено незалежні від платформи файли Python; в Unix типовим є ``'/usr/local'``. Це можна встановити під час збирання за допомогою аргументу ``--prefix`` сценарію :program:`configure`. Перегляньте :ref:`installation_paths` для похідних шляхів.
