Repository: seanpm2001/python-docs-uk
Catalog: library/sys.po
Languages: uk

source: When interactive, the ``stdout`` stream is line-buffered. Otherwise, it is block-buffered like regular text files. The ``stderr`` stream is line-buffered in both cases. You can make both streams unbuffered by passing the :option:`-u` command-line option or setting the :envvar:`PYTHONUNBUFFERED` environment variable.
uk: У інтерактивному режимі потік ``stdout`` буферизується в рядках. В іншому випадку він буферизується блоками, як звичайні текстові файли. Потік ``stderr`` буферизується в обох випадках. Ви можете зробити обидва потоки небуферизованими, передавши параметр командного рядка :option:`-u` або встановивши змінну середовища :envvar:`PYTHONUNBUFFERED`.

source: Non-interactive ``stderr`` is now line-buffered instead of fully buffered.
uk: Неінтерактивний ``stderr`` тепер буферизується рядками замість повної буферизації.

source: To write or read binary data from/to the standard streams, use the underlying binary :data:`~io.TextIOBase.buffer` object. For example, to write bytes to :data:`stdout`, use ``sys.stdout.buffer.write(b'abc')``.
uk: Щоб записати або прочитати двійкові дані з/до стандартних потоків, використовуйте базовий двійковий об’єкт :data:`~io.TextIOBase.buffer`. Наприклад, щоб записати байти в :data:`stdout`, використовуйте ``sys.stdout.buffer.write(b'abc')``.

source: However, if you are writing a library (and do not control in which context its code will be executed), be aware that the standard streams may be replaced with file-like objects like :class:`io.StringIO` which do not support the :attr:`~io.BufferedIOBase.buffer` attribute.
uk: Однак, якщо ви пишете бібліотеку (і не контролюєте, у якому контексті виконуватиметься її код), майте на увазі, що стандартні потоки можуть бути замінені файлоподібними об’єктами, такими як :class:`io.StringIO`, які не підтримують атрибут :attr:`~io.BufferedIOBase.buffer`.

source: These objects contain the original values of ``stdin``, ``stderr`` and ``stdout`` at the start of the program. They are used during finalization, and could be useful to print to the actual standard stream no matter if the ``sys.std*`` object has been redirected.
uk: Ці об’єкти містять вихідні значення ``stdin``, ``stderr`` і ``stdout`` на початку програми. Вони використовуються під час фіналізації та можуть бути корисними для друку у фактичний стандартний потік незалежно від того, чи було перенаправлено об’єкт ``sys.std*``.

source: It can also be used to restore the actual files to known working file objects in case they have been overwritten with a broken object. However, the preferred way to do this is to explicitly save the previous stream before replacing it, and restore the saved object.
uk: Його також можна використовувати для відновлення фактичних файлів до відомих робочих файлових об’єктів, якщо вони були перезаписані зламаним об’єктом. Однак кращим способом зробити це є явне збереження попереднього потоку перед його заміною та відновлення збереженого об’єкта.

source: Under some conditions ``stdin``, ``stdout`` and ``stderr`` as well as the original values ``__stdin__``, ``__stdout__`` and ``__stderr__`` can be ``None``. It is usually the case for Windows GUI apps that aren't connected to a console and Python apps started with :program:`pythonw`.
uk: За деяких умов ``stdin``, ``stdout`` і ``stderr``, а також вихідні значення ``__stdin__``, ``__stdout__`` і ``__stderr__`` можуть бути ``None`` . Зазвичай це стосується програм графічного інтерфейсу Windows, які не підключені до консолі, і програм Python, запущених за допомогою :program:`pythonw`.

source: A frozenset of strings containing the names of standard library modules.
uk: Заморожений набір рядків, що містять назви модулів стандартної бібліотеки.

source: It is the same on all platforms. Modules which are not available on some platforms and modules disabled at Python build are also listed. All module kinds are listed: pure Python, built-in, frozen and extension modules. Test modules are excluded.
uk: Це однаково на всіх платформах. Також перераховано модулі, які недоступні на деяких платформах, і модулі, вимкнені під час збірки Python. Перераховано всі види модулів: чистий Python, вбудовані, заморожені та модулі розширення. Тестові модулі не включені.

source: For packages, only the main package is listed: sub-packages and sub-modules are not listed. For example, the ``email`` package is listed, but the ``email.mime`` sub-package and the ``email.message`` sub-module are not listed.
uk: Для пакетів вказано лише основний пакет: підпакети та підмодулі не вказані. Наприклад, у списку є пакет ``email``, але підпакет ``email.mime`` і підмодуль ``email.message`` відсутні.

source: See also the :attr:`sys.builtin_module_names` list.
uk: Дивіться також список :attr:`sys.builtin_module_names`.

source: A :term:`named tuple` holding information about the thread implementation.
uk: :term:`named tuple`, що містить інформацію про реалізацію потоку.

source: Name of the thread implementation:
uk: Назва реалізації потоку:

source: ``'nt'``: Windows threads
uk: ``'nt''``: потоки Windows

source: ``'pthread'``: POSIX threads
uk: ``'pthread'``: потоки POSIX

source: ``'solaris'``: Solaris threads
uk: ``'solaris'``: потоки Solaris

source: Name of the lock implementation:
uk: Назва реалізації блокування:

source: ``'semaphore'``: a lock uses a semaphore
uk: ``'semaphore'``: блокування використовує семафор

source: ``'mutex+cond'``: a lock uses a mutex and a condition variable
uk: ``'mutex+cond'``: блокування використовує м'ютекс і змінну умови

source: ``None`` if this information is unknown
uk: ``None``, якщо ця інформація невідома

source: Name and version of the thread library. It is a string, or ``None`` if this information is unknown.
uk: Назва та версія бібліотеки потоків. Це рядок або ``None``, якщо ця інформація невідома.

source: When this variable is set to an integer value, it determines the maximum number of levels of traceback information printed when an unhandled exception occurs. The default is ``1000``. When set to ``0`` or less, all traceback information is suppressed and only the exception type and value are printed.
uk: Якщо для цієї змінної встановлено ціле число, вона визначає максимальну кількість рівнів інформації про відстеження, що друкується, коли виникає необроблена виняткова ситуація. Типовим значенням є ``1000``. Якщо встановлено значення ``0`` або менше, уся інформація зворотного відстеження пригнічується, і друкуються лише тип винятку та значення.

source: Handle an unraisable exception.
uk: Обробляти неможливий виняток.

source: Called when an exception has occurred but there is no way for Python to handle it. For example, when a destructor raises an exception or during garbage collection (:func:`gc.collect`).
uk: Викликається, коли сталася виняткова ситуація, але Python не може її впоратися. Наприклад, коли деструктор викликає виняток або під час збирання сміття (:func:`gc.collect`).

source: The *unraisable* argument has the following attributes:
uk: Аргумент *unraisable* має такі атрибути:

source: *exc_type*: Exception type.
uk: *exc_type*: Тип винятку.

source: *exc_value*: Exception value, can be ``None``.
uk: *exc_value*: значення винятку, може бути ``None``.

source: *exc_traceback*: Exception traceback, can be ``None``.
uk: *exc_traceback*: Зворотне відстеження винятків, може бути ``None``.

source: *err_msg*: Error message, can be ``None``.
uk: *err_msg*: повідомлення про помилку, може бути ``None``.

source: *object*: Object causing the exception, can be ``None``.
uk: *object*: Об’єкт, що викликає виняток, може бути ``None``.

source: The default hook formats *err_msg* and *object* as: ``f'{err_msg}: {object!r}'``; use "Exception ignored in" error message if *err_msg* is ``None``.
uk: Типовий хук форматує *err_msg* і *object* як: ``f'{err_msg}: {object!r}''``; використовуйте повідомлення про помилку "Виняток проігноровано", якщо *err_msg* має значення ``None``.

source: :func:`sys.unraisablehook` can be overridden to control how unraisable exceptions are handled.
uk: :func:`sys.unraisablehook` можна перевизначити, щоб керувати обробкою винятків, які не підлягають виклику.

source: Storing *exc_value* using a custom hook can create a reference cycle. It should be cleared explicitly to break the reference cycle when the exception is no longer needed.
uk: Зберігання *exc_value* за допомогою спеціального хука може створити еталонний цикл. Його слід явно очистити, щоб розірвати цикл посилання, коли виняток більше не потрібен.

source: Storing *object* using a custom hook can resurrect it if it is set to an object which is being finalized. Avoid storing *object* after the custom hook completes to avoid resurrecting objects.
uk: Зберігання *об’єкта* за допомогою спеціального хука може воскресити його, якщо для нього встановлено об’єкт, який завершується. Уникайте зберігання *object* після завершення власного хука, щоб уникнути відновлення об’єктів.

source: See also :func:`excepthook` which handles uncaught exceptions.
uk: Дивіться також :func:`excepthook`, який обробляє неперехоплені винятки.

source: Raise an auditing event ``sys.unraisablehook`` with arguments ``hook``, ``unraisable`` when an exception that cannot be handled occurs. The ``unraisable`` object is the same as what will be passed to the hook. If no hook has been set, ``hook`` may be ``None``.
uk: Викликати подію аудиту ``sys.unraisablehook`` з аргументами ``hook``, ``unraisable``, коли виникає виняткова ситуація, яку неможливо обробити. Об’єкт ``unraisable`` є таким самим, як і те, що буде передано в гачок. Якщо хук не встановлено, ``hook`` може мати значення ``None``.

source: A string containing the version number of the Python interpreter plus additional information on the build number and compiler used. This string is displayed when the interactive interpreter is started. Do not extract version information out of it, rather, use :data:`version_info` and the functions provided by the :mod:`platform` module.
uk: Рядок, що містить номер версії інтерпретатора Python, а також додаткову інформацію про номер збірки та використаний компілятор. Цей рядок відображається під час запуску інтерактивного інтерпретатора. Не витягуйте з нього інформацію про версію, скоріше використовуйте :data:`version_info` і функції, надані модулем :mod:`platform`.

source: The C API version for this interpreter. Programmers may find this useful when debugging version conflicts between Python and extension modules.
uk: Версія C API для цього інтерпретатора. Програмісти можуть вважати це корисним під час усунення конфліктів версій між Python і модулями розширення.

source: A tuple containing the five components of the version number: *major*, *minor*, *micro*, *releaselevel*, and *serial*. All values except *releaselevel* are integers; the release level is ``'alpha'``, ``'beta'``, ``'candidate'``, or ``'final'``. The ``version_info`` value corresponding to the Python version 2.0 is ``(2, 0, 0, 'final', 0)``. The components can also be accessed by name, so ``sys.version_info[0]`` is equivalent to ``sys.version_info.major`` and so on.
uk: Кортеж, що містить п’ять компонентів номера версії: *major*, *minor*, *micro*, *releaselevel* і *serial*. Усі значення, крім *releaselevel*, є цілими числами; рівень випуску - ``'альфа'``, ``'бета'``, ``'кандидат'`` або ``'фінальний'``. Значення ``version_info``, що відповідає версії Python 2.0, є ``(2, 0, 0, 'final', 0)``. До компонентів також можна отримати доступ за іменем, тому ``sys.version_info[0]`` еквівалентно ``sys.version_info.major`` і так далі.

source: Added named component attributes.
uk: Додано іменовані атрибути компонента.

source: This is an implementation detail of the warnings framework; do not modify this value. Refer to the :mod:`warnings` module for more information on the warnings framework.
uk: Це деталь реалізації структури попереджень; не змінюйте це значення. Зверніться до модуля :mod:`warnings`, щоб дізнатися більше про структуру попереджень.

source: The version number used to form registry keys on Windows platforms. This is stored as string resource 1000 in the Python DLL. The value is normally the first three characters of :const:`version`. It is provided in the :mod:`sys` module for informational purposes; modifying this value has no effect on the registry keys used by Python.
uk: Номер версії, який використовується для формування розділів реєстру на платформах Windows. Це зберігається як рядковий ресурс 1000 у DLL Python. Зазвичай значенням є перші три символи :const:`version`. Він надається в модулі :mod:`sys` з інформаційною метою; зміна цього значення не впливає на ключі реєстру, які використовує Python.

source: A dictionary of the various implementation-specific flags passed through the :option:`-X` command-line option. Option names are either mapped to their values, if given explicitly, or to :const:`True`. Example:
uk: Словник різних прапорів, що стосуються реалізації, що передаються через параметр командного рядка :option:`-X`. Назви параметрів або зіставляються з їхніми значеннями, якщо вказано явно, або з :const:`True`. приклад:

source: This is a CPython-specific way of accessing options passed through :option:`-X`. Other implementations may export them through other means, or not at all.
uk: Це специфічний для CPython спосіб доступу до параметрів, що передаються через :option:`-X`. Інші реалізації можуть експортувати їх іншими засобами або взагалі не експортувати.

source: Citations
uk: Цитування
