Repository: seanpm2001/python-docs-uk
Catalog: library/tkinter.tix.po
Languages: uk

source: Query or modify the configuration options of the Tix application context. If no option is specified, returns a dictionary all of the available options. If option is specified with no value, then the method returns a list describing the one named option (this list will be identical to the corresponding sublist of the value returned if no option is specified). If one or more option-value pairs are specified, then the method modifies the given option(s) to have the given value(s); in this case the method returns an empty string. Option may be any of the configuration options.
uk: Запитайте або змініть параметри конфігурації контексту програми Tix. Якщо параметр не вказано, повертає словник усіх доступних параметрів. Якщо параметр вказано без значення, тоді метод повертає список, що описує один названий параметр (цей список буде ідентичним відповідному підсписку повернутого значення, якщо параметр не вказано). Якщо вказано одну або більше пар опція-значення, тоді метод змінює надану опцію(-и), щоб мати задане значення(-а); у цьому випадку метод повертає порожній рядок. Опція може бути будь-якою з опцій конфігурації.

source: Returns the current value of the configuration option given by *option*. Option may be any of the configuration options.
uk: Повертає поточне значення параметра конфігурації, заданого *option*. Опція може бути будь-якою з опцій конфігурації.

source: Locates a bitmap file of the name ``name.xpm`` or ``name`` in one of the bitmap directories (see the :meth:`tix_addbitmapdir` method). By using :meth:`tix_getbitmap`, you can avoid hard coding the pathnames of the bitmap files in your application. When successful, it returns the complete pathname of the bitmap file, prefixed with the character ``@``. The returned value can be used to configure the ``bitmap`` option of the Tk and Tix widgets.
uk: Знаходить растровий файл із назвою ``name.xpm`` або ``name`` в одному з каталогів бітового зображення (див. метод :meth:`tix_addbitmapdir`). Використовуючи :meth:`tix_getbitmap`, ви можете уникнути жорсткого кодування шляхів файлів растрових зображень у вашій програмі. У разі успіху повертає повний шлях до растрового файлу з префіксом ``@``. Повернене значення можна використовувати для налаштування опції ``bitmap`` віджетів Tk і Tix.

source: Tix maintains a list of directories under which the :meth:`tix_getimage` and :meth:`tix_getbitmap` methods will search for image files. The standard bitmap directory is :file:`$TIX_LIBRARY/bitmaps`. The :meth:`tix_addbitmapdir` method adds *directory* into this list. By using this method, the image files of an applications can also be located using the :meth:`tix_getimage` or :meth:`tix_getbitmap` method.
uk: Tix підтримує список каталогів, у яких методи :meth:`tix_getimage` і :meth:`tix_getbitmap` шукатимуть файли зображень. Стандартним каталогом растрових зображень є :file:`$TIX_LIBRARY/bitmaps`. Метод :meth:`tix_addbitmapdir` додає *каталог* до цього списку. За допомогою цього методу файли зображень програм також можна знайти за допомогою методу :meth:`tix_getimage` або :meth:`tix_getbitmap`.

source: Returns the file selection dialog that may be shared among different calls from this application. This method will create a file selection dialog widget when it is called the first time. This dialog will be returned by all subsequent calls to :meth:`tix_filedialog`. An optional dlgclass parameter can be passed as a string to specified what type of file selection dialog widget is desired. Possible options are ``tix``, ``FileSelectDialog`` or ``tixExFileSelectDialog``.
uk: Повертає діалогове вікно вибору файлу, який може використовуватися різними викликами цієї програми. Цей метод створить віджет діалогового вікна вибору файлів під час першого виклику. Це діалогове вікно повертатиметься під час усіх наступних викликів :meth:`tix_filedialog`. Додатковий параметр dlgclass можна передати як рядок, щоб визначити, який тип віджета діалогового вікна вибору файлу потрібний. Можливі параметри: ``tix``, ``FileSelectDialog`` або ``tixExFileSelectDialog``.

source: Locates an image file of the name :file:`name.xpm`, :file:`name.xbm` or :file:`name.ppm` in one of the bitmap directories (see the :meth:`tix_addbitmapdir` method above). If more than one file with the same name (but different extensions) exist, then the image type is chosen according to the depth of the X display: xbm images are chosen on monochrome displays and color images are chosen on color displays. By using :meth:`tix_getimage`, you can avoid hard coding the pathnames of the image files in your application. When successful, this method returns the name of the newly created image, which can be used to configure the ``image`` option of the Tk and Tix widgets.
uk: Знаходить файл зображення з назвою :file:`name.xpm`, :file:`name.xbm` або :file:`name.ppm` в одному з каталогів растрових зображень (див. метод :meth:`tix_addbitmapdir` вище ). Якщо існує більше одного файлу з однаковою назвою (але різними розширеннями), тип зображення вибирається відповідно до глибини дисплея X: зображення xbm вибираються на монохромних дисплеях, а кольорові зображення – на кольорових. Використовуючи :meth:`tix_getimage`, ви можете уникнути жорсткого кодування шляхів до файлів зображень у вашій програмі. У разі успіху цей метод повертає ім’я щойно створеного зображення, яке можна використовувати для налаштування опції ``image`` віджетів Tk і Tix.

source: Gets the options maintained by the Tix scheme mechanism.
uk: Отримує параметри, які підтримуються механізмом схеми Tix.

source: Resets the scheme and fontset of the Tix application to *newScheme* and *newFontSet*, respectively. This affects only those widgets created after this call. Therefore, it is best to call the resetoptions method before the creation of any widgets in a Tix application.
uk: Скидає схему та набір шрифтів програми Tix до *newScheme* та *newFontSet* відповідно. Це впливає лише на віджети, створені після цього виклику. Тому найкраще викликати метод resetoptions перед створенням будь-яких віджетів у програмі Tix.

source: The optional parameter *newScmPrio* can be given to reset the priority level of the Tk options set by the Tix schemes.
uk: Додатковий параметр *newScmPrio* можна надати для скидання рівня пріоритету параметрів Tk, встановлених схемами Tix.

source: Because of the way Tk handles the X option database, after Tix has been has imported and inited, it is not possible to reset the color schemes and font sets using the :meth:`tix_config` method. Instead, the :meth:`tix_resetoptions` method must be used.
uk: Через те, як Tk обробляє базу даних параметрів X, після того, як Tix було імпортовано та запущено, неможливо скинути схеми кольорів і набори шрифтів за допомогою методу :meth:`tix_config`. Замість цього слід використовувати метод :meth:`tix_resetoptions`.
