Repository: seanpm2001/python-docs-uk
Catalog: library/tkinter.tix.po
Languages: uk

source: :mod:`tkinter.tix` --- Extension widgets for Tk
uk: :mod:`tkinter.tix` --- Віджети розширення для Tk

source: **Source code:** :source:`Lib/tkinter/tix.py`
uk: **Вихідний код:** :source:`Lib/tkinter/tix.py`

source: This Tk extension is unmaintained and should not be used in new code. Use :mod:`tkinter.ttk` instead.
uk: Це розширення Tk не підтримується, і його не слід використовувати в новому коді. Замість цього використовуйте :mod:`tkinter.ttk`.

source: The :mod:`tkinter.tix` (Tk Interface Extension) module provides an additional rich set of widgets. Although the standard Tk library has many useful widgets, they are far from complete. The :mod:`tkinter.tix` library provides most of the commonly needed widgets that are missing from standard Tk: :class:`HList`, :class:`ComboBox`, :class:`Control` (a.k.a. SpinBox) and an assortment of scrollable widgets. :mod:`tkinter.tix` also includes many more widgets that are generally useful in a wide range of applications: :class:`NoteBook`, :class:`FileEntry`, :class:`PanedWindow`, etc; there are more than 40 of them.
uk: Модуль :mod:`tkinter.tix` (розширення інтерфейсу Tk) надає додатковий багатий набір віджетів. Хоча стандартна бібліотека Tk має багато корисних віджетів, вони далеко не повні. Бібліотека :mod:`tkinter.tix` містить більшість поширених віджетів, яких немає в стандартному Tk: :class:`HList`, :class:`ComboBox`, :class:`Control` (він же SpinBox) і асортимент прокручуваних віджетів. :mod:`tkinter.tix` також містить багато інших віджетів, які зазвичай корисні в широкому діапазоні програм: :class:`NoteBook`, :class:`FileEntry`, :class:`PanedWindow` тощо; їх більше 40.

source: With all these new widgets, you can introduce new interaction techniques into applications, creating more useful and more intuitive user interfaces. You can design your application by choosing the most appropriate widgets to match the special needs of your application and users.
uk: З усіма цими новими віджетами ви можете запроваджувати нові методи взаємодії в програмах, створюючи більш корисні та інтуїтивно зрозумілі інтерфейси користувача. Ви можете створити свою програму, вибравши найбільш відповідні віджети відповідно до особливих потреб вашої програми та користувачів.

source: `Tix Homepage <http://tix.sourceforge.net/>`_
uk: `Домашня сторінка Tix <http://tix.sourceforge.net/>`_

source: The home page for :mod:`Tix`. This includes links to additional documentation and downloads.
uk: Домашня сторінка для :mod:`Tix`. Це включає посилання на додаткову документацію та завантаження.

source: On-line version of the man pages and reference material.
uk: Он-лайн версія сторінок керівництва та довідкових матеріалів.

source: `Tix Programming Guide <http://tix.sourceforge.net/dist/current/docs/tix-book/tix.book.html>`_
uk: `Посібник з програмування Tix <http://tix.sourceforge.net/dist/current/docs/tix-book/tix.book.html>`_

source: On-line version of the programmer's reference material.
uk: Он-лайн версія довідкового матеріалу програміста.

source: Tix applications for development of Tix and Tkinter programs. Tide applications work under Tk or Tkinter, and include :program:`TixInspect`, an inspector to remotely modify and debug Tix/Tk/Tkinter applications.
uk: Додатки Tix для розробки програм Tix і Tkinter. Програми Tide працюють під Tk або Tkinter і включають :program:`TixInspect`, інспектор для віддаленої зміни та налагодження програм Tix/Tk/Tkinter.

source: Using Tix
uk: Використання Tix

source: Toplevel widget of Tix which represents mostly the main window of an application. It has an associated Tcl interpreter.
uk: Віджет верхнього рівня Tix, який представляє переважно головне вікно програми. Він має асоційований інтерпретатор Tcl.

source: Classes in the :mod:`tkinter.tix` module subclasses the classes in the :mod:`tkinter`. The former imports the latter, so to use :mod:`tkinter.tix` with Tkinter, all you need to do is to import one module. In general, you can just import :mod:`tkinter.tix`, and replace the toplevel call to :class:`tkinter.Tk` with :class:`tix.Tk`::
uk: Класи в модулі :mod:`tkinter.tix` є підкласами класів у :mod:`tkinter`. Перший імпортує другий, тому, щоб використовувати :mod:`tkinter.tix` з Tkinter, усе, що вам потрібно зробити, це імпортувати один модуль. Загалом, ви можете просто імпортувати :mod:`tkinter.tix` і замінити виклик верхнього рівня до :class:`tkinter.Tk` на :class:`tix.Tk`::

source: To use :mod:`tkinter.tix`, you must have the Tix widgets installed, usually alongside your installation of the Tk widgets. To test your installation, try the following::
uk: Щоб використовувати :mod:`tkinter.tix`, у вас повинні бути встановлені віджети Tix, як правило, разом із встановленням віджетів Tk. Щоб перевірити інсталяцію, спробуйте наступне:

source: Tix Widgets
uk: Віджети Tix

source: `Tix <http://tix.sourceforge.net/dist/current/man/html/TixCmd/TixIntro.htm>`_ introduces over 40 widget classes to the :mod:`tkinter` repertoire.
uk: `Tix <http://tix.sourceforge.net/dist/current/man/html/TixCmd/TixIntro.htm>`_ представляє понад 40 класів віджетів до репертуару :mod:`tkinter`.

source: Basic Widgets
uk: Основні віджети

source: A `Balloon <http://tix.sourceforge.net/dist/current/man/html/TixCmd/tixBalloon.htm>`_ that pops up over a widget to provide help. When the user moves the cursor inside a widget to which a Balloon widget has been bound, a small pop-up window with a descriptive message will be shown on the screen.
uk: `Повітряна куля <http://tix.sourceforge.net/dist/current/man/html/TixCmd/tixBalloon.htm>`_, яка з’являється над віджетом для надання допомоги. Коли користувач переміщує курсор усередині віджета, до якого прив’язаний віджет Balloon, на екрані з’являється невелике спливаюче вікно з описовим повідомленням.

source: The `ButtonBox <http://tix.sourceforge.net/dist/current/man/html/TixCmd/tixButtonBox.htm>`_ widget creates a box of buttons, such as is commonly used for ``Ok Cancel``.
uk: Віджет `ButtonBox <http://tix.sourceforge.net/dist/current/man/html/TixCmd/tixButtonBox.htm>`_ створює поле кнопок, яке зазвичай використовується для ``Ok Cancel``.

source: The `ComboBox <http://tix.sourceforge.net/dist/current/man/html/TixCmd/tixComboBox.htm>`_ widget is similar to the combo box control in MS Windows. The user can select a choice by either typing in the entry subwidget or selecting from the listbox subwidget.
uk: Віджет `ComboBox <http://tix.sourceforge.net/dist/current/man/html/TixCmd/tixComboBox.htm>`_ схожий на елемент керування полем зі списком у MS Windows. Користувач може вибрати варіант, ввівши у підвіджет запису або вибравши з підвіджета списку.

source: The `Control <http://tix.sourceforge.net/dist/current/man/html/TixCmd/tixControl.htm>`_ widget is also known as the :class:`SpinBox` widget. The user can adjust the value by pressing the two arrow buttons or by entering the value directly into the entry. The new value will be checked against the user-defined upper and lower limits.
uk: Віджет `Control <http://tix.sourceforge.net/dist/current/man/html/TixCmd/tixControl.htm>`_ також відомий як віджет :class:`SpinBox`. Користувач може налаштувати значення, натиснувши дві кнопки зі стрілками, або ввівши значення безпосередньо в поле. Нове значення буде перевірено на відповідність визначеним користувачем верхнім і нижнім межам.

source: The `LabelEntry <http://tix.sourceforge.net/dist/current/man/html/TixCmd/tixLabelEntry.htm>`_ widget packages an entry widget and a label into one mega widget. It can be used to simplify the creation of "entry-form" type of interface.
uk: Віджет `LabelEntry <http://tix.sourceforge.net/dist/current/man/html/TixCmd/tixLabelEntry.htm>`_ упаковує віджет запису та мітку в один мега-віджет. Його можна використовувати для спрощення створення інтерфейсу типу "форма запису".

source: The `LabelFrame <http://tix.sourceforge.net/dist/current/man/html/TixCmd/tixLabelFrame.htm>`_ widget packages a frame widget and a label into one mega widget. To create widgets inside a LabelFrame widget, one creates the new widgets relative to the :attr:`frame` subwidget and manage them inside the :attr:`frame` subwidget.
uk: Віджет `LabelFrame <http://tix.sourceforge.net/dist/current/man/html/TixCmd/tixLabelFrame.htm>`_ упаковує віджет кадру та мітку в один мега-віджет. Щоб створити віджети всередині віджета LabelFrame, потрібно створити нові віджети відносно підвіджета :attr:`frame` і керувати ними всередині підвіджета :attr:`frame`.

source: The `Meter <http://tix.sourceforge.net/dist/current/man/html/TixCmd/tixMeter.htm>`_ widget can be used to show the progress of a background job which may take a long time to execute.
uk: Віджет `Meter <http://tix.sourceforge.net/dist/current/man/html/TixCmd/tixMeter.htm>`_ можна використовувати, щоб показати перебіг фонового завдання, виконання якого може зайняти багато часу.

source: The `OptionMenu <http://tix.sourceforge.net/dist/current/man/html/TixCmd/tixOptionMenu.htm>`_ creates a menu button of options.
uk: `OptionMenu <http://tix.sourceforge.net/dist/current/man/html/TixCmd/tixOptionMenu.htm>`_ створює кнопку меню параметрів.

source: The `PopupMenu <http://tix.sourceforge.net/dist/current/man/html/TixCmd/tixPopupMenu.htm>`_ widget can be used as a replacement of the ``tk_popup`` command. The advantage of the :mod:`Tix` :class:`PopupMenu` widget is it requires less application code to manipulate.
uk: Віджет `PopupMenu <http://tix.sourceforge.net/dist/current/man/html/TixCmd/tixPopupMenu.htm>`_ можна використовувати як заміну команди ``tk_popup``. Перевагою віджета :mod:`Tix` :class:`PopupMenu` є те, що для роботи з ним потрібно менше програмного коду.

source: The `Select <http://tix.sourceforge.net/dist/current/man/html/TixCmd/tixSelect.htm>`_ widget is a container of button subwidgets. It can be used to provide radio-box or check-box style of selection options for the user.
uk: Віджет `Select <http://tix.sourceforge.net/dist/current/man/html/TixCmd/tixSelect.htm>`_ — це контейнер підвіджетів кнопок. Його можна використовувати, щоб надати користувачеві варіанти вибору в стилі радіоблока або прапорця.

source: The `StdButtonBox <http://tix.sourceforge.net/dist/current/man/html/TixCmd/tixStdButtonBox.htm>`_ widget is a group of standard buttons for Motif-like dialog boxes.
uk: Віджет `StdButtonBox <http://tix.sourceforge.net/dist/current/man/html/TixCmd/tixStdButtonBox.htm>`_ — це група стандартних кнопок для діалогових вікон типу Motif.

source: File Selectors
uk: Селектори файлів

source: The `DirList <http://tix.sourceforge.net/dist/current/man/html/TixCmd/tixDirList.htm>`_ widget displays a list view of a directory, its previous directories and its sub-directories. The user can choose one of the directories displayed in the list or change to another directory.
uk: Віджет `DirList <http://tix.sourceforge.net/dist/current/man/html/TixCmd/tixDirList.htm>`_ відображає список каталогу, його попередніх каталогів і підкаталогів. Користувач може вибрати один із каталогів, відображених у списку, або перейти до іншого каталогу.

source: The `DirTree <http://tix.sourceforge.net/dist/current/man/html/TixCmd/tixDirTree.htm>`_ widget displays a tree view of a directory, its previous directories and its sub-directories. The user can choose one of the directories displayed in the list or change to another directory.
uk: Віджет `DirTree <http://tix.sourceforge.net/dist/current/man/html/TixCmd/tixDirTree.htm>`_ відображає деревоподібне подання каталогу, його попередніх каталогів і підкаталогів. Користувач може вибрати один із каталогів, відображених у списку, або перейти до іншого каталогу.

source: The `DirSelectDialog <http://tix.sourceforge.net/dist/current/man/html/TixCmd/tixDirSelectDialog.htm>`_ widget presents the directories in the file system in a dialog window. The user can use this dialog window to navigate through the file system to select the desired directory.
uk: Віджет `DirSelectDialog <http://tix.sourceforge.net/dist/current/man/html/TixCmd/tixDirSelectDialog.htm>`_ представляє каталоги у файловій системі в діалоговому вікні. Користувач може використовувати це діалогове вікно для навігації файловою системою та вибору потрібного каталогу.

source: The :class:`DirSelectBox` is similar to the standard Motif(TM) directory-selection box. It is generally used for the user to choose a directory. DirSelectBox stores the directories mostly recently selected into a ComboBox widget so that they can be quickly selected again.
uk: :class:`DirSelectBox` подібний до стандартного вікна вибору каталогу Motif(TM). Зазвичай він використовується для вибору користувачем каталогу. DirSelectBox зберігає в основному нещодавно вибрані каталоги у віджеті ComboBox, щоб їх можна було швидко вибрати знову.

source: The `ExFileSelectBox <http://tix.sourceforge.net/dist/current/man/html/TixCmd/tixExFileSelectBox.htm>`_ widget is usually embedded in a tixExFileSelectDialog widget. It provides a convenient method for the user to select files. The style of the :class:`ExFileSelectBox` widget is very similar to the standard file dialog on MS Windows 3.1.
uk: Віджет `ExFileSelectBox <http://tix.sourceforge.net/dist/current/man/html/TixCmd/tixExFileSelectBox.htm>`_ зазвичай вбудовано у віджет tixExFileSelectDialog. Він надає користувачеві зручний спосіб вибору файлів. Стиль віджета :class:`ExFileSelectBox` дуже схожий на стандартне діалогове вікно файлів у MS Windows 3.1.

source: The `FileSelectBox <http://tix.sourceforge.net/dist/current/man/html/TixCmd/tixFileSelectBox.htm>`_ is similar to the standard Motif(TM) file-selection box. It is generally used for the user to choose a file. FileSelectBox stores the files mostly recently selected into a :class:`ComboBox` widget so that they can be quickly selected again.
uk: `FileSelectBox <http://tix.sourceforge.net/dist/current/man/html/TixCmd/tixFileSelectBox.htm>`_ подібний до стандартного вікна вибору файлів Motif(TM). Зазвичай він використовується для вибору файлу користувачем. FileSelectBox зберігає нещодавно вибрані файли у віджеті :class:`ComboBox`, щоб їх можна було швидко вибрати знову.

source: The `FileEntry <http://tix.sourceforge.net/dist/current/man/html/TixCmd/tixFileEntry.htm>`_ widget can be used to input a filename. The user can type in the filename manually. Alternatively, the user can press the button widget that sits next to the entry, which will bring up a file selection dialog.
uk: Для введення імені файлу можна використовувати віджет `FileEntry <http://tix.sourceforge.net/dist/current/man/html/TixCmd/tixFileEntry.htm>`_. Користувач може ввести назву файлу вручну. Крім того, користувач може натиснути віджет-кнопку, який розташований поруч із записом, що відкриє діалогове вікно вибору файлу.

source: Hierarchical ListBox
uk: Ієрархічний ListBox

source: The `HList <http://tix.sourceforge.net/dist/current/man/html/TixCmd/tixHList.htm>`_ widget can be used to display any data that have a hierarchical structure, for example, file system directory trees. The list entries are indented and connected by branch lines according to their places in the hierarchy.
uk: Віджет `HList <http://tix.sourceforge.net/dist/current/man/html/TixCmd/tixHList.htm>`_ можна використовувати для відображення будь-яких даних, які мають ієрархічну структуру, наприклад, дерева каталогів файлової системи. Записи списку мають відступи та з’єднані лініями розгалуження відповідно до їх місця в ієрархії.

source: The `CheckList <http://tix.sourceforge.net/dist/current/man/html/TixCmd/tixCheckList.htm>`_ widget displays a list of items to be selected by the user. CheckList acts similarly to the Tk checkbutton or radiobutton widgets, except it is capable of handling many more items than checkbuttons or radiobuttons.
uk: Віджет `CheckList <http://tix.sourceforge.net/dist/current/man/html/TixCmd/tixCheckList.htm>`_ відображає список елементів, які має вибрати користувач. CheckList діє подібно до віджетів Tk checkbutton або radiobutton, за винятком того, що він здатний обробляти набагато більше елементів, ніж контрольні кнопки або перемикачі.

source: The `Tree <http://tix.sourceforge.net/dist/current/man/html/TixCmd/tixTree.htm>`_ widget can be used to display hierarchical data in a tree form. The user can adjust the view of the tree by opening or closing parts of the tree.
uk: Віджет `Дерево <http://tix.sourceforge.net/dist/current/man/html/TixCmd/tixTree.htm>`_ можна використовувати для відображення ієрархічних даних у формі дерева. Користувач може регулювати вигляд дерева, відкриваючи або закриваючи частини дерева.

source: Tabular ListBox
uk: Табличний ListBox

source: The `TList <http://tix.sourceforge.net/dist/current/man/html/TixCmd/tixTList.htm>`_ widget can be used to display data in a tabular format. The list entries of a :class:`TList` widget are similar to the entries in the Tk listbox widget. The main differences are (1) the :class:`TList` widget can display the list entries in a two dimensional format and (2) you can use graphical images as well as multiple colors and fonts for the list entries.
uk: Віджет `TList <http://tix.sourceforge.net/dist/current/man/html/TixCmd/tixTList.htm>`_ можна використовувати для відображення даних у табличному форматі. Записи списку віджета :class:`TList` подібні до записів у віджеті Tk listbox. Основні відмінності: (1) віджет :class:`TList` може відображати записи списку у двовимірному форматі та (2) ви можете використовувати графічні зображення, а також кілька кольорів і шрифтів для записів списку.

source: Manager Widgets
uk: Віджети менеджера

source: The `PanedWindow <http://tix.sourceforge.net/dist/current/man/html/TixCmd/tixPanedWindow.htm>`_ widget allows the user to interactively manipulate the sizes of several panes. The panes can be arranged either vertically or horizontally. The user changes the sizes of the panes by dragging the resize handle between two panes.
uk: Віджет `PanedWindow <http://tix.sourceforge.net/dist/current/man/html/TixCmd/tixPanedWindow.htm>`_ дозволяє користувачеві інтерактивно маніпулювати розмірами кількох панелей. Панелі можуть бути розташовані як вертикально, так і горизонтально. Користувач змінює розміри панелей, перетягуючи ручку зміни розміру між двома панелями.

source: The `ListNoteBook <http://tix.sourceforge.net/dist/current/man/html/TixCmd/tixListNoteBook.htm>`_ widget is very similar to the :class:`TixNoteBook` widget: it can be used to display many windows in a limited space using a notebook metaphor. The notebook is divided into a stack of pages (windows). At one time only one of these pages can be shown. The user can navigate through these pages by choosing the name of the desired page in the :attr:`hlist` subwidget.
uk: Віджет `ListNoteBook <http://tix.sourceforge.net/dist/current/man/html/TixCmd/tixListNoteBook.htm>`_ дуже схожий на віджет :class:`TixNoteBook`: його можна використовувати для відображення багатьох вікон в обмеженому просторі за допомогою метафори блокнота. Зошит розділений на стопку сторінок (віконця). Одночасно може бути показана лише одна з цих сторінок. Користувач може переміщатися по цих сторінках, вибравши назву потрібної сторінки у підвіджеті :attr:`hlist`.

source: The `NoteBook <http://tix.sourceforge.net/dist/current/man/html/TixCmd/tixNoteBook.htm>`_ widget can be used to display many windows in a limited space using a notebook metaphor. The notebook is divided into a stack of pages. At one time only one of these pages can be shown. The user can navigate through these pages by choosing the visual "tabs" at the top of the NoteBook widget.
uk: Віджет `NoteBook <http://tix.sourceforge.net/dist/current/man/html/TixCmd/tixNoteBook.htm>`_ можна використовувати для відображення багатьох вікон в обмеженому просторі за допомогою метафори блокнота. Блокнот розділений на стопку сторінок. Одночасно може бути показана лише одна з цих сторінок. Користувач може переміщатися по цих сторінках, вибираючи візуальні "вкладки" у верхній частині віджета NoteBook.

source: Image Types
uk: Типи зображень

source: The :mod:`tkinter.tix` module adds:
uk: Модуль :mod:`tkinter.tix` додає:

source: `pixmap <http://tix.sourceforge.net/dist/current/man/html/TixCmd/pixmap.htm>`_ capabilities to all :mod:`tkinter.tix` and :mod:`tkinter` widgets to create color images from XPM files.
uk: `pixmap <http://tix.sourceforge.net/dist/current/man/html/TixCmd/pixmap.htm>`_ можливості для всіх віджетів :mod:`tkinter.tix` і :mod:`tkinter` для створення кольорових зображень із файлів XPM.

source: `Compound <http://tix.sourceforge.net/dist/current/man/html/TixCmd/compound.htm>`_ image types can be used to create images that consists of multiple horizontal lines; each line is composed of a series of items (texts, bitmaps, images or spaces) arranged from left to right. For example, a compound image can be used to display a bitmap and a text string simultaneously in a Tk :class:`Button` widget.
uk: Типи зображень `Compound <http://tix.sourceforge.net/dist/current/man/html/TixCmd/compound.htm>`_ можна використовувати для створення зображень, які складаються з кількох горизонтальних ліній; кожен рядок складається з ряду елементів (тексту, растрових зображень, зображень або пробілів), розташованих зліва направо. Наприклад, складене зображення можна використовувати для одночасного відображення растрового зображення та текстового рядка у віджеті Tk :class:`Button`.

source: Miscellaneous Widgets
uk: Різні віджети

source: The `InputOnly <http://tix.sourceforge.net/dist/current/man/html/TixCmd/tixInputOnly.htm>`_ widgets are to accept inputs from the user, which can be done with the ``bind`` command (Unix only).
uk: Віджети `InputOnly <http://tix.sourceforge.net/dist/current/man/html/TixCmd/tixInputOnly.htm>`_ мають приймати введені дані від користувача, що можна зробити за допомогою команди ``bind`` (тільки для Unix).

source: Form Geometry Manager
uk: Менеджер геометрії форм

source: In addition, :mod:`tkinter.tix` augments :mod:`tkinter` by providing:
uk: Крім того, :mod:`tkinter.tix` доповнює :mod:`tkinter`, надаючи:

source: The `Form <http://tix.sourceforge.net/dist/current/man/html/TixCmd/tixForm.htm>`_ geometry manager based on attachment rules for all Tk widgets.
uk: Менеджер геометрії `Form <http://tix.sourceforge.net/dist/current/man/html/TixCmd/tixForm.htm>`_ на основі правил прикріплення для всіх віджетів Tk.

source: Tix Commands
uk: Команди Tix

source: The `tix commands <http://tix.sourceforge.net/dist/current/man/html/TixCmd/tix.htm>`_ provide access to miscellaneous elements of :mod:`Tix`'s internal state and the :mod:`Tix` application context. Most of the information manipulated by these methods pertains to the application as a whole, or to a screen or display, rather than to a particular window.
uk: Команди `tix <http://tix.sourceforge.net/dist/current/man/html/TixCmd/tix.htm>`_ надають доступ до різноманітних елементів внутрішнього стану :mod:`Tix` і контексту програми :mod:`Tix`. Більшість інформації, якою маніпулюють ці методи, відноситься до програми в цілому, або до екрана чи дисплея, а не до окремого вікна.

source: To view the current settings, the common usage is::
uk: Для перегляду поточних налаштувань зазвичай використовується:
