Repository: seanpm2001/python-docs-uk
Catalog: library/typing.po
Languages: uk

source: The deprecated types will be removed from the :mod:`typing` module in the first Python version released 5 years after the release of Python 3.9.0. See details in :pep:`585`—*Type Hinting Generics In Standard Collections*.
uk: Застарілі типи буде видалено з модуля :mod:`typing` у першій версії Python, випущеній через 5 років після випуску Python 3.9.0. Див. подробиці в :pep:`585`—*Універсальні підказки типів у стандартних колекціях*.

source: Special typing primitives
uk: Спеціальні примітиви типізації

source: Special types
uk: Особливі види

source: These can be used as types in annotations and do not support ``[]``.
uk: Вони можуть використовуватися як типи в анотаціях і не підтримують ``[]``.

source: Special type indicating an unconstrained type.
uk: Спеціальний тип, що вказує на необмежений тип.

source: Every type is compatible with :data:`Any`.
uk: Кожен тип сумісний з :data:`Any`.

source: :data:`Any` is compatible with every type.
uk: :data:`Any` сумісний з усіма типами.

source: Example::
uk: Приклад::

source: Special type indicating that a function never returns. For example::
uk: Спеціальний тип, який вказує, що функція ніколи не повертається. Наприклад::

source: Special annotation for explicitly declaring a :ref:`type alias <type-aliases>`. For example::
uk: Спеціальна анотація для явного оголошення псевдоніма :ref:`типу <type-aliases>`. Наприклад::

source: See :pep:`613` for more details about explicit type aliases.
uk: Перегляньте :pep:`613` для отримання додаткової інформації про явні псевдоніми типів.

source: Special forms
uk: Спеціальні форми

source: These can be used as types in annotations using ``[]``, each having a unique syntax.
uk: Їх можна використовувати як типи в анотаціях за допомогою ``[]``, кожен з яких має унікальний синтаксис.

source: Tuple type; ``Tuple[X, Y]`` is the type of a tuple of two items with the first item of type X and the second of type Y. The type of the empty tuple can be written as ``Tuple[()]``.
uk: Тип кортежу; ``Tuple[X, Y]`` — це тип кортежу з двох елементів з першим елементом типу X, а другим — типу Y. Тип порожнього кортежу можна записати як ``Tuple[()]``.

source: Example: ``Tuple[T1, T2]`` is a tuple of two elements corresponding to type variables T1 and T2. ``Tuple[int, float, str]`` is a tuple of an int, a float and a string.
uk: Приклад: ``Tuple[T1, T2]`` — це кортеж із двох елементів, що відповідають змінним типу T1 і T2. ``Tuple[int, float, str]`` – це кортеж із int, float і рядка.

source: To specify a variable-length tuple of homogeneous type, use literal ellipsis, e.g. ``Tuple[int, ...]``. A plain :data:`Tuple` is equivalent to ``Tuple[Any, ...]``, and in turn to :class:`tuple`.
uk: Щоб указати кортеж змінної довжини однорідного типу, використовуйте літеральний еліпсис, наприклад. ``Tuple[int, ...]``. Звичайний :data:`Tuple` еквівалентний ``Tuple[Any, ...]`` і, у свою чергу, :class:`tuple`.

source: Union type; ``Union[X, Y]`` is equivalent to ``X | Y`` and means either X or Y.
uk: тип союзу; ``Union[X, Y]`` еквівалентно ``X | Y`` і означає X або Y.

source: To define a union, use e.g. ``Union[int, str]`` or the shorthand ``int | str``. Using that shorthand is recommended. Details:
uk: Щоб визначити об’єднання, використовуйте, наприклад, ``Union[int, str]`` або скорочення ``int | str``. Рекомендується використовувати це скорочення. Подробиці:

source: The arguments must be types and there must be at least one.
uk: Аргументи мають бути типами і має бути принаймні один.

source: Unions of unions are flattened, e.g.::
uk: Союзи союзів зведені, наприклад::

source: Unions of a single argument vanish, e.g.::
uk: Союзи одного аргументу зникають, наприклад::

source: Redundant arguments are skipped, e.g.::
uk: Зайві аргументи пропускаються, наприклад::

source: When comparing unions, the argument order is ignored, e.g.::
uk: Під час порівняння об’єднань порядок аргументів ігнорується, наприклад::

source: You cannot subclass or instantiate a ``Union``.
uk: Ви не можете створювати підкласи або екземпляри ``Union``.

source: You cannot write ``Union[X][Y]``.
uk: Ви не можете писати ``Union[X][Y]``.

source: Don't remove explicit subclasses from unions at runtime.
uk: Не видаляйте явні підкласи з об’єднань під час виконання.

source: Unions can now be written as ``X | Y``. See :ref:`union type expressions<types-union>`.
uk: Об’єднання тепер можна записати як ``X | Y``. Див. :ref:`вирази типу union <types-union>`.

source: Optional type.
uk: Необов'язковий тип.

source: ``Optional[X]`` is equivalent to ``X | None`` (or ``Union[X, None]``).
uk: ``Optional[X]`` еквівалентно ``X | None`` (або ``Union[X, None]``).

source: Note that this is not the same concept as an optional argument, which is one that has a default. An optional argument with a default does not require the ``Optional`` qualifier on its type annotation just because it is optional. For example::
uk: Зауважте, що це не те саме поняття, що необов’язковий аргумент, який має значення за умовчанням. Необов’язковий аргумент із значенням за замовчуванням не потребує кваліфікатора ``Optional`` в анотації свого типу лише тому, що він є необов’язковим. Наприклад::

source: On the other hand, if an explicit value of ``None`` is allowed, the use of ``Optional`` is appropriate, whether the argument is optional or not. For example::
uk: З іншого боку, якщо дозволено явне значення ``None``, використання ``Optional`` є доречним, незалежно від того, чи є аргумент необов’язковим. Наприклад::

source: Optional can now be written as ``X | None``. See :ref:`union type expressions<types-union>`.
uk: Необов’язковий тепер можна записати як ``X | None``. Див. :ref:`вирази типу union <types-union>`.

source: Callable type; ``Callable[[int], str]`` is a function of (int) -> str.
uk: Викличний тип; ``Callable[[int], str]`` є функцією (int) -> str.

source: The subscription syntax must always be used with exactly two values: the argument list and the return type. The argument list must be a list of types or an ellipsis; the return type must be a single type.
uk: Синтаксис підписки завжди має використовуватися рівно з двома значеннями: список аргументів і тип повернення. Список аргументів має бути списком типів або крапкою; тип повернення має бути одним типом.

source: There is no syntax to indicate optional or keyword arguments; such function types are rarely used as callback types. ``Callable[..., ReturnType]`` (literal ellipsis) can be used to type hint a callable taking any number of arguments and returning ``ReturnType``. A plain :data:`Callable` is equivalent to ``Callable[..., Any]``, and in turn to :class:`collections.abc.Callable`.
uk: Немає синтаксису для позначення необов’язкових або ключових аргументів; такі типи функцій рідко використовуються як типи зворотного виклику. ``Callable[..., ReturnType]`` (буквальний еліпс) можна використовувати для введення підказки викликаного, що приймає будь-яку кількість аргументів і повертає ``ReturnType``. Звичайний :data:`Callable` еквівалентний ``Callable[..., Any]`` і, у свою чергу, :class:`collections.abc.Callable`.

source: The documentation for :class:`ParamSpec` and :class:`Concatenate` provide examples of usage with ``Callable``.
uk: Документація для :class:`ParamSpec` і :class:`Concatenate` містить приклади використання з ``Callable``.

source: For example, to annotate a decorator ``with_lock`` which provides a :class:`threading.Lock` to the decorated function, ``Concatenate`` can be used to indicate that ``with_lock`` expects a callable which takes in a ``Lock`` as the first argument, and returns a callable with a different type signature. In this case, the :class:`ParamSpec` indicates that the returned callable's parameter types are dependent on the parameter types of the callable being passed in::
uk: Наприклад, щоб анотувати декоратор ``with_lock``, який надає :class:`threading.Lock` декорованій функції, ``Concatenate`` можна використовувати, щоб вказати, що ``with_lock`` очікує виклик, який приймає в ``Lock`` як перший аргумент і повертає виклик із сигнатурою іншого типу. У цьому випадку :class:`ParamSpec` вказує, що типи параметрів викликаного об’єкта, що повертається, залежать від типів параметрів об’єкта виклику, який передається в::

source: :pep:`612` -- Parameter Specification Variables (the PEP which introduced ``ParamSpec`` and ``Concatenate``).
uk: :pep:`612` -- Змінні специфікації параметрів (PEP, який представив ``ParamSpec`` і ``Concatenate``).

source: :class:`ParamSpec` and :class:`Callable`.
uk: :class:`ParamSpec` і :class:`Callable`.

source: A variable annotated with ``C`` may accept a value of type ``C``. In contrast, a variable annotated with ``Type[C]`` may accept values that are classes themselves -- specifically, it will accept the *class object* of ``C``. For example::
uk: Змінна з анотацією ``C`` може приймати значення типу ``C``. На відміну від цього, змінна, анотована ``Type[C]``, може приймати значення, які самі по собі є класами - зокрема, вона прийматиме *об’єкт класу* ``C``. Наприклад::

source: Note that ``Type[C]`` is covariant::
uk: Зауважте, що ``Type[C]`` є коваріантним::

source: The fact that ``Type[C]`` is covariant implies that all subclasses of ``C`` should implement the same constructor signature and class method signatures as ``C``. The type checker should flag violations of this, but should also allow constructor calls in subclasses that match the constructor calls in the indicated base class. How the type checker is required to handle this particular case may change in future revisions of :pep:`484`.
uk: Той факт, що ``Type[C]`` є коваріантним, означає, що всі підкласи ``C`` повинні реалізовувати ту саму сигнатуру конструктора та сигнатури методу класу, що й ``C``. Перевірка типів повинна позначати порушення цього, але також повинна дозволяти виклики конструкторів у підкласах, які відповідають викликам конструкторів у вказаному базовому класі. Те, як перевірка типів потрібна для обробки цього конкретного випадку, може змінитися в майбутніх версіях :pep:`484`.

source: The only legal parameters for :class:`Type` are classes, :data:`Any`, :ref:`type variables <generics>`, and unions of any of these types. For example::
uk: Єдиними допустимими параметрами для :class:`Type` є класи, :data:`Any`, :ref:`змінні типу <generics>`, а також об’єднання будь-якого з цих типів. Наприклад::

source: ``Type[Any]`` is equivalent to ``Type`` which in turn is equivalent to ``type``, which is the root of Python's metaclass hierarchy.
uk: ``Type[Any]`` еквівалентний ``Type``, який, у свою чергу, еквівалентний ``type``, який є коренем ієрархії метакласів Python.

source: A type that can be used to indicate to type checkers that the corresponding variable or function parameter has a value equivalent to the provided literal (or one of several literals). For example::
uk: Тип, який можна використовувати для вказівки перевіряючим типам того, що відповідна змінна або параметр функції має значення, еквівалентне наданому літералу (або одному з кількох літералів). Наприклад::

source: ``Literal[...]`` cannot be subclassed. At runtime, an arbitrary value is allowed as type argument to ``Literal[...]``, but type checkers may impose restrictions. See :pep:`586` for more details about literal types.
uk: ``Літерал[...]`` не може бути підкласом. Під час виконання довільне значення допускається як аргумент типу для ``Literal[...]``, але засоби перевірки типу можуть накладати обмеження. Дивіться :pep:`586` для отримання додаткової інформації про літеральні типи.

source: ``Literal`` now de-duplicates parameters. Equality comparisons of ``Literal`` objects are no longer order dependent. ``Literal`` objects will now raise a :exc:`TypeError` exception during equality comparisons if one of their parameters are not :term:`hashable`.
uk: ``Літерал`` тепер усуває дублікати параметрів. Порівняння рівності об’єктів ``Literal`` більше не залежить від порядку. Об’єкти ``Literal`` тепер створюватимуть виняток :exc:`TypeError` під час порівняння рівності, якщо один із їхніх параметрів не є :term:`hashable`.

source: Special type construct to mark class variables.
uk: Конструкція спеціального типу для позначення змінних класу.

source: As introduced in :pep:`526`, a variable annotation wrapped in ClassVar indicates that a given attribute is intended to be used as a class variable and should not be set on instances of that class. Usage::
uk: Як представлено в :pep:`526`, анотація змінної, загорнена в ClassVar, вказує на те, що даний атрибут призначений для використання як змінна класу і не повинен встановлюватися для екземплярів цього класу. Використання::

source: :data:`ClassVar` accepts only types and cannot be further subscribed.
uk: :data:`ClassVar` приймає лише типи і не може бути підписаний далі.

source: :data:`ClassVar` is not a class itself, and should not be used with :func:`isinstance` or :func:`issubclass`. :data:`ClassVar` does not change Python runtime behavior, but it can be used by third-party type checkers. For example, a type checker might flag the following code as an error::
uk: :data:`ClassVar` сам по собі не є класом і не повинен використовуватися з :func:`isinstance` або :func:`issubclass`. :data:`ClassVar` не змінює поведінку Python під час виконання, але його можуть використовувати сторонні засоби перевірки типу. Наприклад, засіб перевірки типу може позначити наступний код як помилку:

source: A special typing construct to indicate to type checkers that a name cannot be re-assigned or overridden in a subclass. For example::
uk: Спеціальна конструкція типізації, яка вказує перевіряючим типам, що ім’я не може бути повторно призначено або перевизначено в підкласі. Наприклад::

source: There is no runtime checking of these properties. See :pep:`591` for more details.
uk: Немає жодної перевірки цих властивостей під час виконання. Дивіться :pep:`591` для більш детальної інформації.

source: A type, introduced in :pep:`593` (``Flexible function and variable annotations``), to decorate existing types with context-specific metadata (possibly multiple pieces of it, as ``Annotated`` is variadic). Specifically, a type ``T`` can be annotated with metadata ``x`` via the typehint ``Annotated[T, x]``. This metadata can be used for either static analysis or at runtime. If a library (or tool) encounters a typehint ``Annotated[T, x]`` and has no special logic for metadata ``x``, it should ignore it and simply treat the type as ``T``. Unlike the ``no_type_check`` functionality that currently exists in the ``typing`` module which completely disables typechecking annotations on a function or a class, the ``Annotated`` type allows for both static typechecking of ``T`` (which can safely ignore ``x``) together with runtime access to ``x`` within a specific application.
uk: Тип, представлений у :pep:`593` (``Гнучка функція та анотації змінних``), щоб прикрасити існуючі типи контекстно-залежними метаданими (можливо, кількома їх частинами, оскільки ``Анотований`` є варіативним). Зокрема, тип ``T`` може бути анотований метаданими ``x`` за допомогою підказки типу ``Annotated[T, x]``. Ці метадані можна використовувати для статичного аналізу або під час виконання. Якщо бібліотека (або інструмент) зустрічає підказку типу ``Annotated[T, x]`` і не має спеціальної логіки для метаданих ``x``, їй слід ігнорувати це та просто розглядати тип як ``T``. На відміну від функціональності ``no_type_check``, яка наразі існує в модулі ``typing``, який повністю вимикає анотації перевірки типу для функції або класу, тип ``Annotated`` дозволяє як статичну перевірку типу ``T`` ( який може безпечно ігнорувати ``x``) разом із доступом під час виконання до ``x`` у певній програмі.

source: Ultimately, the responsibility of how to interpret the annotations (if at all) is the responsibility of the tool or library encountering the ``Annotated`` type. A tool or library encountering an ``Annotated`` type can scan through the annotations to determine if they are of interest (e.g., using ``isinstance()``).
uk: Зрештою, відповідальність за те, як інтерпретувати анотації (якщо взагалі є), відповідає інструмент або бібліотека, які стикаються з типом ``Анотований``. Інструмент або бібліотека, які стикаються з типом ``Анотований``, можуть сканувати анотації, щоб визначити, чи представляють вони інтерес (наприклад, за допомогою ``isinstance()``).

source: When a tool or a library does not support annotations or encounters an unknown annotation it should just ignore it and treat annotated type as the underlying type.
uk: Якщо інструмент або бібліотека не підтримує анотації або зустрічає невідому анотацію, їм слід просто ігнорувати її та розглядати анотований тип як базовий тип.

source: It's up to the tool consuming the annotations to decide whether the client is allowed to have several annotations on one type and how to merge those annotations.
uk: Інструмент, який використовує анотації, вирішує, чи дозволено клієнту мати кілька анотацій одного типу та як об’єднати ці анотації.

source: Since the ``Annotated`` type allows you to put several annotations of the same (or different) type(s) on any node, the tools or libraries consuming those annotations are in charge of dealing with potential duplicates. For example, if you are doing value range analysis you might allow this::
uk: Оскільки тип ``Анотований`` дозволяє розміщувати кілька анотацій одного (або іншого) типу на будь-якому вузлі, інструменти або бібліотеки, які використовують ці анотації, відповідають за роботу з потенційними дублікатами. Наприклад, якщо ви виконуєте аналіз діапазону значень, ви можете дозволити це:

source: Passing ``include_extras=True`` to :func:`get_type_hints` lets one access the extra annotations at runtime.
uk: Передача ``include_extras=True`` до :func:`get_type_hints` дозволяє отримати доступ до додаткових анотацій під час виконання.

source: The details of the syntax:
uk: Подробиці синтаксису:

source: The first argument to ``Annotated`` must be a valid type
uk: Перший аргумент ``Анотований`` має бути дійсного типу

source: Multiple type annotations are supported (``Annotated`` supports variadic arguments)::
uk: Підтримуються анотації кількох типів (``Annotated`` підтримує різні аргументи):

source: ``Annotated`` must be called with at least two arguments ( ``Annotated[int]`` is not valid)
uk: ``Annotated`` потрібно викликати принаймні з двома аргументами (``Annotated[int]`` недійсний)

source: The order of the annotations is preserved and matters for equality checks::
uk: Порядок анотацій зберігається і має значення для перевірки рівності:

source: Nested ``Annotated`` types are flattened, with metadata ordered starting with the innermost annotation::
uk: Вкладені ``Анотовані`` типи зведені, метадані впорядковані, починаючи з внутрішньої анотації::

source: Duplicated annotations are not removed::
uk: Дубльовані анотації не видаляються:

source: ``Annotated`` can be used with nested and generic aliases::
uk: ``Анотований`` можна використовувати з вкладеними та загальними псевдонімами:

source: Special typing form used to annotate the return type of a user-defined type guard function. ``TypeGuard`` only accepts a single type argument. At runtime, functions marked this way should return a boolean.
uk: Спеціальна форма введення, яка використовується для анотації типу повернення визначеної користувачем функції захисту типу. ``TypeGuard`` приймає лише один аргумент типу. Під час виконання функції, позначені таким чином, повинні повертати логічне значення.

source: ``TypeGuard`` aims to benefit *type narrowing* -- a technique used by static type checkers to determine a more precise type of an expression within a program's code flow. Usually type narrowing is done by analyzing conditional code flow and applying the narrowing to a block of code. The conditional expression here is sometimes referred to as a "type guard"::
uk: ``TypeGuard`` має на меті скористатися *звуженням типу* — технікою, яка використовується засобами перевірки статичних типів для визначення більш точного типу виразу в потоці коду програми. Зазвичай звуження типу виконується шляхом аналізу умовного потоку коду та застосування звуження до блоку коду. Умовний вираз тут іноді називають "захисним типом"::

source: Sometimes it would be convenient to use a user-defined boolean function as a type guard. Such a function should use ``TypeGuard[...]`` as its return type to alert static type checkers to this intention.
uk: Іноді було б зручно використовувати логічну функцію, визначену користувачем, як захист типу. Така функція повинна використовувати ``TypeGuard[...]`` як тип повернення, щоб попередити засоби перевірки статичних типів про цей намір.

source: Using ``-> TypeGuard`` tells the static type checker that for a given function:
uk: Використання ``-> TypeGuard`` повідомляє засобу перевірки статичного типу, що для даної функції:

source: The return value is a boolean.
uk: Повернене значення є логічним.

source: If the return value is ``True``, the type of its argument is the type inside ``TypeGuard``.
uk: Якщо повертається значення ``True``, тип його аргументу є типом у ``TypeGuard``.

source: If ``is_str_list`` is a class or instance method, then the type in ``TypeGuard`` maps to the type of the second parameter after ``cls`` or ``self``.
uk: Якщо ``is_str_list`` є методом класу або екземпляра, тоді тип у ``TypeGuard`` відображає тип другого параметра після ``cls`` або ``self``.

source: In short, the form ``def foo(arg: TypeA) -> TypeGuard[TypeB]: ...``, means that if ``foo(arg)`` returns ``True``, then ``arg`` narrows from ``TypeA`` to ``TypeB``.
uk: Коротше кажучи, форма ``def foo(arg: TypeA) -> TypeGuard[TypeB]: ...`` означає, що якщо ``foo(arg)`` повертає ``True``, то ``arg`` звужується від ``TypeA`` до ``TypeB``.

source: Building generic types
uk: Побудова загальних типів

source: These are not used in annotations. They are building blocks for creating generic types.
uk: Вони не використовуються в анотаціях. Вони є будівельними блоками для створення загальних типів.

source: Abstract base class for generic types.
uk: Абстрактний базовий клас для загальних типів.

source: A generic type is typically declared by inheriting from an instantiation of this class with one or more type variables. For example, a generic mapping type might be defined as::
uk: Загальний тип зазвичай оголошується шляхом успадкування екземпляра цього класу з однією або декількома змінними типу. Наприклад, загальний тип відображення може бути визначений як:

source: This class can then be used as follows::
uk: Потім цей клас можна використовувати наступним чином:

source: Type variable.
uk: Тип змінної.

source: Usage::
uk: Використання::

source: Type variables exist primarily for the benefit of static type checkers. They serve as the parameters for generic types as well as for generic function definitions. See :class:`Generic` for more information on generic types. Generic functions work as follows::
uk: Змінні типу існують, перш за все, на користь засобів перевірки статичних типів. Вони служать параметрами для загальних типів, а також для визначення загальних функцій. Перегляньте :class:`Generic` для отримання додаткової інформації про загальні типи. Загальні функції працюють наступним чином:

source: Note that type variables can be *bound*, *constrained*, or neither, but cannot be both bound *and* constrained.
uk: Зауважте, що змінні типу можуть бути *зв’язаними*, *обмеженими* або жодними з них, але не можуть бути одночасно зв’язаними *і* обмеженими.

source: Type variables can be bound to concrete types, abstract types (ABCs or protocols), and even unions of types::
uk: Змінні типу можна прив’язувати до конкретних типів, абстрактних типів (ABC або протоколів) і навіть об’єднань типів::
