Repository: seanpm2001/python-docs-uk
Catalog: library/typing.po
Languages: uk

source: A generic version of :class:`collections.abc.Coroutine`. The variance and order of type variables correspond to those of :class:`Generator`, for example::
uk: Загальна версія :class:`collections.abc.Coroutine`. Дисперсія та порядок змінних типу відповідають змінним :class:`Generator`, наприклад::

source: An async generator can be annotated by the generic type ``AsyncGenerator[YieldType, SendType]``. For example::
uk: Асинхронний генератор може бути анотований загальним типом ``AsyncGenerator[YieldType, SendType]``. Наприклад::

source: Unlike normal generators, async generators cannot return a value, so there is no ``ReturnType`` type parameter. As with :class:`Generator`, the ``SendType`` behaves contravariantly.
uk: На відміну від звичайних генераторів, асинхронні генератори не можуть повертати значення, тому немає параметра типу ``ReturnType``. Як і :class:`Generator`, ``SendType`` поводиться протилежно.

source: If your generator will only yield values, set the ``SendType`` to ``None``::
uk: Якщо ваш генератор видаватиме лише значення, встановіть для ``SendType`` значення ``None``::

source: Alternatively, annotate your generator as having a return type of either ``AsyncIterable[YieldType]`` or ``AsyncIterator[YieldType]``::
uk: Крім того, позначте свій генератор як такий, що має тип повернення ``AsyncIterable[YieldType]`` або ``AsyncIterator[YieldType]``::

source: A generic version of :class:`collections.abc.AsyncIterable`.
uk: Загальна версія :class:`collections.abc.AsyncIterable`.

source: A generic version of :class:`collections.abc.AsyncIterator`.
uk: Загальна версія :class:`collections.abc.AsyncIterator`.

source: A generic version of :class:`collections.abc.Awaitable`.
uk: Загальна версія :class:`collections.abc.Awaitable`.

source: Context manager types
uk: Типи контекстного менеджера

source: A generic version of :class:`contextlib.AbstractContextManager`.
uk: Загальна версія :class:`contextlib.AbstractContextManager`.

source: A generic version of :class:`contextlib.AbstractAsyncContextManager`.
uk: Загальна версія :class:`contextlib.AbstractAsyncContextManager`.

source: Protocols
uk: Протоколи

source: These protocols are decorated with :func:`runtime_checkable`.
uk: Ці протоколи прикрашені :func:`runtime_checkable`.

source: An ABC with one abstract method ``__abs__`` that is covariant in its return type.
uk: ABC з одним абстрактним методом ``__abs__``, який є коваріантним у своєму типі повернення.

source: An ABC with one abstract method ``__bytes__``.
uk: ABC з одним абстрактним методом ``__bytes__``.

source: An ABC with one abstract method ``__complex__``.
uk: ABC з одним абстрактним методом ``__complex__``.

source: An ABC with one abstract method ``__float__``.
uk: ABC з одним абстрактним методом ``__float__``.

source: An ABC with one abstract method ``__index__``.
uk: ABC з одним абстрактним методом ``__index__``.

source: An ABC with one abstract method ``__int__``.
uk: ABC з одним абстрактним методом ``__int__``.

source: An ABC with one abstract method ``__round__`` that is covariant in its return type.
uk: ABC з одним абстрактним методом ``__round__``, який є коваріантним у своєму типі повернення.

source: Functions and decorators
uk: Функції та декоратори

source: Cast a value to a type.
uk: Приведення значення до типу.

source: This returns the value unchanged. To the type checker this signals that the return value has the designated type, but at runtime we intentionally don't check anything (we want this to be as fast as possible).
uk: Це повертає значення без змін. Для засобу перевірки типів це означає, що значення, що повертається, має визначений тип, але під час виконання ми навмисно нічого не перевіряємо (ми хочемо, щоб це було якомога швидше).

source: The ``@overload`` decorator allows describing functions and methods that support multiple different combinations of argument types. A series of ``@overload``-decorated definitions must be followed by exactly one non-``@overload``-decorated definition (for the same function/method). The ``@overload``-decorated definitions are for the benefit of the type checker only, since they will be overwritten by the non-``@overload``-decorated definition, while the latter is used at runtime but should be ignored by a type checker. At runtime, calling a ``@overload``-decorated function directly will raise :exc:`NotImplementedError`. An example of overload that gives a more precise type than can be expressed using a union or a type variable::
uk: Декоратор ``@overload`` дозволяє описувати функції та методи, які підтримують кілька різних комбінацій типів аргументів. Після серії визначень, прикрашених ``@overload``, має слідувати точно одне визначення, не прикрашене ``@overload`` (для тієї самої функції/методу). Визначення, прикрашені ``@overload``, призначені лише для перевірки типів, оскільки вони будуть перезаписані визначенням, не прикрашеним ``@overload``, тоді як останнє використовується під час виконання, але його слід ігнорувати за допомогою перевірки типу. Під час виконання прямий виклик функції, декорованої ``@overload``, викличе :exc:`NotImplementedError`. Приклад перевантаження, який дає більш точний тип, ніж можна виразити за допомогою об’єднання або змінної типу::

source: A decorator to indicate to type checkers that the decorated method cannot be overridden, and the decorated class cannot be subclassed. For example::
uk: Декоратор, який вказує засобам перевірки типу, що декорований метод не може бути перевизначений, а декорований клас не може бути підкласом. Наприклад::

source: Decorator to indicate that annotations are not type hints.
uk: Декоратор, щоб вказати, що анотації не є підказками типу.

source: This mutates the function(s) in place.
uk: Це змінює діючу функцію(и).

source: Decorator to give another decorator the :func:`no_type_check` effect.
uk: Декоратор, щоб надати іншому декоратору ефект :func:`no_type_check`.

source: This wraps the decorator with something that wraps the decorated function in :func:`no_type_check`.
uk: Це обертає декоратор чимось, що обертає декоровану функцію в :func:`no_type_check`.

source: Decorator to mark a class or function to be unavailable at runtime.
uk: Декоратор для позначення класу або функції як недоступні під час виконання.

source: This decorator is itself not available at runtime. It is mainly intended to mark classes that are defined in type stub files if an implementation returns an instance of a private class::
uk: Сам цей декоратор недоступний під час виконання. В основному він призначений для позначення класів, визначених у файлах-заглушках типу, якщо реалізація повертає екземпляр приватного класу::

source: Note that returning instances of private classes is not recommended. It is usually preferable to make such classes public.
uk: Зауважте, що повертати екземпляри приватних класів не рекомендується. Зазвичай бажано зробити такі заняття публічними.

source: Introspection helpers
uk: Помічники в самоаналізі

source: Return a dictionary containing type hints for a function, method, module or class object.
uk: Повертає словник, що містить підказки типу для функції, методу, модуля або об’єкта класу.

source: The function recursively replaces all ``Annotated[T, ...]`` with ``T``, unless ``include_extras`` is set to ``True`` (see :class:`Annotated` for more information). For example::
uk: Функція рекурсивно замінює всі ``Annotated[T, ...]`` на ``T``, якщо ``include_extras`` не встановлено на ``True`` (перегляньте :class:`Annotated` для отримання додаткової інформації) . Наприклад::

source: :func:`get_type_hints` does not work with imported :ref:`type aliases <type-aliases>` that include forward references. Enabling postponed evaluation of annotations (:pep:`563`) may remove the need for most forward references.
uk: :func:`get_type_hints` не працює з імпортованими :ref:`псевдонімами типу <type-aliases>`, які містять прямі посилання. Увімкнення відкладеної оцінки анотацій (:pep:`563`) може позбавити потреби в більшості посилань.

source: Added ``include_extras`` parameter as part of :pep:`593`.
uk: Додано параметр ``include_extras`` як частину :pep:`593`.

source: Provide basic introspection for generic types and special typing forms.
uk: Забезпечити базову самоаналіз для загальних типів і спеціальних форм набору тексту.

source: For a typing object of the form ``X[Y, Z, ...]`` these functions return ``X`` and ``(Y, Z, ...)``. If ``X`` is a generic alias for a builtin or :mod:`collections` class, it gets normalized to the original class. If ``X`` is a union or :class:`Literal` contained in another generic type, the order of ``(Y, Z, ...)`` may be different from the order of the original arguments ``[Y, Z, ...]`` due to type caching. For unsupported objects return ``None`` and ``()`` correspondingly. Examples::
uk: Для об’єкта типу ``X[Y, Z, ...]`` ці функції повертають ``X`` і ``(Y, Z, ...)``. Якщо ``X`` є загальним псевдонімом для вбудованого класу або :mod:`collections` класу, він нормалізується до оригінального класу. Якщо ``X`` є об’єднанням або :class:`Literal`, що міститься в іншому загальному типі, порядок ``(Y, Z, ...)`` може відрізнятися від порядку вихідних аргументів ``[Y, Z, ...]`` через кешування типів. Для непідтримуваних об’єктів поверніть ``None`` і ``()`` відповідно. Приклади::

source: Check if a type is a :class:`TypedDict`.
uk: Перевірте, чи є тип :class:`TypedDict`.

source: A class used for internal typing representation of string forward references. For example, ``List["SomeClass"]`` is implicitly transformed into ``List[ForwardRef("SomeClass")]``. This class should not be instantiated by a user, but may be used by introspection tools.
uk: Клас, який використовується для внутрішнього представлення типізації посилань на рядок. Наприклад, ``List["SomeClass"]`` неявно перетворюється на ``List[ForwardRef("SomeClass")]``. Цей клас не повинен створюватися користувачем, але може використовуватися інструментами самоаналізу.

source: :pep:`585` generic types such as ``list["SomeClass"]`` will not be implicitly transformed into ``list[ForwardRef("SomeClass")]`` and thus will not automatically resolve to ``list[SomeClass]``.
uk: :pep:`585` загальні типи, такі як ``list["SomeClass"]``, не будуть неявно перетворені в ``list[ForwardRef("SomeClass")]`` і, таким чином, не будуть автоматично перетворені в ``list[ SomeClass]``.

source: Constant
uk: Постійний

source: A special constant that is assumed to be ``True`` by 3rd party static type checkers. It is ``False`` at runtime. Usage::
uk: Спеціальна константа, яка вважається ``True`` сторонніми засобами перевірки статичного типу. Це ``False`` під час виконання. Використання::

source: The first type annotation must be enclosed in quotes, making it a "forward reference", to hide the ``expensive_mod`` reference from the interpreter runtime. Type annotations for local variables are not evaluated, so the second annotation does not need to be enclosed in quotes.
uk: Анотація першого типу має бути взята в лапки, що робить її "прямим посиланням", щоб приховати посилання ``expensive_mod`` від середовища виконання інтерпретатора. Анотації типу для локальних змінних не оцінюються, тому другу анотацію не потрібно брати в лапки.

source: If ``from __future__ import annotations`` is used, annotations are not evaluated at function definition time. Instead, they are stored as strings in ``__annotations__``. This makes it unnecessary to use quotes around the annotation (see :pep:`563`).
uk: Якщо використовується ``from __future__ import annotations``, анотації не оцінюються під час визначення функції. Натомість вони зберігаються як рядки в ``__annotations__``. Це робить непотрібним використання лапок навколо анотації (див. :pep:`563`).
