Repository: seanpm2001/python-docs-uk
Catalog: library/typing.po
Languages: uk

source: :mod:`typing` --- Support for type hints
uk: :mod:`typing` --- Підтримка підказок типу

source: **Source code:** :source:`Lib/typing.py`
uk: **Вихідний код:** :source:`Lib/typing.py`

source: The Python runtime does not enforce function and variable type annotations. They can be used by third party tools such as type checkers, IDEs, linters, etc.
uk: Середовище виконання Python не використовує анотації типів функцій чи змінних. Вони можуть використовуватися сторонніми інструментами, на кшталт аналізаторів типів, IDE, лінтерів тощо.

source: This module provides runtime support for type hints. The most fundamental support consists of the types :data:`Any`, :data:`Union`, :data:`Callable`, :class:`TypeVar`, and :class:`Generic`. For a full specification, please see :pep:`484`. For a simplified introduction to type hints, see :pep:`483`.
uk: Цей модуль впроваджує підтримку підказок типу під час виконання. Найбільш фундаментальна підтримка складається з типів :data:`Any`, :data:`Union`, :data:`Callable`, :class:`TypeVar` і :class:`Generic`. Повну специфікацію див. :pep:`484`. Для спрощеного вступу до підказок типу див. :pep:`483`.

source: The function below takes and returns a string and is annotated as follows::
uk: Наведена нижче функція приймає та повертає рядок і анотується таким чином:

source: In the function ``greeting``, the argument ``name`` is expected to be of type :class:`str` and the return type :class:`str`. Subtypes are accepted as arguments.
uk: У функції ``greeting`` аргумент ``name`` має мати тип :class:`str` і тип повернення :class:`str`. Підтипи приймаються як аргументи.

source: New features are frequently added to the ``typing`` module. The `typing_extensions <https://pypi.org/project/typing-extensions/>`_ package provides backports of these new features to older versions of Python.
uk: До модуля ``введення`` часто додаються нові функції. Пакет `typing_extensions <https://pypi.org/project/typing-extensions/>`_ забезпечує зворотні порти цих нових функцій для старіших версій Python.

source: Relevant PEPs
uk: PEP'и за темою

source: Since the initial introduction of type hints in :pep:`484` and :pep:`483`, a number of PEPs have modified and enhanced Python's framework for type annotations. These include:
uk: З моменту появи підказок типів у :pep:`484` і :pep:`483` низка PEP'ів змінили та покращили структуру Python для анотацій типів. Серед них:

source: :pep:`526`: Syntax for Variable Annotations
uk: :pep:`526`: Синтаксис для анотацій змінних

source: *Introducing* syntax for annotating variables outside of function definitions, and :data:`ClassVar`
uk: *Представляємо* синтаксис для анотування змінних поза визначеннями функцій і :data:`ClassVar`

source: :pep:`544`: Protocols: Structural subtyping (static duck typing)
uk: :pep:`544`: Протоколи: структурне підтипування (статичне типування)

source: *Introducing* :class:`Protocol` and the :func:`@runtime_checkable<runtime_checkable>` decorator
uk: *Представляємо* :class:`Protocol` і декоратор :func:`@runtime_checkable <runtime_checkable>`

source: :pep:`585`: Type Hinting Generics In Standard Collections
uk: :pep:`585`: Підказки узагальнень для стандартних колекцій

source: *Introducing* :class:`types.GenericAlias` and the ability to use standard library classes as :ref:`generic types<types-genericalias>`
uk: *Представляємо* :class:`types.GenericAlias` і можливість використовувати стандартні бібліотечні класи як :ref:` узагальнені типи <types-genericalias>`

source: :pep:`586`: Literal Types
uk: :pep:`586`: Літеральні типи

source: *Introducing* :data:`Literal`
uk: *Представляємо* :data:`Literal`

source: :pep:`589`: TypedDict: Type Hints for Dictionaries with a Fixed Set of Keys
uk: :pep:`589`: TypedDict: Підказки типів для словників з фіксованим набором ключів

source: *Introducing* :class:`TypedDict`
uk: *Представляємо* :class:`TypedDict`

source: :pep:`591`: Adding a final qualifier to typing
uk: :pep:`591`: Додавання кінцевого кваліфікатора до введення

source: *Introducing* :data:`Final` and the :func:`@final<final>` decorator
uk: *Представляємо* :data:`Final` і декоратор :func:`@final <final>`

source: :pep:`593`: Flexible function and variable annotations
uk: :pep:`593`: Гнучкі анотації функцій та змінних

source: *Introducing* :data:`Annotated`
uk: *Представляємо* :data:`Annotated`

source: :pep:`604`: Allow writing union types as ``X | Y``
uk: :pep:`604`: Дозволити запис типів об’єднань як ``X | Y``

source: *Introducing* :data:`types.UnionType` and the ability to use the binary-or operator ``|`` to signify a :ref:`union of types<types-union>`
uk: *Представляємо* :data:`types.UnionType` і можливість використовувати двійковий оператор ``|`` для позначення :ref:`об’єднання типів <types-union>`

source: :pep:`612`: Parameter Specification Variables
uk: :pep:`612`: Змінні специфікації параметрів

source: *Introducing* :class:`ParamSpec` and :data:`Concatenate`
uk: *Представляємо* :class:`ParamSpec` і :data:`Concatenate`

source: :pep:`613`: Explicit Type Aliases
uk: :pep:`613`: Явні псевдоніми типу

source: *Introducing* :data:`TypeAlias`
uk: *Представляємо* :data:`TypeAlias`

source: :pep:`647`: User-Defined Type Guards
uk: :pep:`647`: Охоронці типу, визначені користувачем

source: *Introducing* :data:`TypeGuard`
uk: *Представляємо* :data:`TypeGuard`

source: Type aliases
uk: Псевдоніми типів

source: A type alias is defined by assigning the type to the alias. In this example, ``Vector`` and ``list[float]`` will be treated as interchangeable synonyms::
uk: Псевдонім типу визначається шляхом призначення типу псевдоніму. У цьому прикладі ``Вектор`` і ``список[float]`` розглядатимуться як взаємозамінні синоніми:

source: Type aliases are useful for simplifying complex type signatures. For example::
uk: Псевдоніми типів корисні для спрощення анотацій складних типів. Наприклад::

source: Note that ``None`` as a type hint is a special case and is replaced by ``type(None)``.
uk: Зауважте, що ``None`` як підказка типу є окремим випадком і замінюється ``type(None)``.

source: Use the :class:`NewType` helper to create distinct types::
uk: Використовуйте помічник :class:`NewType` для створення різних типів::

source: The static type checker will treat the new type as if it were a subclass of the original type. This is useful in helping catch logical errors::
uk: Аналізатор типів розглядатиме новий тип як підклас вихідного типу. Це корисно для виявлення логічних помилок:

source: You may still perform all ``int`` operations on a variable of type ``UserId``, but the result will always be of type ``int``. This lets you pass in a ``UserId`` wherever an ``int`` might be expected, but will prevent you from accidentally creating a ``UserId`` in an invalid way::
uk: Ви все ще можете виконувати всі операції ``int`` зі змінною типу ``UserId``, але результат завжди матиме тип ``int``. Це дозволяє передавати ``UserId`` усюди, де можна очікувати ``int``, але запобігає випадковому створенню ``UserId`` недійсним способом::

source: Note that these checks are enforced only by the static type checker. At runtime, the statement ``Derived = NewType('Derived', Base)`` will make ``Derived`` a callable that immediately returns whatever parameter you pass it. That means the expression ``Derived(some_value)`` does not create a new class or introduce much overhead beyond that of a regular function call.
uk: Зауважте, що ці перевірки виконуються лише засобом перевірки статичного типу. Під час виконання оператор ``Derived = NewType('Derived', Base)`` зробить ``Derived`` викликом, який негайно повертає будь-який параметр, який ви йому передаєте. Це означає, що вираз ``Derived(some_value)`` не створює нового класу і не вносить багато додаткових витрат, крім звичайного виклику функції.

source: More precisely, the expression ``some_value is Derived(some_value)`` is always true at runtime.
uk: Точніше, вираз ``some_value is Derived(some_value)`` завжди вірний під час виконання.

source: It is invalid to create a subtype of ``Derived``::
uk: Неможливо створити підтип ``Derived``::

source: However, it is possible to create a :class:`NewType` based on a 'derived' ``NewType``::
uk: Однак можна створити :class:`NewType` на основі "похідного" ``NewType``::

source: and typechecking for ``ProUserId`` will work as expected.
uk: і аналіз типів для ``ProUserId`` працюватиме належним чином.

source: See :pep:`484` for more details.
uk: Дивіться :pep:`484` для більш детальної інформації.

source: Recall that the use of a type alias declares two types to be *equivalent* to one another. Doing ``Alias = Original`` will make the static type checker treat ``Alias`` as being *exactly equivalent* to ``Original`` in all cases. This is useful when you want to simplify complex type signatures.
uk: Зверніть увагу, що використання псевдоніма типу оголошує два типи *еквівалентними* один одному. Виконання ``Alias = Original`` змусить засіб перевірки статичного типу розглядати ``Alias`` як *точно еквівалентний* ``Original`` у будь-якому випадку. Це корисно, коли ви хочете спростити анотації складних типів.

source: In contrast, ``NewType`` declares one type to be a *subtype* of another. Doing ``Derived = NewType('Derived', Original)`` will make the static type checker treat ``Derived`` as a *subclass* of ``Original``, which means a value of type ``Original`` cannot be used in places where a value of type ``Derived`` is expected. This is useful when you want to prevent logic errors with minimal runtime cost.
uk: На відміну, ``NewType`` оголошує один тип як *підтип* іншого. Якщо виконати ``Derived = NewType('Derived', Original)``, аналізатор типів розглядатиме ``Derived`` як *підклас* ``Original``, що означає значення типу ``Original`` не можна використовувати там, де очікується значення типу ``Derived``. Це корисно, коли ви хочете запобігти логічним помилкам з мінімальними витратами на виконання.

source: ``NewType`` is now a class rather than a function. There is some additional runtime cost when calling ``NewType`` over a regular function. However, this cost will be reduced in 3.11.0.
uk: ``NewType`` тепер є класом, а не функцією. Під час виклику ``NewType`` через звичайну функцію виникає додаткова вартість виконання. Однак ця вартість буде зменшена в 3.11.0.

source: Callable
uk: Викличний

source: Frameworks expecting callback functions of specific signatures might be type hinted using ``Callable[[Arg1Type, Arg2Type], ReturnType]``.
uk: Фреймворки, які очікують функцій-колбеків з певною сигнатурою, можуть вказати цю підказку типу за допомогою ``Callable[[Arg1Type, Arg2Type], ReturnType]``.

source: For example::
uk: Наприклад::

source: It is possible to declare the return type of a callable without specifying the call signature by substituting a literal ellipsis for the list of arguments in the type hint: ``Callable[..., ReturnType]``.
uk: Можна оголосити тип повернення викликаного без вказівки підпису виклику, замінивши літеральний еліпс на список аргументів у підказці типу: ``Callable[..., ReturnType]``.

source: Callables which take other callables as arguments may indicate that their parameter types are dependent on each other using :class:`ParamSpec`. Additionally, if that callable adds or removes arguments from other callables, the :data:`Concatenate` operator may be used. They take the form ``Callable[ParamSpecVariable, ReturnType]`` and ``Callable[Concatenate[Arg1Type, Arg2Type, ..., ParamSpecVariable], ReturnType]`` respectively.
uk: Викликаються, які приймають інші викликані як аргументи, можуть вказувати, що їхні типи параметрів залежать один від одного за допомогою :class:`ParamSpec`. Крім того, якщо цей виклик додає або видаляє аргументи з інших викликів, можна використовувати оператор :data:`Concatenate`. Вони приймають форму ``Callable[ParamSpecVariable, ReturnType]`` і ``Callable[Concatenate[Arg1Type, Arg2Type, ..., ParamSpecVariable], ReturnType]`` відповідно.

source: The documentation for :class:`ParamSpec` and :class:`Concatenate` provides examples of usage in ``Callable``.
uk: Документація для :class:`ParamSpec` і :class:`Concatenate` містить приклади використання в ``Callable``.

source: Generics
uk: Узагальнення

source: Since type information about objects kept in containers cannot be statically inferred in a generic way, abstract base classes have been extended to support subscription to denote expected types for container elements.
uk: Оскільки інформація про тип об’єктів, що зберігається в контейнерах, не може бути статично виведена загальним способом, абстрактні базові класи були розширені для підтримки підписки для позначення очікуваних типів для елементів контейнера.

source: Generics can be parameterized by using a factory available in typing called :class:`TypeVar`.
uk: Універсали можна параметризувати за допомогою фабрики, доступної в типі, яка називається :class:`TypeVar`.

source: User-defined generic types
uk: Визначені користувачем загальні типи

source: A user-defined class can be defined as a generic class.
uk: Визначений користувачем клас можна визначити як загальний клас.

source: ``Generic[T]`` as a base class defines that the class ``LoggedVar`` takes a single type parameter ``T`` . This also makes ``T`` valid as a type within the class body.
uk: ``Generic[T]`` як базовий клас визначає, що клас ``LoggedVar`` приймає один параметр типу ``T``. Це також робить ``T`` дійсним як тип у тілі класу.

source: A generic type can have any number of type variables. All varieties of :class:`TypeVar` are permissible as parameters for a generic type::
uk: Загальний тип може мати будь-яку кількість змінних типу. Усі різновиди :class:`TypeVar` допустимі як параметри для загального типу::

source: Each type variable argument to :class:`Generic` must be distinct. This is thus invalid::
uk: Кожен аргумент змінної типу для :class:`Generic` має бути окремим. Таким чином, це недійсно::

source: You can use multiple inheritance with :class:`Generic`::
uk: Ви можете використовувати множинне успадкування з :class:`Generic`::

source: When inheriting from generic classes, some type variables could be fixed::
uk: При успадкуванні від загальних класів деякі змінні типу можуть бути виправлені:

source: In this case ``MyDict`` has a single parameter, ``T``.
uk: У цьому випадку ``MyDict`` має єдиний параметр, ``T``.

source: Using a generic class without specifying type parameters assumes :data:`Any` for each position. In the following example, ``MyIterable`` is not generic but implicitly inherits from ``Iterable[Any]``::
uk: Використання загального класу без зазначення параметрів типу передбачає :data:`Any` для кожної позиції. У наступному прикладі ``MyIterable`` не є загальним, але неявно успадковує ``Iterable[Any]``::

source: User defined generic type aliases are also supported. Examples::
uk: Також підтримуються визначені користувачем псевдоніми загального типу. Приклади::

source: :class:`Generic` no longer has a custom metaclass.
uk: :class:`Generic` більше не має спеціального метакласу.

source: User-defined generics for parameter expressions are also supported via parameter specification variables in the form ``Generic[P]``. The behavior is consistent with type variables' described above as parameter specification variables are treated by the typing module as a specialized type variable. The one exception to this is that a list of types can be used to substitute a :class:`ParamSpec`::
uk: Визначені користувачем генерики для виразів параметрів також підтримуються через змінні специфікації параметрів у формі ``Generic[P]``. Поведінка узгоджується зі змінними типу, описаними вище, оскільки змінні специфікації параметрів обробляються модулем типізації як спеціалізована змінна типу. Єдиним винятком із цього є те, що список типів можна використовувати для заміни :class:`ParamSpec`::

source: Furthermore, a generic with only one parameter specification variable will accept parameter lists in the forms ``X[[Type1, Type2, ...]]`` and also ``X[Type1, Type2, ...]`` for aesthetic reasons. Internally, the latter is converted to the former, so the following are equivalent::
uk: Крім того, універсал із лише однією змінною специфікації параметра прийматиме списки параметрів у формах ``X[[Type1, Type2, ...]]``, а також ``X[Type1, Type2, ...]`` для естетичні причини. Внутрішньо остання перетворюється на першу, тому наступні еквівалентні:

source: Do note that generics with :class:`ParamSpec` may not have correct ``__parameters__`` after substitution in some cases because they are intended primarily for static type checking.
uk: Зауважте, що генерики з :class:`ParamSpec` можуть не мати правильних ``__parameters__`` після заміни в деяких випадках, оскільки вони призначені в основному для перевірки статичних типів.

source: :class:`Generic` can now be parameterized over parameter expressions. See :class:`ParamSpec` and :pep:`612` for more details.
uk: :class:`Generic` тепер можна параметризувати над виразами параметрів. Дивіться :class:`ParamSpec` і :pep:`612` для отримання додаткової інформації.

source: A user-defined generic class can have ABCs as base classes without a metaclass conflict. Generic metaclasses are not supported. The outcome of parameterizing generics is cached, and most types in the typing module are hashable and comparable for equality.
uk: Визначений користувачем загальний клас може мати ABC як базові класи без конфлікту метакласів. Загальні метакласи не підтримуються. Результат параметризації генериків кешується, і більшість типів у модулі введення можна хешувати та порівняти на рівність.

source: The :data:`Any` type
uk: Тип :data:`Any`

source: A special kind of type is :data:`Any`. A static type checker will treat every type as being compatible with :data:`Any` and :data:`Any` as being compatible with every type.
uk: Особливий вид типу — :data:`Any`. Засіб перевірки статичних типів розглядатиме кожен тип як сумісний із :data:`Any` і :data:`Any` як сумісні з кожним типом.

source: This means that it is possible to perform any operation or method call on a value of type :data:`Any` and assign it to any variable::
uk: Це означає, що можна виконати будь-яку операцію або викликати метод над значенням типу :data:`Any` і призначити його будь-якій змінній::

source: Furthermore, all functions without a return type or parameter types will implicitly default to using :data:`Any`::
uk: Крім того, усі функції без типу повернення або типів параметрів неявно використовуватимуть за умовчанням :data:`Any`::

source: This behavior allows :data:`Any` to be used as an *escape hatch* when you need to mix dynamically and statically typed code.
uk: Така поведінка дозволяє :data:`Any` використовувати як *вихідний люк*, коли вам потрібно змішати динамічний і статичний код.

source: Contrast the behavior of :data:`Any` with the behavior of :class:`object`. Similar to :data:`Any`, every type is a subtype of :class:`object`. However, unlike :data:`Any`, the reverse is not true: :class:`object` is *not* a subtype of every other type.
uk: Порівняйте поведінку :data:`Any` з поведінкою :class:`object`. Подібно до :data:`Any`, кожен тип є підтипом :class:`object`. Однак, на відміну від :data:`Any`, зворотне не вірно: :class:`object` *не* є підтипом будь-якого іншого типу.

source: That means when the type of a value is :class:`object`, a type checker will reject almost all operations on it, and assigning it to a variable (or using it as a return value) of a more specialized type is a type error. For example::
uk: Це означає, що коли тип значення :class:`object`, засіб перевірки типів відхилить майже всі операції над ним, а присвоєння його змінній (або використання її як значення, що повертається) більш спеціалізованого типу є типом помилка. Наприклад::

source: Use :class:`object` to indicate that a value could be any type in a typesafe manner. Use :data:`Any` to indicate that a value is dynamically typed.
uk: Використовуйте :class:`object`, щоб вказати, що значення може мати будь-який тип у безпечний спосіб. Використовуйте :data:`Any`, щоб вказати, що значення вводиться динамічно.

source: Nominal vs structural subtyping
uk: Номінальний проти структурного підтипу

source: Initially :pep:`484` defined the Python static type system as using *nominal subtyping*. This means that a class ``A`` is allowed where a class ``B`` is expected if and only if ``A`` is a subclass of ``B``.
uk: Спочатку :pep:`484` визначив систему статичних типів Python як таку, що використовує *номінальний підтип*. Це означає, що клас ``A`` дозволений там, де очікується клас ``B``, якщо і тільки якщо ``A`` є підкласом ``B``.

source: This requirement previously also applied to abstract base classes, such as :class:`~collections.abc.Iterable`. The problem with this approach is that a class had to be explicitly marked to support them, which is unpythonic and unlike what one would normally do in idiomatic dynamically typed Python code. For example, this conforms to :pep:`484`::
uk: Ця вимога раніше також застосовувалася до абстрактних базових класів, таких як :class:`~collections.abc.Iterable`. Проблема з цим підходом полягає в тому, що клас повинен бути явно позначений для їх підтримки, що не є пітонічним і не схожим на те, що зазвичай робили б у ідіоматичному динамічно введеному коді Python. Наприклад, це відповідає :pep:`484`::

source: :pep:`544` allows to solve this problem by allowing users to write the above code without explicit base classes in the class definition, allowing ``Bucket`` to be implicitly considered a subtype of both ``Sized`` and ``Iterable[int]`` by static type checkers. This is known as *structural subtyping* (or static duck-typing)::
uk: :pep:`544` дозволяє вирішити цю проблему, дозволяючи користувачам писати наведений вище код без явних базових класів у визначенні класу, дозволяючи ``Bucket`` неявно вважатися підтипом як ``Sized``, так і ``Iterable[int]`` засобами перевірки статичних типів. Це відоме як *структурне підтипування* (або статичне качине типування):

source: Moreover, by subclassing a special class :class:`Protocol`, a user can define new custom protocols to fully enjoy structural subtyping (see examples below).
uk: Крім того, створивши підклас спеціального класу :class:`Protocol`, користувач може визначати нові користувальницькі протоколи, щоб повною мірою користуватися структурними підтипами (див. приклади нижче).

source: Module contents
uk: Зміст модуля

source: The module defines the following classes, functions and decorators.
uk: Модуль визначає наступні класи, функції та декоратори.

source: This module defines several types that are subclasses of pre-existing standard library classes which also extend :class:`Generic` to support type variables inside ``[]``. These types became redundant in Python 3.9 when the corresponding pre-existing classes were enhanced to support ``[]``.
uk: Цей модуль визначає кілька типів, які є підкласами вже існуючих класів стандартної бібліотеки, які також розширюють :class:`Generic` для підтримки змінних типу всередині ``[]``. Ці типи стали надлишковими в Python 3.9, коли відповідні існуючі класи були вдосконалені для підтримки ``[]``.

source: The redundant types are deprecated as of Python 3.9 but no deprecation warnings will be issued by the interpreter. It is expected that type checkers will flag the deprecated types when the checked program targets Python 3.9 or newer.
uk: Надлишкові типи застаріли, починаючи з Python 3.9, але інтерпретатор не видасть попереджень про застаріння. Очікується, що засоби перевірки типів позначатимуть застарілі типи, якщо перевірена програма призначена для Python 3.9 або новішої версії.
