Repository: seanpm2001/python-docs-uk
Catalog: library/typing.po
Languages: uk

source: At runtime, ``isinstance(x, T)`` will raise :exc:`TypeError`. In general, :func:`isinstance` and :func:`issubclass` should not be used with types.
uk: Під час виконання ``isinstance(x, T)`` викличе :exc:`TypeError`. Загалом, :func:`isinstance` і :func:`issubclass` не слід використовувати з типами.

source: Type variables may be marked covariant or contravariant by passing ``covariant=True`` or ``contravariant=True``. See :pep:`484` for more details. By default, type variables are invariant.
uk: Змінні типу можна позначити коваріантними або контраваріантними шляхом передачі ``covariant=True`` або ``contravariant=True``. Дивіться :pep:`484` для більш детальної інформації. За замовчуванням змінні типу є інваріантними.

source: Parameter specification variable. A specialized version of :class:`type variables <TypeVar>`.
uk: Змінна специфікації параметра. Спеціалізована версія :class:`типу змінних <TypeVar>`.

source: Parameter specification variables exist primarily for the benefit of static type checkers. They are used to forward the parameter types of one callable to another callable -- a pattern commonly found in higher order functions and decorators. They are only valid when used in ``Concatenate``, or as the first argument to ``Callable``, or as parameters for user-defined Generics. See :class:`Generic` for more information on generic types.
uk: Змінні специфікації параметрів існують насамперед для використання засобів перевірки статичних типів. Вони використовуються для пересилання типів параметрів одного викликаного до іншого викликаного — шаблон, який зазвичай зустрічається у функціях вищого порядку та декораторах. Вони дійсні лише тоді, коли використовуються в ``Concatenate``, або як перший аргумент ``Callable``, або як параметри для визначених користувачем Generics. Перегляньте :class:`Generic` для отримання додаткової інформації про загальні типи.

source: For example, to add basic logging to a function, one can create a decorator ``add_logging`` to log function calls. The parameter specification variable tells the type checker that the callable passed into the decorator and the new callable returned by it have inter-dependent type parameters::
uk: Наприклад, щоб додати базове журналювання до функції, можна створити декоратор ``add_logging`` для журналювання викликів функцій. Змінна специфікації параметра повідомляє перевіряльнику типу, що викликаний, переданий декоратору, і новий викликаний, повернутий ним, мають взаємозалежні параметри типу:

source: Without ``ParamSpec``, the simplest way to annotate this previously was to use a :class:`TypeVar` with bound ``Callable[..., Any]``. However this causes two problems:
uk: Без ``ParamSpec`` найпростішим способом анотації цього раніше було використання :class:`TypeVar` із прив’язкою ``Callable[..., Any]``. Однак це викликає дві проблеми:

source: The type checker can't type check the ``inner`` function because ``*args`` and ``**kwargs`` have to be typed :data:`Any`.
uk: Перевірка типу не може перевірити тип функції ``inner``, тому що ``*args`` і ``**kwargs`` мають бути введені :data:`Any`.

source: :func:`~cast` may be required in the body of the ``add_logging`` decorator when returning the ``inner`` function, or the static type checker must be told to ignore the ``return inner``.
uk: :func:`~cast` може знадобитися в тілі декоратора ``add_logging`` під час повернення функції ``inner``, або засіб перевірки статичного типу повинен ігнорувати ``return inner``.

source: Since ``ParamSpec`` captures both positional and keyword parameters, ``P.args`` and ``P.kwargs`` can be used to split a ``ParamSpec`` into its components. ``P.args`` represents the tuple of positional parameters in a given call and should only be used to annotate ``*args``. ``P.kwargs`` represents the mapping of keyword parameters to their values in a given call, and should be only be used to annotate ``**kwargs``. Both attributes require the annotated parameter to be in scope. At runtime, ``P.args`` and ``P.kwargs`` are instances respectively of :class:`ParamSpecArgs` and :class:`ParamSpecKwargs`.
uk: Оскільки ``ParamSpec`` фіксує як позиційні параметри, так і параметри ключових слів, ``P.args`` і ``P.kwargs`` можна використовувати для поділу ``ParamSpec`` на його компоненти. ``P.args`` представляє кортеж позиційних параметрів у заданому виклику, і його слід використовувати лише для анотації ``*args``. ``P.kwargs`` представляє зіставлення параметрів ключового слова з їхніми значеннями в заданому виклику, і його слід використовувати лише для анотації ``**kwargs``. Обидва атрибути вимагають, щоб анотований параметр був у межах. Під час виконання ``P.args`` і ``P.kwargs`` є екземплярами відповідно :class:`ParamSpecArgs` і :class:`ParamSpecKwargs`.

source: Parameter specification variables created with ``covariant=True`` or ``contravariant=True`` can be used to declare covariant or contravariant generic types. The ``bound`` argument is also accepted, similar to :class:`TypeVar`. However the actual semantics of these keywords are yet to be decided.
uk: Змінні специфікації параметрів, створені за допомогою ``covariant=True`` або ``contravariant=True``, можна використовувати для оголошення коваріантних або контраваріантних загальних типів. Аргумент ``bound`` також приймається, подібно до :class:`TypeVar`. Однак фактичну семантику цих ключових слів ще належить визначити.

source: Only parameter specification variables defined in global scope can be pickled.
uk: Вибирати можна лише змінні специфікації параметрів, визначені в глобальній області видимості.

source: :class:`Callable` and :class:`Concatenate`.
uk: :class:`Callable` і :class:`Concatenate`.

source: Arguments and keyword arguments attributes of a :class:`ParamSpec`. The ``P.args`` attribute of a ``ParamSpec`` is an instance of ``ParamSpecArgs``, and ``P.kwargs`` is an instance of ``ParamSpecKwargs``. They are intended for runtime introspection and have no special meaning to static type checkers.
uk: Аргументи та атрибути ключових аргументів :class:`ParamSpec`. Атрибут ``P.args`` ``ParamSpec`` є екземпляром ``ParamSpecArgs``, а ``P.kwargs`` є екземпляром ``ParamSpecKwargs``. Вони призначені для інтроспекції під час виконання і не мають особливого значення для перевірки статичних типів.

source: Calling :func:`get_origin` on either of these objects will return the original ``ParamSpec``::
uk: Виклик :func:`get_origin` для будь-якого з цих об’єктів поверне оригінальний ``ParamSpec``::

source: ``AnyStr`` is a :class:`constrained type variable <TypeVar>` defined as ``AnyStr = TypeVar('AnyStr', str, bytes)``.
uk: ``AnyStr`` — це :class:`обмежена змінна типу <TypeVar>`, визначена як ``AnyStr = TypeVar('AnyStr', str, bytes)``.

source: It is meant to be used for functions that may accept any kind of string without allowing different kinds of strings to mix. For example::
uk: Він призначений для використання для функцій, які можуть приймати будь-які типи рядків, не допускаючи змішування різних типів рядків. Наприклад::

source: Base class for protocol classes. Protocol classes are defined like this::
uk: Базовий клас для класів протоколу. Класи протоколів визначаються так:

source: Such classes are primarily used with static type checkers that recognize structural subtyping (static duck-typing), for example::
uk: Такі класи в основному використовуються із засобами перевірки статичних типів, які розпізнають структурні підтипи (статичне типування), наприклад:

source: Protocol classes can be generic, for example::
uk: Класи протоколів можуть бути загальними, наприклад:

source: Mark a protocol class as a runtime protocol.
uk: Позначте клас протоколу як протокол виконання.

source: Such a protocol can be used with :func:`isinstance` and :func:`issubclass`. This raises :exc:`TypeError` when applied to a non-protocol class. This allows a simple-minded structural check, very similar to "one trick ponies" in :mod:`collections.abc` such as :class:`~collections.abc.Iterable`. For example::
uk: Такий протокол можна використовувати з :func:`isinstance` і :func:`issubclass`. Це викликає :exc:`TypeError`, коли застосовується до непротокольного класу. Це дозволяє здійснити просту структурну перевірку, дуже схожу на "поні з одним трюком" у :mod:`collections.abc`, наприклад :class:`~collections.abc.Iterable`. Наприклад::

source: :func:`runtime_checkable` will check only the presence of the required methods, not their type signatures. For example, :class:`ssl.SSLObject` is a class, therefore it passes an :func:`issubclass` check against :data:`Callable`. However, the :meth:`ssl.SSLObject.__init__` method exists only to raise a :exc:`TypeError` with a more informative message, therefore making it impossible to call (instantiate) :class:`ssl.SSLObject`.
uk: :func:`runtime_checkable` перевірятиме лише наявність необхідних методів, а не їхні сигнатури типів. Наприклад, :class:`ssl.SSLObject` є класом, тому він проходить перевірку :func:`issubclass` на :data:`Callable`. Однак метод :meth:`ssl.SSLObject.__init__` існує лише для того, щоб викликати :exc:`TypeError` з більш інформативним повідомленням, отже, унеможливлюючи виклик (інстанціювання) :class:`ssl.SSLObject`.

source: Other special directives
uk: Інші спеціальні директиви

source: These are not used in annotations. They are building blocks for declaring types.
uk: Вони не використовуються в анотаціях. Вони є будівельними блоками для оголошення типів.

source: Typed version of :func:`collections.namedtuple`.
uk: Введена версія :func:`collections.namedtuple`.

source: This is equivalent to::
uk: Це еквівалентно::

source: To give a field a default value, you can assign to it in the class body::
uk: Щоб надати полю значення за замовчуванням, ви можете призначити йому в тілі класу::

source: Fields with a default value must come after any fields without a default.
uk: Поля зі значенням за замовчуванням мають бути після будь-яких полів без значення за замовчуванням.

source: The resulting class has an extra attribute ``__annotations__`` giving a dict that maps the field names to the field types. (The field names are in the ``_fields`` attribute and the default values are in the ``_field_defaults`` attribute, both of which are part of the :func:`~collections.namedtuple` API.)
uk: Отриманий клас має додатковий атрибут ``__annotations__``, що дає диктофон, який зіставляє назви полів із типами полів. (Імена полів містяться в атрибуті ``_fields``, а значення за замовчуванням — в атрибуті ``_field_defaults``, обидва з яких є частиною API :func:`~collections.namedtuple`.)

source: ``NamedTuple`` subclasses can also have docstrings and methods::
uk: Підкласи ``NamedTuple`` також можуть мати рядки документації та методи:

source: Backward-compatible usage::
uk: Зворотно сумісне використання::

source: Added support for :pep:`526` variable annotation syntax.
uk: Додано підтримку синтаксису анотації змінної :pep:`526`.

source: Added support for default values, methods, and docstrings.
uk: Додано підтримку стандартних значень, методів і рядків документів.

source: The ``_field_types`` and ``__annotations__`` attributes are now regular dictionaries instead of instances of ``OrderedDict``.
uk: Атрибути ``_field_types`` і ``__annotations__`` тепер є звичайними словниками замість екземплярів ``OrderedDict``.

source: Removed the ``_field_types`` attribute in favor of the more standard ``__annotations__`` attribute which has the same information.
uk: Видалено атрибут ``_field_types`` на користь стандартнішого атрибута ``__annotations__``, який містить ту саму інформацію.

source: A helper class to indicate a distinct type to a typechecker, see :ref:`distinct`. At runtime it returns an object that returns its argument when called. Usage::
uk: Допоміжний клас для вказівки окремого типу для перевірки типів див. :ref:`distinct`. Під час виконання він повертає об’єкт, який повертає свій аргумент під час виклику. Використання::

source: ``NewType`` is now a class rather than a function.
uk: ``NewType`` тепер є класом, а не функцією.

source: Special construct to add type hints to a dictionary. At runtime it is a plain :class:`dict`.
uk: Спеціальна конструкція для додавання підказок типу до словника. Під час виконання це звичайний :class:`dict`.

source: ``TypedDict`` declares a dictionary type that expects all of its instances to have a certain set of keys, where each key is associated with a value of a consistent type. This expectation is not checked at runtime but is only enforced by type checkers. Usage::
uk: ``TypedDict`` оголошує тип словника, який очікує, що всі його екземпляри матимуть певний набір ключів, де кожен ключ пов’язаний зі значенням узгодженого типу. Це очікування не перевіряється під час виконання, а виконується лише засобами перевірки типів. Використання::

source: The functional syntax should also be used when any of the keys are not valid :ref:`identifiers <identifiers>`, for example because they are keywords or contain hyphens. Example::
uk: Функціональний синтаксис також слід використовувати, коли будь-який із ключів недійсний :ref:`identifiers <identifiers>`, наприклад тому, що він є ключовим словом або містить дефіс. Приклад::

source: This means that a ``Point2D`` ``TypedDict`` can have any of the keys omitted. A type checker is only expected to support a literal ``False`` or ``True`` as the value of the ``total`` argument. ``True`` is the default, and makes all items defined in the class body required.
uk: Це означає, що в ``Point2D`` ``TypedDict`` може бути пропущений будь-який із ключів. Очікується, що засіб перевірки типів підтримуватиме лише літерали ``False`` або ``True`` як значення аргументу ``total``. ``True`` є типовим і робить обов’язковими всі елементи, визначені в тілі класу.

source: It is possible for a ``TypedDict`` type to inherit from one or more other ``TypedDict`` types using the class-based syntax. Usage::
uk: Тип ``TypedDict`` може успадкувати від одного або кількох інших типів ``TypedDict`` за допомогою синтаксису на основі класу. Використання::

source: ``Point3D`` has three items: ``x``, ``y`` and ``z``. It is equivalent to this definition::
uk: ``Point3D`` має три елементи: ``x``, ``y`` і ``z``. Це еквівалентно цьому визначенню::

source: A ``TypedDict`` can be introspected via annotations dicts (see :ref:`annotations-howto` for more information on annotations best practices), :attr:`__total__`, :attr:`__required_keys__`, and :attr:`__optional_keys__`.
uk: ``TypedDict`` можна інтроспективно за допомогою dicts анотацій (перегляньте :ref:`annotations-howto` для отримання додаткової інформації про найкращі практики анотацій), :attr:`__total__`, :attr:`__required_keys__` та :attr:`__додаткові_ключі__`.

source: ``Point2D.__total__`` gives the value of the ``total`` argument. Example::
uk: ``Point2D.__total__`` надає значення аргументу ``total``. Приклад::

source: See :pep:`589` for more examples and detailed rules of using ``TypedDict``.
uk: Перегляньте :pep:`589` більше прикладів і детальних правил використання ``TypedDict``.

source: Generic concrete collections
uk: Типові бетонні колекції

source: Corresponding to built-in types
uk: Відповідає вбудованим типам

source: A generic version of :class:`dict`. Useful for annotating return types. To annotate arguments it is preferred to use an abstract collection type such as :class:`Mapping`.
uk: Загальна версія :class:`dict`. Корисно для анотування типів повернення. Щоб анотувати аргументи, бажано використовувати абстрактний тип колекції, такий як :class:`Mapping`.

source: This type can be used as follows::
uk: Цей тип можна використовувати наступним чином:

source: Generic version of :class:`list`. Useful for annotating return types. To annotate arguments it is preferred to use an abstract collection type such as :class:`Sequence` or :class:`Iterable`.
uk: Загальна версія :class:`list`. Корисно для анотування типів повернення. Щоб анотувати аргументи, бажано використовувати абстрактний тип колекції, наприклад :class:`Sequence` або :class:`Iterable`.

source: This type may be used as follows::
uk: Цей тип можна використовувати наступним чином:

source: A generic version of :class:`builtins.set <set>`. Useful for annotating return types. To annotate arguments it is preferred to use an abstract collection type such as :class:`AbstractSet`.
uk: Загальна версія :class:`builtins.set <set>`. Корисно для анотування типів повернення. Щоб анотувати аргументи, бажано використовувати абстрактний тип колекції, такий як :class:`AbstractSet`.

source: A generic version of :class:`builtins.frozenset <frozenset>`.
uk: Загальна версія :class:`builtins.frozenset <frozenset>`.

source: :data:`Tuple` is a special form.
uk: :data:`Tuple` — це спеціальна форма.

source: Corresponding to types in :mod:`collections`
uk: Відповідає типам у :mod:`collections`

source: A generic version of :class:`collections.defaultdict`.
uk: Загальна версія :class:`collections.defaultdict`.

source: A generic version of :class:`collections.OrderedDict`.
uk: Загальна версія :class:`collections.OrderedDict`.

source: A generic version of :class:`collections.ChainMap`.
uk: Загальна версія :class:`collections.ChainMap`.

source: A generic version of :class:`collections.Counter`.
uk: Загальна версія :class:`collections.Counter`.

source: A generic version of :class:`collections.deque`.
uk: Загальна версія :class:`collections.deque`.

source: Other concrete types
uk: Інші види бетону

source: Generic type ``IO[AnyStr]`` and its subclasses ``TextIO(IO[str])`` and ``BinaryIO(IO[bytes])`` represent the types of I/O streams such as returned by :func:`open`.
uk: Загальний тип ``IO[AnyStr]`` і його підкласи ``TextIO(IO[str])`` і ``BinaryIO(IO[bytes])`` представляють типи потоків вводу/виводу, такі як повертаються :func:`open`.

source: The ``typing.io`` namespace is deprecated and will be removed. These types should be directly imported from ``typing`` instead.
uk: Простір імен ``typing.io`` застаріло та буде видалено. Натомість ці типи слід імпортувати безпосередньо з ``typing``.

source: These type aliases correspond to the return types from :func:`re.compile` and :func:`re.match`. These types (and the corresponding functions) are generic in ``AnyStr`` and can be made specific by writing ``Pattern[str]``, ``Pattern[bytes]``, ``Match[str]``, or ``Match[bytes]``.
uk: Ці псевдоніми типів відповідають типам повернення з :func:`re.compile` і :func:`re.match`. Ці типи (і відповідні функції) є загальними в ``AnyStr`` і можуть бути специфічними, написавши ``Pattern[str]``, ``Pattern[bytes]``, ``Match[str]``, або ``Збіг [байтів]``.

source: The ``typing.re`` namespace is deprecated and will be removed. These types should be directly imported from ``typing`` instead.
uk: Простір імен ``typing.re`` застаріло та буде видалено. Натомість ці типи слід імпортувати безпосередньо з ``typing``.

source: Classes ``Pattern`` and ``Match`` from :mod:`re` now support ``[]``. See :pep:`585` and :ref:`types-genericalias`.
uk: Класи ``Pattern`` і ``Match`` від :mod:`re` тепер підтримують ``[]``. Див. :pep:`585` і :ref:`types-genericalias`.

source: ``Text`` is an alias for ``str``. It is provided to supply a forward compatible path for Python 2 code: in Python 2, ``Text`` is an alias for ``unicode``.
uk: ``Текст`` є псевдонімом для ``str``. Він надається для надання прямого сумісного шляху для коду Python 2: у Python 2 "Текст" є псевдонімом для "юнікоду".

source: Use ``Text`` to indicate that a value must contain a unicode string in a manner that is compatible with both Python 2 and Python 3::
uk: Використовуйте ``Текст``, щоб вказати, що значення має містити рядок Юнікод у спосіб, сумісний як з Python 2, так і з Python 3::

source: Abstract Base Classes
uk: Абстрактні базові класи

source: Corresponding to collections in :mod:`collections.abc`
uk: Відповідає колекціям у :mod:`collections.abc`

source: A generic version of :class:`collections.abc.Set`.
uk: Загальна версія :class:`collections.abc.Set`.

source: A generic version of :class:`collections.abc.ByteString`.
uk: Загальна версія :class:`collections.abc.ByteString`.

source: This type represents the types :class:`bytes`, :class:`bytearray`, and :class:`memoryview` of byte sequences.
uk: Цей тип представляє типи :class:`bytes`, :class:`bytearray` і :class:`memoryview` послідовностей байтів.

source: As a shorthand for this type, :class:`bytes` can be used to annotate arguments of any of the types mentioned above.
uk: Як скорочення для цього типу, :class:`bytes` можна використовувати для анотації аргументів будь-якого типу, згаданого вище.

source: A generic version of :class:`collections.abc.Collection`
uk: Загальна версія :class:`collections.abc.Collection`

source: A generic version of :class:`collections.abc.Container`.
uk: Загальна версія :class:`collections.abc.Container`.

source: A generic version of :class:`collections.abc.ItemsView`.
uk: Загальна версія :class:`collections.abc.ItemsView`.

source: A generic version of :class:`collections.abc.KeysView`.
uk: Загальна версія :class:`collections.abc.KeysView`.

source: A generic version of :class:`collections.abc.Mapping`. This type can be used as follows::
uk: Загальна версія :class:`collections.abc.Mapping`. Цей тип можна використовувати наступним чином:

source: A generic version of :class:`collections.abc.MappingView`.
uk: Загальна версія :class:`collections.abc.MappingView`.

source: A generic version of :class:`collections.abc.MutableMapping`.
uk: Загальна версія :class:`collections.abc.MutableMapping`.

source: A generic version of :class:`collections.abc.MutableSequence`.
uk: Загальна версія :class:`collections.abc.MutableSequence`.

source: A generic version of :class:`collections.abc.MutableSet`.
uk: Загальна версія :class:`collections.abc.MutableSet`.

source: A generic version of :class:`collections.abc.Sequence`.
uk: Загальна версія :class:`collections.abc.Sequence`.

source: A generic version of :class:`collections.abc.ValuesView`.
uk: Загальна версія :class:`collections.abc.ValuesView`.

source: Corresponding to other types in :mod:`collections.abc`
uk: Відповідає іншим типам у :mod:`collections.abc`

source: A generic version of :class:`collections.abc.Iterable`.
uk: Загальна версія :class:`collections.abc.Iterable`.

source: A generic version of :class:`collections.abc.Iterator`.
uk: Загальна версія :class:`collections.abc.Iterator`.

source: A generator can be annotated by the generic type ``Generator[YieldType, SendType, ReturnType]``. For example::
uk: Генератор може бути анотований загальним типом ``Generator[YieldType, SendType, ReturnType]``. Наприклад::

source: Note that unlike many other generics in the typing module, the ``SendType`` of :class:`Generator` behaves contravariantly, not covariantly or invariantly.
uk: Зауважте, що на відміну від багатьох інших загальних засобів у модулі введення, ``SendType`` :class:`Generator` поводиться контраваріантно, а не коваріантно чи інваріантно.

source: If your generator will only yield values, set the ``SendType`` and ``ReturnType`` to ``None``::
uk: Якщо ваш генератор видаватиме лише значення, встановіть для ``SendType`` і ``ReturnType`` значення ``None``::

source: Alternatively, annotate your generator as having a return type of either ``Iterable[YieldType]`` or ``Iterator[YieldType]``::
uk: Крім того, позначте свій генератор як такий, що має тип повернення ``Iterable[YieldType]`` або ``Iterator[YieldType]``::

source: An alias to :class:`collections.abc.Hashable`.
uk: Псевдонім :class:`collections.abc.Hashable`.

source: A generic version of :class:`collections.abc.Reversible`.
uk: Загальна версія :class:`collections.abc.Reversible`.

source: An alias to :class:`collections.abc.Sized`.
uk: Псевдонім :class:`collections.abc.Sized`.

source: Asynchronous programming
uk: Асинхронне програмування
