Repository: seanpm2001/python-docs-uk
Catalog: library/xmlrpc.client.po
Languages: uk

source: Create an object used to boxcar method calls. *server* is the eventual target of the call. Calls can be made to the result object, but they will immediately return ``None``, and only store the call name and parameters in the :class:`MultiCall` object. Calling the object itself causes all stored calls to be transmitted as a single ``system.multicall`` request. The result of this call is a :term:`generator`; iterating over this generator yields the individual results.
uk: Створіть об’єкт, який використовується для викликів методу boxcar. *сервер* є кінцевою метою виклику. Виклики можна здійснювати до об’єкта результату, але вони негайно повертатимуть ``None`` і зберігають лише назву виклику та параметри в об’єкті :class:`MultiCall`. Виклик самого об’єкта призводить до того, що всі збережені виклики передаються як єдиний запит ``system.multicall``. Результатом цього виклику є :term:`generator`; ітерація по цьому генератору дає окремі результати.

source: A usage example of this class follows. The server code::
uk: Нижче наведено приклад використання цього класу. Код сервера::

source: Convenience Functions
uk: Функції зручності

source: Convert *params* into an XML-RPC request. or into a response if *methodresponse* is true. *params* can be either a tuple of arguments or an instance of the :exc:`Fault` exception class. If *methodresponse* is true, only a single value can be returned, meaning that *params* must be of length 1. *encoding*, if supplied, is the encoding to use in the generated XML; the default is UTF-8. Python's :const:`None` value cannot be used in standard XML-RPC; to allow using it via an extension, provide a true value for *allow_none*.
uk: Перетворіть *params* на запит XML-RPC. або у відповідь, якщо *methodresponse* має значення true. *params* може бути або кортежем аргументів, або екземпляром класу винятків :exc:`Fault`. Якщо *methodresponse* має значення true, можна повернути лише одне значення, тобто *params* має мати довжину 1. *encoding*, якщо вказано, це кодування, яке буде використовуватися у створеному XML; типовим є UTF-8. Значення Python :const:`None` не можна використовувати в стандартному XML-RPC; щоб дозволити використовувати його через розширення, надайте справжнє значення *allow_none*.

source: Convert an XML-RPC request or response into Python objects, a ``(params, methodname)``. *params* is a tuple of argument; *methodname* is a string, or ``None`` if no method name is present in the packet. If the XML-RPC packet represents a fault condition, this function will raise a :exc:`Fault` exception. The *use_builtin_types* flag can be used to cause date/time values to be presented as :class:`datetime.datetime` objects and binary data to be presented as :class:`bytes` objects; this flag is false by default.
uk: Перетворення запиту чи відповіді XML-RPC на об’єкти Python, ``(params, methodname)``. *params* — це кортеж аргументів; *methodname* — це рядок або ``None``, якщо в пакеті немає імені методу. Якщо пакет XML-RPC представляє стан помилки, ця функція викличе виняток :exc:`Fault`. Прапор *use_builtin_types* можна використовувати, щоб значення дати/часу відображалися як об’єкти :class:`datetime.datetime`, а двійкові дані — як об’єкти :class:`bytes`; цей прапор за замовчуванням false.

source: The obsolete *use_datetime* flag is similar to *use_builtin_types* but it applies only to date/time values.
uk: Застарілий прапор *use_datetime* подібний до *use_builtin_types*, але він застосовується лише до значень дати/часу.

source: Example of Client Usage
uk: Приклад використання клієнта

source: To access an XML-RPC server through a HTTP proxy, you need to define a custom transport. The following example shows how::
uk: Щоб отримати доступ до сервера XML-RPC через проксі-сервер HTTP, вам потрібно визначити настроюваний транспорт. У наступному прикладі показано, як:

source: Example of Client and Server Usage
uk: Приклад використання клієнта та сервера

source: See :ref:`simplexmlrpcserver-example`.
uk: Див. :ref:`simplexmlrpcserver-example`.

source: Footnotes
uk: Виноски

source: This approach has been first presented in `a discussion on xmlrpc.com <https://web.archive.org/web/20060624230303/http://www.xmlrpc.com/discuss/msgReader$1208?mode=topic>`_.
uk: Цей підхід вперше було представлено в `обговоренні на xmlrpc.com <https://web.archive.org/web/20060624230303/http://www.xmlrpc.com/discuss/msgReader$1208?mode=topic>`_.
