Repository: seanpm2001/python-docs-uk
Catalog: library/xmlrpc.client.po
Languages: uk

source: :mod:`xmlrpc.client` --- XML-RPC client access
uk: :mod:`xmlrpc.client` --- клієнтський доступ XML-RPC

source: **Source code:** :source:`Lib/xmlrpc/client.py`
uk: **Вихідний код:** :source:`Lib/xmlrpc/client.py`

source: XML-RPC is a Remote Procedure Call method that uses XML passed via HTTP(S) as a transport. With it, a client can call methods with parameters on a remote server (the server is named by a URI) and get back structured data. This module supports writing XML-RPC client code; it handles all the details of translating between conformable Python objects and XML on the wire.
uk: XML-RPC — це метод віддаленого виклику процедури, який використовує XML, що передається через HTTP(S) як транспорт. З його допомогою клієнт може викликати методи з параметрами на віддаленому сервері (сервер має назву URI) і отримати назад структуровані дані. Цей модуль підтримує написання клієнтського коду XML-RPC; він обробляє всі деталі перекладу між відповідними об’єктами Python і XML на дроті.

source: The :mod:`xmlrpc.client` module is not secure against maliciously constructed data. If you need to parse untrusted or unauthenticated data see :ref:`xml-vulnerabilities`.
uk: Модуль :mod:`xmlrpc.client` не захищений від зловмисно створених даних. Якщо вам потрібно проаналізувати ненадійні або неавтентифіковані дані, перегляньте :ref:`xml-vulnerabilities`.

source: For HTTPS URIs, :mod:`xmlrpc.client` now performs all the necessary certificate and hostname checks by default.
uk: Для HTTPS URI :mod:`xmlrpc.client` тепер виконує всі необхідні перевірки сертифікатів і імен хостів за умовчанням.

source: A :class:`ServerProxy` instance is an object that manages communication with a remote XML-RPC server. The required first argument is a URI (Uniform Resource Indicator), and will normally be the URL of the server. The optional second argument is a transport factory instance; by default it is an internal :class:`SafeTransport` instance for https: URLs and an internal HTTP :class:`Transport` instance otherwise. The optional third argument is an encoding, by default UTF-8. The optional fourth argument is a debugging flag.
uk: Екземпляр :class:`ServerProxy` — це об’єкт, який керує зв’язком із віддаленим сервером XML-RPC. Обов’язковим першим аргументом є URI (уніфікований індикатор ресурсу), і зазвичай це URL-адреса сервера. Необов'язковий другий аргумент - екземпляр транспортної фабрики; за замовчуванням це внутрішній екземпляр :class:`SafeTransport` для https: URL-адрес і внутрішній екземпляр HTTP :class:`Transport` в інших випадках. Необов’язковий третій аргумент – це кодування, за умовчанням UTF-8. Необов'язковий четвертий аргумент - це позначка налагодження.

source: The following parameters govern the use of the returned proxy instance. If *allow_none* is true, the Python constant ``None`` will be translated into XML; the default behaviour is for ``None`` to raise a :exc:`TypeError`. This is a commonly-used extension to the XML-RPC specification, but isn't supported by all clients and servers; see `http://ontosys.com/xml-rpc/extensions.php <https://web.archive.org/web/20130120074804/http://ontosys.com/xml-rpc/extensions.php>`_ for a description. The *use_builtin_types* flag can be used to cause date/time values to be presented as :class:`datetime.datetime` objects and binary data to be presented as :class:`bytes` objects; this flag is false by default. :class:`datetime.datetime`, :class:`bytes` and :class:`bytearray` objects may be passed to calls. The *headers* parameter is an optional sequence of HTTP headers to send with each request, expressed as a sequence of 2-tuples representing the header name and value. (e.g. `[('Header-Name', 'value')]`). The obsolete *use_datetime* flag is similar to *use_builtin_types* but it applies only to date/time values.
uk: Наступні параметри регулюють використання повернутого екземпляра проксі. Якщо *allow_none* має значення true, константа Python ``None`` буде перекладено в XML; типовою поведінкою є ``None``, щоб викликати :exc:`TypeError`. Це поширене розширення специфікації XML-RPC, але воно підтримується не всіма клієнтами та серверами; див. `http://ontosys.com/xml-rpc/extensions.php <https://web.archive.org/web/20130120074804/http://ontosys.com/xml-rpc/extensions.php>`_ для опису. Прапор *use_builtin_types* можна використовувати, щоб значення дати/часу відображалися як об’єкти :class:`datetime.datetime`, а двійкові дані — як об’єкти :class:`bytes`; цей прапор за замовчуванням false. Об’єкти :class:`datetime.datetime`, :class:`bytes` і :class:`bytearray` можуть бути передані викликам. Параметр *headers* — це необов’язкова послідовність HTTP-заголовків, яка надсилається з кожним запитом, виражена як послідовність 2-кортежів, що представляють назву та значення заголовка. (наприклад, `[('Назва заголовка', 'значення')]`). Застарілий прапор *use_datetime* подібний до *use_builtin_types*, але він застосовується лише до значень дати/часу.

source: The *use_builtin_types* flag was added.
uk: Додано прапорець *use_builtin_types*.

source: The *headers* parameter was added.
uk: Додано параметр *headers*.

source: Both the HTTP and HTTPS transports support the URL syntax extension for HTTP Basic Authentication: ``http://user:pass@host:port/path``. The ``user:pass`` portion will be base64-encoded as an HTTP 'Authorization' header, and sent to the remote server as part of the connection process when invoking an XML-RPC method. You only need to use this if the remote server requires a Basic Authentication user and password. If an HTTPS URL is provided, *context* may be :class:`ssl.SSLContext` and configures the SSL settings of the underlying HTTPS connection.
uk: Обидва транспорти HTTP і HTTPS підтримують розширення синтаксису URL для базової автентифікації HTTP: ``http://user:pass@host:port/path``. Частина ``user:pass`` буде закодована в base64 як HTTP-заголовок "Authorization" і надіслана на віддалений сервер як частина процесу підключення під час виклику методу XML-RPC. Використовувати це потрібно, лише якщо віддалений сервер потребує користувача та пароль базової автентифікації. Якщо надано URL-адресу HTTPS, *context* може бути :class:`ssl.SSLContext` і налаштовує параметри SSL основного з’єднання HTTPS.

source: The returned instance is a proxy object with methods that can be used to invoke corresponding RPC calls on the remote server. If the remote server supports the introspection API, the proxy can also be used to query the remote server for the methods it supports (service discovery) and fetch other server-associated metadata.
uk: Повернений екземпляр — це проксі-об’єкт із методами, які можна використовувати для виклику відповідних викликів RPC на віддаленому сервері. Якщо віддалений сервер підтримує API інтроспекції, проксі також можна використовувати для запиту віддаленого сервера щодо методів, які він підтримує (виявлення служби), і отримання інших пов’язаних із сервером метаданих.

source: Types that are conformable (e.g. that can be marshalled through XML), include the following (and except where noted, they are unmarshalled as the same Python type):
uk: Типи, які є сумісними (наприклад, які можна маршалізувати через XML), включають наступне (і, якщо не зазначено, вони не маршалізуються як той самий тип Python):

source: XML-RPC type
uk: Тип XML-RPC

source: Python type
uk: Тип Python

source: ``boolean``
uk: ``логічний``

source: ``int``, ``i1``, ``i2``, ``i4``, ``i8`` or ``biginteger``
uk: ``int``, ``i1``, ``i2``, ``i4``, ``i8`` або ``biginteger``

source: :class:`int` in range from -2147483648 to 2147483647. Values get the ``<int>`` tag.
uk: :class:`int` в діапазоні від -2147483648 до 2147483647. Значення отримують тег ``<int>``.

source: ``double`` or ``float``
uk: ``double`` або ``float``

source: :class:`float`. Values get the ``<double>`` tag.
uk: :class:`float`. Значення отримують тег ``<double>``.

source: ``string``
uk: ``рядок``

source: :class:`list` or :class:`tuple` containing conformable elements. Arrays are returned as :class:`lists <list>`.
uk: :class:`list` або :class:`tuple`, що містять відповідні елементи. Масиви повертаються як :class:`lists <list>`.

source: ``struct``
uk: ``структура``

source: :class:`dict`. Keys must be strings, values may be any conformable type. Objects of user-defined classes can be passed in; only their :attr:`~object.__dict__` attribute is transmitted.
uk: :class:`dict`. Ключі мають бути рядками, значення можуть мати будь-який відповідний тип. Можна передати об’єкти визначених користувачем класів; передається лише їхній атрибут :attr:`~object.__dict__`.

source: :class:`DateTime` or :class:`datetime.datetime`. Returned type depends on values of *use_builtin_types* and *use_datetime* flags.
uk: :class:`DateTime` або :class:`datetime.datetime`. Повернений тип залежить від значень прапорців *use_builtin_types* і *use_datetime*.

source: :class:`Binary`, :class:`bytes` or :class:`bytearray`. Returned type depends on the value of the *use_builtin_types* flag.
uk: :class:`Binary`, :class:`bytes` або :class:`bytearray`. Повернений тип залежить від значення прапорця *use_builtin_types*.

source: ``nil``
uk: ``нуль``

source: The ``None`` constant. Passing is allowed only if *allow_none* is true.
uk: Константа ``None``. Передача дозволена, лише якщо *allow_none* має значення true.

source: ``bigdecimal``
uk: ``великий десятковий``

source: :class:`decimal.Decimal`. Returned type only.
uk: :class:`decimal.Decimal`. Тільки повернутий тип.

source: This is the full set of data types supported by XML-RPC. Method calls may also raise a special :exc:`Fault` instance, used to signal XML-RPC server errors, or :exc:`ProtocolError` used to signal an error in the HTTP/HTTPS transport layer. Both :exc:`Fault` and :exc:`ProtocolError` derive from a base class called :exc:`Error`. Note that the xmlrpc client module currently does not marshal instances of subclasses of built-in types.
uk: Це повний набір типів даних, які підтримує XML-RPC. Виклики методів також можуть викликати спеціальний екземпляр :exc:`Fault`, який використовується для сигналізації про помилки сервера XML-RPC, або :exc:`ProtocolError`, який використовується для сигналізації про помилку на транспортному рівні HTTP/HTTPS. І :exc:`Fault`, і :exc:`ProtocolError` походять від базового класу під назвою :exc:`Error`. Зауважте, що клієнтський модуль xmlrpc наразі не маршалює екземпляри підкласів вбудованих типів.

source: When passing strings, characters special to XML such as ``<``, ``>``, and ``&`` will be automatically escaped. However, it's the caller's responsibility to ensure that the string is free of characters that aren't allowed in XML, such as the control characters with ASCII values between 0 and 31 (except, of course, tab, newline and carriage return); failing to do this will result in an XML-RPC request that isn't well-formed XML. If you have to pass arbitrary bytes via XML-RPC, use :class:`bytes` or :class:`bytearray` classes or the :class:`Binary` wrapper class described below.
uk: Під час передачі рядків спеціальні символи XML, такі як ``<``, ``>`` і ``&``, будуть автоматично екрановані. Однак відповідальністю абонента є переконатися, що рядок вільний від символів, які не дозволені в XML, таких як контрольні символи зі значеннями ASCII від 0 до 31 (за винятком, звичайно, табуляції, нового рядка та повернення каретки); якщо цього не зробити, запит XML-RPC не є правильно сформованим XML. Якщо вам потрібно передати довільні байти через XML-RPC, використовуйте класи :class:`bytes` або :class:`bytearray` або клас-оболонку :class:`Binary`, описаний нижче.

source: :class:`Server` is retained as an alias for :class:`ServerProxy` for backwards compatibility. New code should use :class:`ServerProxy`.
uk: :class:`Server` зберігається як псевдонім для :class:`ServerProxy` для зворотної сумісності. Новий код має використовувати :class:`ServerProxy`.

source: Added the *context* argument.
uk: Додано аргумент *контекст*.

source: Added support of type tags with prefixes (e.g. ``ex:nil``). Added support of unmarshalling additional types used by Apache XML-RPC implementation for numerics: ``i1``, ``i2``, ``i8``, ``biginteger``, ``float`` and ``bigdecimal``. See http://ws.apache.org/xmlrpc/types.html for a description.
uk: Додано підтримку тегів типу з префіксами (наприклад, ``ex:nil``). Додано підтримку демаршалінгу додаткових типів, які використовуються реалізацією Apache XML-RPC для чисел: ``i1``, ``i2``, ``i8``, ``biginteger``, ``float`` і ``bigdecimal``. Див. http://ws.apache.org/xmlrpc/types.html для опису.

source: A good description of XML-RPC operation and client software in several languages. Contains pretty much everything an XML-RPC client developer needs to know.
uk: Гарний опис роботи XML-RPC і клієнтського програмного забезпечення кількома мовами. Містить практично все, що потрібно знати розробнику клієнта XML-RPC.

source: `XML-RPC Introspection <http://xmlrpc-c.sourceforge.net/introspection.html>`_
uk: `Інтроспекція XML-RPC <http://xmlrpc-c.sourceforge.net/introspection.html>`_

source: Describes the XML-RPC protocol extension for introspection.
uk: Описує розширення протоколу XML-RPC для самоаналізу.

source: `XML-RPC Specification <http://xmlrpc.scripting.com/spec.html>`_
uk: `Специфікація XML-RPC <http://xmlrpc.scripting.com/spec.html>`_

source: The official specification.
uk: Офіційна специфікація.

source: ServerProxy Objects
uk: Об’єкти ServerProxy

source: A :class:`ServerProxy` instance has a method corresponding to each remote procedure call accepted by the XML-RPC server. Calling the method performs an RPC, dispatched by both name and argument signature (e.g. the same method name can be overloaded with multiple argument signatures). The RPC finishes by returning a value, which may be either returned data in a conformant type or a :class:`Fault` or :class:`ProtocolError` object indicating an error.
uk: Екземпляр :class:`ServerProxy` має метод, що відповідає кожному виклику віддаленої процедури, прийнятому сервером XML-RPC. Виклик методу виконує RPC, відправляється як за назвою, так і за підписом аргументу (наприклад, те саме ім’я методу може бути перевантажено декількома підписами аргументів). RPC завершується поверненням значення, яке може бути або повернутими даними відповідного типу, або об’єктом :class:`Fault` чи :class:`ProtocolError`, що вказує на помилку.

source: Servers that support the XML introspection API support some common methods grouped under the reserved :attr:`~ServerProxy.system` attribute:
uk: Сервери, які підтримують API інтроспекції XML, підтримують деякі загальні методи, згруповані в зарезервованому атрибуті :attr:`~ServerProxy.system`:

source: This method returns a list of strings, one for each (non-system) method supported by the XML-RPC server.
uk: Цей метод повертає список рядків, по одному для кожного (несистемного) методу, який підтримує сервер XML-RPC.

source: This method takes one parameter, the name of a method implemented by the XML-RPC server. It returns an array of possible signatures for this method. A signature is an array of types. The first of these types is the return type of the method, the rest are parameters.
uk: Цей метод приймає один параметр, назву методу, реалізованого сервером XML-RPC. Він повертає масив можливих підписів для цього методу. Підпис — це масив типів. Перший із цих типів є типом повернення методу, решта є параметрами.

source: Because multiple signatures (ie. overloading) is permitted, this method returns a list of signatures rather than a singleton.
uk: Оскільки дозволено кілька підписів (тобто перевантаження), цей метод повертає список підписів, а не одиночний.

source: Signatures themselves are restricted to the top level parameters expected by a method. For instance if a method expects one array of structs as a parameter, and it returns a string, its signature is simply "string, array". If it expects three integers and returns a string, its signature is "string, int, int, int".
uk: Самі підписи обмежені параметрами верхнього рівня, очікуваними методом. Наприклад, якщо метод очікує один масив структур як параметр і повертає рядок, його підпис буде просто "рядок, масив". Якщо він очікує три цілі числа та повертає рядок, його підписом є "рядок, int, int, int".

source: If no signature is defined for the method, a non-array value is returned. In Python this means that the type of the returned value will be something other than list.
uk: Якщо для методу не визначено підпису, повертається немасивне значення. У Python це означає, що типом поверненого значення буде щось інше, ніж список.

source: This method takes one parameter, the name of a method implemented by the XML-RPC server. It returns a documentation string describing the use of that method. If no such string is available, an empty string is returned. The documentation string may contain HTML markup.
uk: Цей метод приймає один параметр, назву методу, реалізованого сервером XML-RPC. Він повертає рядок документації, що описує використання цього методу. Якщо такий рядок недоступний, повертається порожній рядок. Рядок документації може містити розмітку HTML.

source: Instances of :class:`ServerProxy` support the :term:`context manager` protocol for closing the underlying transport.
uk: Екземпляри :class:`ServerProxy` підтримують протокол :term:`context manager` для закриття основного транспорту.

source: A working example follows. The server code::
uk: Нижче наведено робочий приклад. Код сервера::

source: The client code for the preceding server::
uk: Код клієнта для попереднього сервера::

source: DateTime Objects
uk: Об’єкти DateTime

source: This class may be initialized with seconds since the epoch, a time tuple, an ISO 8601 time/date string, or a :class:`datetime.datetime` instance. It has the following methods, supported mainly for internal use by the marshalling/unmarshalling code:
uk: Цей клас може бути ініціалізований секундами з епохи, кортежем часу, рядком часу/дати ISO 8601 або екземпляром :class:`datetime.datetime`. Він має такі методи, які підтримуються головним чином для внутрішнього використання кодом маршалінгу/демаршалінгу:

source: Accept a string as the instance's new time value.
uk: Прийняти рядок як нове значення часу екземпляра.

source: Write the XML-RPC encoding of this :class:`DateTime` item to the *out* stream object.
uk: Запишіть кодування XML-RPC цього елемента :class:`DateTime` в об’єкт потоку *out*.

source: It also supports certain of Python's built-in operators through rich comparison and :meth:`__repr__` methods.
uk: Він також підтримує певні вбудовані оператори Python через розширене порівняння та методи :meth:`__repr__`.

source: Binary Objects
uk: Двійкові об'єкти

source: This class may be initialized from bytes data (which may include NULs). The primary access to the content of a :class:`Binary` object is provided by an attribute:
uk: Цей клас може бути ініціалізований з даних байтів (які можуть включати NUL). Основний доступ до вмісту об’єкта :class:`Binary` забезпечується атрибутом:

source: The binary data encapsulated by the :class:`Binary` instance. The data is provided as a :class:`bytes` object.
uk: Двійкові дані, інкапсульовані екземпляром :class:`Binary`. Дані надаються як об’єкт :class:`bytes`.

source: :class:`Binary` objects have the following methods, supported mainly for internal use by the marshalling/unmarshalling code:
uk: :class:`Binary` об’єкти мають такі методи, які підтримуються переважно для внутрішнього використання кодом маршалінгу/демаршалінгу:

source: Accept a base64 :class:`bytes` object and decode it as the instance's new data.
uk: Прийміть об’єкт base64 :class:`bytes` і декодуйте його як нові дані екземпляра.

source: Write the XML-RPC base 64 encoding of this binary item to the *out* stream object.
uk: Запишіть кодування XML-RPC base 64 цього бінарного елемента в об’єкт потоку *out*.

source: The encoded data will have newlines every 76 characters as per :rfc:`RFC 2045 section 6.8 <2045#section-6.8>`, which was the de facto standard base64 specification when the XML-RPC spec was written.
uk: Закодовані дані матимуть символи нового рядка через кожні 76 символів відповідно до :rfc:`RFC 2045, розділ 6.8 <2045#section-6.8>`, який був де-факто стандартною специфікацією base64 на момент написання специфікації XML-RPC.

source: It also supports certain of Python's built-in operators through :meth:`__eq__` and :meth:`__ne__` methods.
uk: Він також підтримує певні вбудовані оператори Python через методи :meth:`__eq__` і :meth:`__ne__`.

source: Example usage of the binary objects. We're going to transfer an image over XMLRPC::
uk: Приклад використання бінарних об'єктів. Ми збираємося передати зображення через XMLRPC::

source: The client gets the image and saves it to a file::
uk: Клієнт отримує зображення та зберігає його у файл::

source: Fault Objects
uk: Об'єкти несправності

source: A :class:`Fault` object encapsulates the content of an XML-RPC fault tag. Fault objects have the following attributes:
uk: Об’єкт :class:`Fault` інкапсулює вміст тегу помилки XML-RPC. Об'єкти несправностей мають такі атрибути:

source: An int indicating the fault type.
uk: Int, що вказує на тип помилки.

source: A string containing a diagnostic message associated with the fault.
uk: Рядок, що містить діагностичне повідомлення, пов’язане з несправністю.

source: In the following example we're going to intentionally cause a :exc:`Fault` by returning a complex type object. The server code::
uk: У наступному прикладі ми навмисно спричинимо :exc:`Fault`, повернувши об’єкт складного типу. Код сервера::

source: ProtocolError Objects
uk: Об’єкти ProtocolError

source: A :class:`ProtocolError` object describes a protocol error in the underlying transport layer (such as a 404 'not found' error if the server named by the URI does not exist). It has the following attributes:
uk: Об’єкт :class:`ProtocolError` описує помилку протоколу на базовому транспортному рівні (наприклад, помилку 404 "не знайдено", якщо сервер, названий URI, не існує). Він має такі атрибути:

source: The URI or URL that triggered the error.
uk: URI або URL-адреса, яка викликала помилку.

source: The error code.
uk: Код помилки.

source: The error message or diagnostic string.
uk: Повідомлення про помилку або діагностичний рядок.

source: A dict containing the headers of the HTTP/HTTPS request that triggered the error.
uk: Dict, що містить заголовки запиту HTTP/HTTPS, який викликав помилку.

source: In the following example we're going to intentionally cause a :exc:`ProtocolError` by providing an invalid URI::
uk: У наступному прикладі ми навмисно спричинимо :exc:`ProtocolError`, вказавши недійсний URI::

source: MultiCall Objects
uk: Об’єкти MultiCall

source: The :class:`MultiCall` object provides a way to encapsulate multiple calls to a remote server into a single request [#]_.
uk: Об’єкт :class:`MultiCall` забезпечує спосіб інкапсулювати кілька викликів до віддаленого сервера в один запит [#]_.
