Repository: seanpm2001/python-docs-uk
Catalog: library/zoneinfo.po
Languages: uk

source: A read-only sequence representing the time zone search path -- when constructing a ``ZoneInfo`` from a key, the key is joined to each entry in the ``TZPATH``, and the first file found is used.
uk: Послідовність лише для читання, що представляє шлях пошуку часового поясу – під час створення ``ZoneInfo`` з ключа, ключ приєднується до кожного запису в ``TZPATH``, і використовується перший знайдений файл.

source: ``TZPATH`` may contain only absolute paths, never relative paths, regardless of how it is configured.
uk: ``TZPATH`` може містити лише абсолютні шляхи, а не відносні, незалежно від того, як його налаштовано.

source: The object that ``zoneinfo.TZPATH`` points to may change in response to a call to :func:`reset_tzpath`, so it is recommended to use ``zoneinfo.TZPATH`` rather than importing ``TZPATH`` from ``zoneinfo`` or assigning a long-lived variable to ``zoneinfo.TZPATH``.
uk: Об’єкт, на який вказує ``zoneinfo.TZPATH``, може змінитися у відповідь на виклик :func:`reset_tzpath`, тому рекомендується використовувати ``zoneinfo.TZPATH``, а не імпортувати ``TZPATH`` з ``zoneinfo`` або присвоєння тривалої змінної ``zoneinfo.TZPATH``.

source: For more information on configuring the time zone search path, see :ref:`zoneinfo_data_configuration`.
uk: Додаткову інформацію про налаштування шляху пошуку часового поясу див. у :ref:`zoneinfo_data_configuration`.

source: Exceptions and warnings
uk: Винятки та попередження

source: Raised when construction of a :class:`ZoneInfo` object fails because the specified key could not be found on the system. This is a subclass of :exc:`KeyError`.
uk: Викликається, коли створення об’єкта :class:`ZoneInfo` не вдається, оскільки вказаний ключ не знайдено в системі. Це підклас :exc:`KeyError`.

source: Raised when :envvar:`PYTHONTZPATH` contains an invalid component that will be filtered out, such as a relative path.
uk: Викликається, коли :envvar:`PYTHONTZPATH` містить недійсний компонент, який буде відфільтровано, наприклад відносний шлях.
