Repository: seanpm2001/python-docs-uk
Catalog: library/zoneinfo.po
Languages: uk

source: :mod:`zoneinfo` --- IANA time zone support
uk: :mod:`zoneinfo` --- підтримка часового поясу IANA

source: The :mod:`zoneinfo` module provides a concrete time zone implementation to support the IANA time zone database as originally specified in :pep:`615`. By default, :mod:`zoneinfo` uses the system's time zone data if available; if no system time zone data is available, the library will fall back to using the first-party `tzdata`_ package available on PyPI.
uk: Модуль :mod:`zoneinfo` забезпечує конкретну реалізацію часового поясу для підтримки бази даних часових поясів IANA, як спочатку зазначено в :pep:`615`. За замовчуванням :mod:`zoneinfo` використовує дані часового поясу системи, якщо вони доступні; якщо дані системного часового поясу недоступні, бібліотека повернеться до використання основного пакету `tzdata`_, доступного на PyPI.

source: Module: :mod:`datetime`
uk: Модуль: :mod:`datetime`

source: Provides the :class:`~datetime.time` and :class:`~datetime.datetime` types with which the :class:`ZoneInfo` class is designed to be used.
uk: Надає типи :class:`~datetime.time` і :class:`~datetime.datetime`, з якими призначений клас :class:`ZoneInfo`.

source: Package `tzdata`_
uk: Пакет `tzdata`_

source: First-party package maintained by the CPython core developers to supply time zone data via PyPI.
uk: Пакет першої сторони, який підтримується розробниками ядра CPython для надання даних про часовий пояс через PyPI.

source: Using ``ZoneInfo``
uk: Використання ``ZoneInfo``

source: :class:`ZoneInfo` is a concrete implementation of the :class:`datetime.tzinfo` abstract base class, and is intended to be attached to ``tzinfo``, either via the constructor, the :meth:`datetime.replace <datetime.datetime.replace>` method or :meth:`datetime.astimezone <datetime.datetime.astimezone>`::
uk: :class:`ZoneInfo` є конкретною реалізацією :class:`datetime.tzinfo` абстрактного базового класу, який призначений для приєднання до ``tzinfo`` або через конструктор, :meth:`datetime.replace <datetime.datetime.replace>` метод або :meth:`datetime.astimezone <datetime.datetime.astimezone>`::

source: Datetimes constructed in this way are compatible with datetime arithmetic and handle daylight saving time transitions with no further intervention::
uk: Дати, побудовані таким чином, сумісні з арифметикою дат і часу та обробляють переходи на літній час без подальшого втручання:

source: These time zones also support the :attr:`~datetime.datetime.fold` attribute introduced in :pep:`495`. During offset transitions which induce ambiguous times (such as a daylight saving time to standard time transition), the offset from *before* the transition is used when ``fold=0``, and the offset *after* the transition is used when ``fold=1``, for example::
uk: Ці часові пояси також підтримують атрибут :attr:`~datetime.datetime.fold`, представлений у :pep:`495`. Під час переходів із зміщенням, які спричиняють неоднозначний час (наприклад, перехід із літнього часу на стандартний), зсув від *до* переходу використовується, коли ``fold=0``, а зсув *після* переходу використовується, коли ``fold=1``, наприклад::

source: When converting from another time zone, the fold will be set to the correct value::
uk: Під час конвертації з іншого часового поясу для згортки буде встановлено правильне значення:

source: Data sources
uk: Джерела даних

source: The ``zoneinfo`` module does not directly provide time zone data, and instead pulls time zone information from the system time zone database or the first-party PyPI package `tzdata`_, if available. Some systems, including notably Windows systems, do not have an IANA database available, and so for projects targeting cross-platform compatibility that require time zone data, it is recommended to declare a dependency on tzdata. If neither system data nor tzdata are available, all calls to :class:`ZoneInfo` will raise :exc:`ZoneInfoNotFoundError`.
uk: Модуль ``zoneinfo`` безпосередньо не надає даних про часовий пояс, а натомість отримує інформацію про часовий пояс із системної бази даних часових поясів або основного пакету PyPI `tzdata`_, якщо доступний. Деякі системи, зокрема системи Windows, не мають доступної бази даних IANA, тому для проектів, націлених на кросплатформенну сумісність, які вимагають даних часового поясу, рекомендується оголосити залежність від tzdata. Якщо ані системні дані, ані tzdata недоступні, усі виклики :class:`ZoneInfo` викличуть :exc:`ZoneInfoNotFoundError`.

source: Configuring the data sources
uk: Налаштування джерел даних

source: When ``ZoneInfo(key)`` is called, the constructor first searches the directories specified in :data:`TZPATH` for a file matching ``key``, and on failure looks for a match in the tzdata package. This behavior can be configured in three ways:
uk: Коли викликається ``ZoneInfo(key)``, конструктор спочатку шукає файл, який відповідає ``key``, у каталогах, указаних у :data:`TZPATH`, а в разі помилки шукає відповідність у пакеті tzdata. Цю поведінку можна налаштувати трьома способами:

source: The default :data:`TZPATH` when not otherwise specified can be configured at :ref:`compile time <zoneinfo_data_compile_time_config>`.
uk: Типовий :data:`TZPATH`, якщо не вказано інше, можна налаштувати під час :ref:`компіляції <zoneinfo_data_compile_time_config>`.

source: :data:`TZPATH` can be configured using :ref:`an environment variable <zoneinfo_data_environment_var>`.
uk: :data:`TZPATH` можна налаштувати за допомогою :ref:`змінної середовища <zoneinfo_data_environment_var>`.

source: At :ref:`runtime <zoneinfo_data_runtime_config>`, the search path can be manipulated using the :func:`reset_tzpath` function.
uk: У :ref:`runtime <zoneinfo_data_runtime_config>` шляхом пошуку можна маніпулювати за допомогою функції :func:`reset_tzpath`.

source: Compile-time configuration
uk: Конфігурація під час компіляції

source: The default :data:`TZPATH` includes several common deployment locations for the time zone database (except on Windows, where there are no "well-known" locations for time zone data). On POSIX systems, downstream distributors and those building Python from source who know where their system time zone data is deployed may change the default time zone path by specifying the compile-time option ``TZPATH`` (or, more likely, the :option:`configure flag --with-tzpath <--with-tzpath>`), which should be a string delimited by :data:`os.pathsep`.
uk: За замовчуванням :data:`TZPATH` містить кілька поширених місць розгортання бази даних часових поясів (за винятком Windows, де немає "добре відомих" місць для даних часових поясів). У системах POSIX розповсюджувачі нижньої течії та ті, хто створює Python із джерела, які знають, де розгортаються дані часових поясів у їхній системі, можуть змінити шлях часового поясу за замовчуванням, вказавши параметр під час компіляції ``TZPATH`` (або, що ймовірніше, параметр :option:`configure flag --with-tzpath <--with-tzpath>`), який має бути рядком, розділеним :data:`os.pathsep`.

source: On all platforms, the configured value is available as the ``TZPATH`` key in :func:`sysconfig.get_config_var`.
uk: На всіх платформах налаштоване значення доступне як ключ ``TZPATH`` у :func:`sysconfig.get_config_var`.

source: Environment configuration
uk: Конфігурація середовища

source: When initializing :data:`TZPATH` (either at import time or whenever :func:`reset_tzpath` is called with no arguments), the ``zoneinfo`` module will use the environment variable ``PYTHONTZPATH``, if it exists, to set the search path.
uk: Під час ініціалізації :data:`TZPATH` (або під час імпортування, або коли :func:`reset_tzpath` викликається без аргументів), модуль ``zoneinfo`` використовуватиме змінну середовища ``PYTHONTZPATH``, якщо вона існує, щоб встановити шлях пошуку.

source: This is an :data:`os.pathsep`-separated string containing the time zone search path to use. It must consist of only absolute rather than relative paths. Relative components specified in ``PYTHONTZPATH`` will not be used, but otherwise the behavior when a relative path is specified is implementation-defined; CPython will raise :exc:`InvalidTZPathWarning`, but other implementations are free to silently ignore the erroneous component or raise an exception.
uk: Це розділений :data:`os.pathsep` рядок, який містить шлях пошуку часового поясу, який слід використовувати. Він має складатися лише з абсолютних, а не відносних шляхів. Відносні компоненти, указані в ``PYTHONTZPATH``, не використовуватимуться, але в інших випадках поведінка, коли вказано відносний шлях, визначається реалізацією; CPython викличе :exc:`InvalidTZPathWarning`, але інші реалізації можуть мовчки ігнорувати помилковий компонент або викликати виняток.

source: To set the system to ignore the system data and use the tzdata package instead, set ``PYTHONTZPATH=""``.
uk: Щоб налаштувати систему на ігнорування системних даних і використання замість них пакета tzdata, установіть ``PYTHONTZPATH=""``.

source: Runtime configuration
uk: Конфігурація середовища виконання

source: The TZ search path can also be configured at runtime using the :func:`reset_tzpath` function. This is generally not an advisable operation, though it is reasonable to use it in test functions that require the use of a specific time zone path (or require disabling access to the system time zones).
uk: Шлях пошуку TZ також можна налаштувати під час виконання за допомогою функції :func:`reset_tzpath`. Зазвичай це не рекомендована операція, хоча її доцільно використовувати в тестових функціях, які вимагають використання певного шляху часового поясу (або вимагають вимкнення доступу до часових поясів системи).

source: The ``ZoneInfo`` class
uk: Клас ``ZoneInfo``

source: A concrete :class:`datetime.tzinfo` subclass that represents an IANA time zone specified by the string ``key``. Calls to the primary constructor will always return objects that compare identically; put another way, barring cache invalidation via :meth:`ZoneInfo.clear_cache`, for all values of ``key``, the following assertion will always be true:
uk: Конкретний підклас :class:`datetime.tzinfo`, який представляє часовий пояс IANA, визначений рядком ``key``. Виклики первинного конструктора завжди повертатимуть об’єкти, які порівнюються однаково; Іншими словами, за винятком недійсності кешу через :meth:`ZoneInfo.clear_cache`, для всіх значень ``key`` наступне твердження завжди буде вірним:

source: ``key`` must be in the form of a relative, normalized POSIX path, with no up-level references. The constructor will raise :exc:`ValueError` if a non-conforming key is passed.
uk: ``key`` має бути у формі відносного нормалізованого шляху POSIX без посилань верхнього рівня. Конструктор викличе :exc:`ValueError`, якщо передано невідповідний ключ.

source: If no file matching ``key`` is found, the constructor will raise :exc:`ZoneInfoNotFoundError`.
uk: Якщо не знайдено жодного файлу, що відповідає ``ключу``, конструктор викличе :exc:`ZoneInfoNotFoundError`.

source: The ``ZoneInfo`` class has two alternate constructors:
uk: Клас ``ZoneInfo`` має два альтернативних конструктори:

source: Constructs a ``ZoneInfo`` object from a file-like object returning bytes (e.g. a file opened in binary mode or an :class:`io.BytesIO` object). Unlike the primary constructor, this always constructs a new object.
uk: Створює об’єкт ``ZoneInfo`` з файлоподібного об’єкта, який повертає байти (наприклад, файл, відкритий у двійковому режимі, або об’єкт :class:`io.BytesIO`). На відміну від первинного конструктора, це завжди створює новий об’єкт.

source: The ``key`` parameter sets the name of the zone for the purposes of :py:meth:`~object.__str__` and :py:meth:`~object.__repr__`.
uk: Параметр ``key`` встановлює назву зони для цілей :py:meth:`~object.__str__` і :py:meth:`~object.__repr__`.

source: Objects created via this constructor cannot be pickled (see `pickling`_).
uk: Об’єкти, створені за допомогою цього конструктора, не можуть бути протравлені (див. `pickling`_).

source: An alternate constructor that bypasses the constructor's cache. It is identical to the primary constructor, but returns a new object on each call. This is most likely to be useful for testing or demonstration purposes, but it can also be used to create a system with a different cache invalidation strategy.
uk: Альтернативний конструктор, який обходить кеш конструктора. Він ідентичний основному конструктору, але повертає новий об’єкт під час кожного виклику. Це, швидше за все, буде корисним для тестування чи демонстрації, але його також можна використовувати для створення системи з іншою стратегією анулювання кешу.

source: Objects created via this constructor will also bypass the cache of a deserializing process when unpickled.
uk: Об’єкти, створені за допомогою цього конструктора, також обійдуть кеш процесу десеріалізації, коли їх не буде вибрано.

source: Using this constructor may change the semantics of your datetimes in surprising ways, only use it if you know that you need to.
uk: Використання цього конструктора може дивовижним чином змінити семантику ваших дат і часів, використовуйте його, лише якщо ви знаєте, що вам це потрібно.

source: The following class methods are also available:
uk: Також доступні такі методи класу:

source: A method for invalidating the cache on the ``ZoneInfo`` class. If no arguments are passed, all caches are invalidated and the next call to the primary constructor for each key will return a new instance.
uk: Метод анулювання кешу в класі ``ZoneInfo``. Якщо аргументи не передано, усі кеші стають недійсними, а наступний виклик основного конструктора для кожного ключа поверне новий екземпляр.

source: If an iterable of key names is passed to the ``only_keys`` parameter, only the specified keys will be removed from the cache. Keys passed to ``only_keys`` but not found in the cache are ignored.
uk: Якщо в параметр ``only_keys`` передається ітерація імен ключів, з кешу буде видалено лише вказані ключі. Ключі, передані в ``only_keys``, але не знайдені в кеші, ігноруються.

source: Invoking this function may change the semantics of datetimes using ``ZoneInfo`` in surprising ways; this modifies process-wide global state and thus may have wide-ranging effects. Only use it if you know that you need to.
uk: Виклик цієї функції може дивовижним чином змінити семантику дати та часу за допомогою ``ZoneInfo``; це змінює глобальний стан усього процесу і, отже, може мати широкий вплив. Використовуйте його, лише якщо знаєте, що вам це потрібно.

source: The class has one attribute:
uk: Клас має один атрибут:

source: This is a read-only :term:`attribute` that returns the value of ``key`` passed to the constructor, which should be a lookup key in the IANA time zone database (e.g. ``America/New_York``, ``Europe/Paris`` or ``Asia/Tokyo``).
uk: Це лише для читання :term:`attribute`, який повертає значення ``key``, переданого конструктору, який має бути ключем пошуку в базі даних часового поясу IANA (наприклад, ``America/New_York``, ``Європа/Париж`` або ``Азія/Токіо``).

source: For zones constructed from file without specifying a ``key`` parameter, this will be set to ``None``.
uk: Для зон, створених із файлу без зазначення параметра ``key``, буде встановлено ``None``.

source: Although it is a somewhat common practice to expose these to end users, these values are designed to be primary keys for representing the relevant zones and not necessarily user-facing elements. Projects like CLDR (the Unicode Common Locale Data Repository) can be used to get more user-friendly strings from these keys.
uk: Хоча надавати їх кінцевим користувачам є досить поширеною практикою, ці значення призначені як первинні ключі для представлення відповідних зон, а не обов’язково для елементів, спрямованих на користувача. Такі проекти, як CLDR (загальне сховище даних Unicode Common Locale Data Repository), можна використовувати для отримання більш зручних рядків із цих ключів.

source: String representations
uk: Рядкові представлення

source: The string representation returned when calling :py:class:`str` on a :class:`ZoneInfo` object defaults to using the :attr:`ZoneInfo.key` attribute (see the note on usage in the attribute documentation)::
uk: Рядкове представлення, що повертається під час виклику :py:class:`str` для об’єкта :class:`ZoneInfo`, за замовчуванням використовує атрибут :attr:`ZoneInfo.key` (див. примітку щодо використання в документації атрибута):

source: For objects constructed from a file without specifying a ``key`` parameter, ``str`` falls back to calling :func:`repr`. ``ZoneInfo``'s ``repr`` is implementation-defined and not necessarily stable between versions, but it is guaranteed not to be a valid ``ZoneInfo`` key.
uk: Для об’єктів, створених із файлу без вказівки параметра ``key``, ``str`` повертається до виклику :func:`repr`. ``Repr`` ``ZoneInfo`` визначається реалізацією і не обов’язково є стабільним між версіями, але гарантовано, що він не є дійсним ключем ``ZoneInfo``.

source: Pickle serialization
uk: Серіалізація соління

source: Rather than serializing all transition data, ``ZoneInfo`` objects are serialized by key, and ``ZoneInfo`` objects constructed from files (even those with a value for ``key`` specified) cannot be pickled.
uk: Замість того, щоб серіалізувати всі дані переходу, об’єкти ``ZoneInfo`` серіалізуються за ключем, а об’єкти ``ZoneInfo``, створені з файлів (навіть ті, у яких указано значення ``key``), не можуть бути мариновані.

source: The behavior of a ``ZoneInfo`` file depends on how it was constructed:
uk: Поведінка файлу ``ZoneInfo`` залежить від того, як він був створений:

source: ``ZoneInfo(key)``: When constructed with the primary constructor, a ``ZoneInfo`` object is serialized by key, and when deserialized, the deserializing process uses the primary and thus it is expected that these are expected to be the same object as other references to the same time zone. For example, if ``europe_berlin_pkl`` is a string containing a pickle constructed from ``ZoneInfo("Europe/Berlin")``, one would expect the following behavior:
uk: ``ZoneInfo(key)``: коли створюється за допомогою первинного конструктора, об’єкт ``ZoneInfo`` серіалізується за ключем, а коли десеріалізується, процес десеріалізації використовує первинний, тому очікується, що вони будуть той самий об’єкт, що й інші посилання на той самий часовий пояс. Наприклад, якщо ``europe_berlin_pkl`` - це рядок, що містить маринований пікле, створений з ``ZoneInfo("Europe/Berlin")``, можна очікувати такої поведінки:

source: ``ZoneInfo.no_cache(key)``: When constructed from the cache-bypassing constructor, the ``ZoneInfo`` object is also serialized by key, but when deserialized, the deserializing process uses the cache bypassing constructor. If ``europe_berlin_pkl_nc`` is a string containing a pickle constructed from ``ZoneInfo.no_cache("Europe/Berlin")``, one would expect the following behavior:
uk: ``ZoneInfo.no_cache(key)``: коли створено з конструктора обходу кешу, об’єкт ``ZoneInfo`` також серіалізується за ключем, але при десеріалізації процес десеріалізації використовує конструктор обходу кешу. Якщо ``europe_berlin_pkl_nc`` - це рядок, що містить маринований пікле, побудований з ``ZoneInfo.no_cache("Europe/Berlin")``, можна очікувати такої поведінки:

source: ``ZoneInfo.from_file(fobj, /, key=None)``: When constructed from a file, the ``ZoneInfo`` object raises an exception on pickling. If an end user wants to pickle a ``ZoneInfo`` constructed from a file, it is recommended that they use a wrapper type or a custom serialization function: either serializing by key or storing the contents of the file object and serializing that.
uk: ``ZoneInfo.from_file(fobj, /, key=None)``: коли створено з файлу, об’єкт ``ZoneInfo`` викликає виключення під час травлення. Якщо кінцевий користувач хоче вибрати ``ZoneInfo``, створений з файлу, рекомендується використовувати тип оболонки або спеціальну функцію серіалізації: або серіалізація за ключем, або збереження вмісту об’єкта файлу та його серіалізація.

source: This method of serialization requires that the time zone data for the required key be available on both the serializing and deserializing side, similar to the way that references to classes and functions are expected to exist in both the serializing and deserializing environments. It also means that no guarantees are made about the consistency of results when unpickling a ``ZoneInfo`` pickled in an environment with a different version of the time zone data.
uk: Цей метод серіалізації вимагає, щоб дані часового поясу для необхідного ключа були доступні як на стороні серіалізації, так і на стороні десеріалізації, подібно до того, як очікуються посилання на класи та функції в середовищах серіалізації та десеріалізації. Це також означає, що не надається жодних гарантій щодо узгодженості результатів під час видалення ``ZoneInfo``, вибраного в середовищі з іншою версією даних часового поясу.

source: Functions
uk: Функції

source: Get a set containing all the valid keys for IANA time zones available anywhere on the time zone path. This is recalculated on every call to the function.
uk: Отримайте набір, що містить усі дійсні ключі для часових поясів IANA, доступних будь-де на шляху часового поясу. Це перераховується під час кожного виклику функції.

source: This function only includes canonical zone names and does not include "special" zones such as those under the ``posix/`` and ``right/`` directories, or the ``posixrules`` zone.
uk: Ця функція включає лише канонічні назви зон і не включає "спеціальні" зони, такі як ті, що знаходяться в каталогах ``posix/`` і ``right/`` або зона ``posixrules``.

source: This function may open a large number of files, as the best way to determine if a file on the time zone path is a valid time zone is to read the "magic string" at the beginning.
uk: Ця функція може відкрити велику кількість файлів, оскільки найкращий спосіб визначити, чи є файл на шляху до часового поясу дійсним часовим поясом, це прочитати "магічний рядок" на початку.

source: These values are not designed to be exposed to end-users; for user facing elements, applications should use something like CLDR (the Unicode Common Locale Data Repository) to get more user-friendly strings. See also the cautionary note on :attr:`ZoneInfo.key`.
uk: Ці значення не призначені для надання кінцевим користувачам; для елементів, які відкриваються користувачам, програми повинні використовувати щось на зразок CLDR (сховище даних Unicode Common Locale), щоб отримати більш зручні рядки. Дивіться також застереження щодо :attr:`ZoneInfo.key`.

source: Sets or resets the time zone search path (:data:`TZPATH`) for the module. When called with no arguments, :data:`TZPATH` is set to the default value.
uk: Встановлює або скидає шлях пошуку часового поясу (:data:`TZPATH`) для модуля. При виклику без аргументів :data:`TZPATH` встановлюється на значення за замовчуванням.

source: Calling ``reset_tzpath`` will not invalidate the :class:`ZoneInfo` cache, and so calls to the primary ``ZoneInfo`` constructor will only use the new ``TZPATH`` in the case of a cache miss.
uk: Виклик ``reset_tzpath`` не призведе до недійсності :class:`ZoneInfo` кешу, тому виклики основного ``ZoneInfo`` конструктора використовуватимуть новий ``TZPATH`` лише у випадку промаху кешу.

source: The ``to`` parameter must be a :term:`sequence` of strings or :class:`os.PathLike` and not a string, all of which must be absolute paths. :exc:`ValueError` will be raised if something other than an absolute path is passed.
uk: Параметр ``to`` має бути :term:`sequence` рядків або :class:`os.PathLike`, а не рядком, усі вони мають бути абсолютними шляхами. :exc:`ValueError` буде викликано, якщо передано щось інше, ніж абсолютний шлях.

source: Globals
uk: Глобальні
