Repository: seanpm2001/python-docs-uk
Catalog: using/windows.po
Languages: uk

source: If Python can't find its home and there are no registry value (frozen .exe, some very strange installation setup) you get a path with some default, but relative, paths.
uk: Якщо Python не може знайти свій дім і немає значення реєстру (заморожений .exe, якісь дуже дивні налаштування встановлення), ви отримаєте шлях із деякими типовими, але відносними шляхами.

source: For those who want to bundle Python into their application or distribution, the following advice will prevent conflicts with other installations:
uk: Для тих, хто хоче включити Python у свою програму чи дистрибутив, наступна порада запобіжить конфліктам з іншими інсталяціями:

source: Include a ``._pth`` file alongside your executable containing the directories to include. This will ignore paths listed in the registry and environment variables, and also ignore :mod:`site` unless ``import site`` is listed.
uk: Додайте файл ``._pth`` разом із виконуваним файлом, який містить каталоги для включення. Це ігноруватиме шляхи, вказані в реєстрі та змінних середовища, а також ігноруватиме :mod:`site`, якщо ``імпортувати сайт`` не зазначено.

source: If you are loading :file:`python3.dll` or :file:`python37.dll` in your own executable, explicitly call :c:func:`Py_SetPath` or (at least) :c:func:`Py_SetProgramName` before :c:func:`Py_Initialize`.
uk: Якщо ви завантажуєте :file:`python3.dll` або :file:`python37.dll` у свій власний виконуваний файл, явно викличте :c:func:`Py_SetPath` або (принаймні) :c:func:`Py_SetProgramName` перед :c:func:`Py_Initialize`.

source: Clear and/or overwrite :envvar:`PYTHONPATH` and set :envvar:`PYTHONHOME` before launching :file:`python.exe` from your application.
uk: Очистіть та/або перезапишіть :envvar:`PYTHONPATH` і встановіть :envvar:`PYTHONHOME` перед запуском :file:`python.exe` із вашої програми.

source: If you cannot use the previous suggestions (for example, you are a distribution that allows people to run :file:`python.exe` directly), ensure that the landmark file (:file:`Lib\\os.py`) exists in your install directory. (Note that it will not be detected inside a ZIP file, but a correctly named ZIP file will be detected instead.)
uk: Якщо ви не можете використати попередні пропозиції (наприклад, ви є дистрибутивом, який дозволяє людям запускати :file:`python.exe` безпосередньо), переконайтеся, що файл орієнтира (:file:`Lib\\os.py`) існує у вашому каталозі встановлення. (Зауважте, що його не буде виявлено всередині ZIP-файлу, натомість буде виявлено ZIP-файл із правильною назвою.)

source: These will ensure that the files in a system-wide installation will not take precedence over the copy of the standard library bundled with your application. Otherwise, your users may experience problems using your application. Note that the first suggestion is the best, as the others may still be susceptible to non-standard paths in the registry and user site-packages.
uk: Це гарантує, що файли загальносистемної інсталяції не матимуть пріоритету над копією стандартної бібліотеки, яка постачається разом із вашою програмою. Інакше у ваших користувачів можуть виникнути проблеми з використанням вашої програми. Зауважте, що перша пропозиція є найкращою, оскільки інші все ще можуть бути чутливими до нестандартних шляхів у реєстрі та пакетах сайтів користувачів.

source: Adds ``._pth`` file support and removes ``applocal`` option from ``pyvenv.cfg``.
uk: Додає підтримку файлів ``._pth`` і видаляє опцію ``applocal`` з ``pyvenv.cfg``.

source: Adds ``pythonXX.zip`` as a potential landmark when directly adjacent to the executable.
uk: Додає ``pythonXX.zip`` як потенційний орієнтир, коли він знаходиться безпосередньо поруч із виконуваним файлом.

source: Modules specified in the registry under ``Modules`` (not ``PythonPath``) may be imported by :class:`importlib.machinery.WindowsRegistryFinder`. This finder is enabled on Windows in 3.6.0 and earlier, but may need to be explicitly added to :attr:`sys.meta_path` in the future.
uk: Модулі, указані в реєстрі в розділі ``Модулі`` (не ``PythonPath``), можна імпортувати за допомогою :class:`importlib.machinery.WindowsRegistryFinder`. Цей засіб пошуку ввімкнуто в Windows 3.6.0 і раніших версій, але в майбутньому, можливо, його потрібно буде явно додати до :attr:`sys.meta_path`.

source: Additional modules
uk: Додаткові модулі

source: Even though Python aims to be portable among all platforms, there are features that are unique to Windows. A couple of modules, both in the standard library and external, and snippets exist to use these features.
uk: Незважаючи на те, що Python прагне бути переносним на всі платформи, є функції, які є унікальними для Windows. Існує кілька модулів, як у стандартній бібліотеці, так і зовнішніх, а також фрагменти для використання цих функцій.

source: The Windows-specific standard modules are documented in :ref:`mswin-specific-services`.
uk: Стандартні модулі для Windows задокументовані в :ref:`mswin-specific-services`.

source: The `PyWin32 <https://pypi.org/project/pywin32>`_ module by Mark Hammond is a collection of modules for advanced Windows-specific support. This includes utilities for:
uk: Модуль `PyWin32 <https://pypi.org/project/pywin32>`_ від Марка Хаммонда — це набір модулів для розширеної підтримки Windows. Це включає утиліти для:

source: `Component Object Model <https://docs.microsoft.com/en-us/windows/win32/com/component-object-model--com--portal>`_ (COM)
uk: `Компонентна об’єктна модель <https://docs.microsoft.com/en-us/windows/win32/com/component-object-model--com--portal>`_ (COM)

source: Win32 API calls
uk: Виклики API Win32

source: Registry
uk: Реєстр

source: Event log
uk: Журнал подій

source: `Microsoft Foundation Classes <https://docs.microsoft.com/en-us/cpp/mfc/mfc-desktop-applications>`_ (MFC) user interfaces
uk: Інтерфейс користувача `Microsoft Foundation Classes <https://docs.microsoft.com/en-us/cpp/mfc/mfc-desktop-applications>`_ (MFC)

source: `PythonWin <https://web.archive.org/web/20060524042422/ https://www.python.org/windows/pythonwin/>`_ is a sample MFC application shipped with PyWin32. It is an embeddable IDE with a built-in debugger.
uk: `PythonWin <https://web.archive.org/web/20060524042422/ https://www.python.org/windows/pythonwin/>`_ — це зразок програми MFC, що постачається разом із PyWin32. Це вбудована IDE із вбудованим налагоджувачем.

source: `Win32 How Do I...? <http://timgolden.me.uk/python/win32_how_do_i.html>`_
uk: `Win32 Як мені...? <http://timgolden.me.uk/python/win32_how_do_i.html>`_

source: by Tim Golden
uk: Тім Голден

source: `Python and COM <https://www.boddie.org.uk/python/COM.html>`_
uk: `Python і COM <https://www.boddie.org.uk/python/COM.html>`_

source: by David and Paul Boddie
uk: Девід і Пол Бодді

source: `cx_Freeze <https://cx-freeze.readthedocs.io/en/latest/>`_ is a :mod:`distutils` extension (see :ref:`extending-distutils`) which wraps Python scripts into executable Windows programs (:file:`{*}.exe` files). When you have done this, you can distribute your application without requiring your users to install Python.
uk: `cx_Freeze <https://cx-freeze.readthedocs.io/en/latest/>`_ — це розширення :mod:`distutils` (див. :ref:`extending-distutils`), яке загортає сценарії Python у виконувані програми Windows (файли:`{*}.exe`). Коли ви це зробите, ви зможете поширювати свою програму, не вимагаючи від користувачів встановлення Python.

source: Compiling Python on Windows
uk: Компіляція Python у Windows

source: The source tree contains a build solution and project files for Microsoft Visual Studio, which is the compiler used to build the official Python releases. These files are in the :file:`PCbuild` directory.
uk: Дерево вихідних кодів містить рішення для збірки та файли проекту для Microsoft Visual Studio, яка є компілятором, який використовується для створення офіційних випусків Python. Ці файли знаходяться в каталозі :file:`PCbuild`.

source: Check :file:`PCbuild/readme.txt` for general information on the build process.
uk: Перегляньте :file:`PCbuild/readme.txt` для отримання загальної інформації про процес збірки.

source: For extension modules, consult :ref:`building-on-windows`.
uk: Для модулів розширення зверніться до :ref:`building-on-windows`.

source: Other Platforms
uk: Інші платформи

source: With ongoing development of Python, some platforms that used to be supported earlier are no longer supported (due to the lack of users or developers). Check :pep:`11` for details on all unsupported platforms.
uk: Оскільки Python продовжується, деякі платформи, які підтримувалися раніше, більше не підтримуються (через відсутність користувачів або розробників). Перевірте :pep:`11`, щоб дізнатися більше про всі непідтримувані платформи.

source: The `Cygwin <https://cygwin.com/>`_ installer offers to install the `Python interpreter <https://cygwin.com/packages/summary/python3.html>`__ as well
uk: Інсталятор `Cygwin <https://cygwin.com/>`_ також пропонує встановити `Інтерпретатор Python <https://cygwin.com/packages/summary/python3.html>`__

source: See `Python for Windows <https://www.python.org/downloads/windows/>`_ for detailed information about platforms with pre-compiled installers.
uk: Перегляньте `Python для Windows <https://www.python.org/downloads/windows/>`_, щоб отримати детальну інформацію про платформи з попередньо скомпільованими інсталяторами.
