Repository: seanpm2001/python-docs-uk
Catalog: using/windows.po
Languages: uk

source: Using Python on Windows
uk: Використання Python у Windows

source: This document aims to give an overview of Windows-specific behaviour you should know about when using Python on Microsoft Windows.
uk: Цей документ має на меті дати огляд специфічної поведінки Windows, про яку ви повинні знати під час використання Python у Microsoft Windows.

source: Unlike most Unix systems and services, Windows does not include a system supported installation of Python. To make Python available, the CPython team has compiled Windows installers (MSI packages) with every `release <https://www.python.org/download/releases/>`_ for many years. These installers are primarily intended to add a per-user installation of Python, with the core interpreter and library being used by a single user. The installer is also able to install for all users of a single machine, and a separate ZIP file is available for application-local distributions.
uk: На відміну від більшості систем і служб Unix, Windows не включає системну інсталяцію Python. Щоб зробити Python доступним, команда CPython збирала інсталятори Windows (пакети MSI) з кожним `випуском <https://www.python.org/download/releases/>`_ протягом багатьох років. Ці інсталятори в першу чергу призначені для встановлення Python для кожного користувача, при цьому основний інтерпретатор і бібліотека використовуються одним користувачем. Інсталятор також може встановлюватися для всіх користувачів одного комп’ютера, а окремий ZIP-файл доступний для локальних дистрибутивів програми.

source: As specified in :pep:`11`, a Python release only supports a Windows platform while Microsoft considers the platform under extended support. This means that Python |version| supports Windows 8.1 and newer. If you require Windows 7 support, please install Python 3.8.
uk: Як зазначено в :pep:`11`, випуск Python підтримує лише платформу Windows, тоді як Microsoft розглядає цю платформу як розширену підтримку. Це означає, що Python |version| підтримує Windows 8.1 і новіше. Якщо вам потрібна підтримка Windows 7, установіть Python 3.8.

source: There are a number of different installers available for Windows, each with certain benefits and downsides.
uk: Існує кілька різних інсталяторів для Windows, кожен з яких має певні переваги та недоліки.

source: :ref:`windows-full` contains all components and is the best option for developers using Python for any kind of project.
uk: :ref:`windows-full` містить усі компоненти та є найкращим варіантом для розробників, які використовують Python для будь-яких проектів.

source: :ref:`windows-nuget` are lightweight installations intended for continuous integration systems. It can be used to build Python packages or run scripts, but is not updateable and has no user interface tools.
uk: :ref:`windows-nuget` — це легкі установки, призначені для систем безперервної інтеграції. Його можна використовувати для створення пакетів Python або запуску сценаріїв, але він не оновлюється та не має інструментів інтерфейсу користувача.

source: :ref:`windows-embeddable` is a minimal package of Python suitable for embedding into a larger application.
uk: :ref:`windows-embeddable` — це мінімальний пакет Python, придатний для вбудовування у більшу програму.

source: The full installer
uk: Повний інсталятор

source: Installation steps
uk: Етапи встановлення

source: Four Python |version| installers are available for download - two each for the 32-bit and 64-bit versions of the interpreter. The *web installer* is a small initial download, and it will automatically download the required components as necessary. The *offline installer* includes the components necessary for a default installation and only requires an internet connection for optional features. See :ref:`install-layout-option` for other ways to avoid downloading during installation.
uk: Чотири Python |version| інсталятори доступні для завантаження - по два для 32-розрядної та 64-розрядної версій інтерпретатора. *Веб-інсталятор* — це невелике початкове завантаження, яке за потреби автоматично завантажить необхідні компоненти. *Автономний інсталятор* містить компоненти, необхідні для інсталяції за замовчуванням, і вимагає лише підключення до Інтернету для додаткових функцій. Перегляньте :ref:`install-layout-option` для інших способів уникнути завантаження під час інсталяції.

source: After starting the installer, one of two options may be selected:
uk: Після запуску інсталятора можна вибрати один із двох варіантів:

source: If you select "Install Now":
uk: Якщо вибрати "Встановити зараз":

source: You will *not* need to be an administrator (unless a system update for the C Runtime Library is required or you install the :ref:`launcher` for all users)
uk: Вам *не* потрібно бути адміністратором (якщо не потрібне оновлення системи для C Runtime Library або якщо ви не встановите :ref:`launcher` для всіх користувачів)

source: Python will be installed into your user directory
uk: Python буде встановлено у ваш каталог користувача

source: The :ref:`launcher` will be installed according to the option at the bottom of the first page
uk: :ref:`launcher` буде встановлено відповідно до опції внизу першої сторінки

source: The standard library, test suite, launcher and pip will be installed
uk: Буде встановлено стандартну бібліотеку, набір тестів, засіб запуску та pip

source: If selected, the install directory will be added to your :envvar:`PATH`
uk: Якщо вибрано, каталог встановлення буде додано до вашого :envvar:`PATH`

source: Shortcuts will only be visible for the current user
uk: Ярлики будуть видимі лише для поточного користувача

source: Selecting "Customize installation" will allow you to select the features to install, the installation location and other options or post-install actions. To install debugging symbols or binaries, you will need to use this option.
uk: Вибравши "Налаштувати інсталяцію", ви зможете вибрати функції для інсталяції, місце інсталяції та інші параметри чи дії після інсталяції. Щоб установити символи налагодження або двійкові файли, вам потрібно буде скористатися цією опцією.

source: To perform an all-users installation, you should select "Customize installation". In this case:
uk: Щоб виконати інсталяцію для всіх користувачів, вам слід вибрати "Налаштувати інсталяцію". В цьому випадку:

source: You may be required to provide administrative credentials or approval
uk: Вам може знадобитися надати облікові дані адміністратора або схвалення

source: Python will be installed into the Program Files directory
uk: Python буде встановлено в каталог Program Files

source: The :ref:`launcher` will be installed into the Windows directory
uk: :ref:`launcher` буде встановлено в каталог Windows

source: Optional features may be selected during installation
uk: Під час встановлення можна вибрати додаткові функції

source: The standard library can be pre-compiled to bytecode
uk: Стандартна бібліотека може бути попередньо скомпільована в байт-код

source: If selected, the install directory will be added to the system :envvar:`PATH`
uk: Якщо вибрано, каталог встановлення буде додано до системи :envvar:`PATH`

source: Shortcuts are available for all users
uk: Ярлики доступні для всіх користувачів

source: Removing the MAX_PATH Limitation
uk: Видалення обмеження MAX_PATH

source: Windows historically has limited path lengths to 260 characters. This meant that paths longer than this would not resolve and errors would result.
uk: Історично у Windows довжина шляху обмежена 260 символами. Це означало, що шляхи, довші за цей, не вирішуватимуться, і спричинятимуться помилки.

source: In the latest versions of Windows, this limitation can be expanded to approximately 32,000 characters. Your administrator will need to activate the "Enable Win32 long paths" group policy, or set ``LongPathsEnabled`` to ``1`` in the registry key ``HKEY_LOCAL_MACHINE\SYSTEM\CurrentControlSet\Control\FileSystem``.
uk: В останніх версіях Windows це обмеження можна розширити приблизно до 32 000 символів. Вашому адміністратору потрібно буде активувати групову політику "Увімкнути довгі шляхи Win32" або встановити для ``LongPathsEnabled`` значення ``1`` у розділі реєстру ``HKEY_LOCAL_MACHINE\SYSTEM\CurrentControlSet\Control\FileSystem``.

source: This allows the :func:`open` function, the :mod:`os` module and most other path functionality to accept and return paths longer than 260 characters.
uk: Це дозволяє функції :func:`open`, модулю :mod:`os` і більшості інших функцій шляху приймати та повертати шляхи, довші за 260 символів.

source: After changing the above option, no further configuration is required.
uk: Після зміни наведеного вище параметра подальша настройка не потрібна.

source: Support for long paths was enabled in Python.
uk: У Python увімкнено підтримку довгих шляхів.

source: Installing Without UI
uk: Встановлення без інтерфейсу користувача

source: All of the options available in the installer UI can also be specified from the command line, allowing scripted installers to replicate an installation on many machines without user interaction. These options may also be set without suppressing the UI in order to change some of the defaults.
uk: Усі параметри, доступні в інтерфейсі користувача інсталятора, також можна вказати з командного рядка, що дозволяє сценаріям інсталяторів копіювати інсталяцію на багатьох машинах без участі користувача. Ці параметри також можна встановити без придушення інтерфейсу користувача, щоб змінити деякі параметри за замовчуванням.

source: To completely hide the installer UI and install Python silently, pass the ``/quiet`` option. To skip past the user interaction but still display progress and errors, pass the ``/passive`` option. The ``/uninstall`` option may be passed to immediately begin removing Python - no confirmation prompt will be displayed.
uk: Щоб повністю приховати інтерфейс інсталятора та безшумно встановити Python, передайте параметр ``/quiet``. Щоб пропустити взаємодію з користувачем, але все одно відобразити прогрес і помилки, передайте параметр ``/passive``. Параметр ``/uninstall`` може бути переданий, щоб негайно розпочати видалення Python - підтвердження не відображатиметься.

source: All other options are passed as ``name=value``, where the value is usually ``0`` to disable a feature, ``1`` to enable a feature, or a path. The full list of available options is shown below.
uk: Усі інші параметри передаються як ``name=value``, де зазвичай значення ``0``, щоб вимкнути функцію, ``1``, щоб увімкнути функцію, або шлях. Нижче наведено повний список доступних опцій.

source: Name
uk: Ім'я

source: Description
uk: опис

source: Default
uk: За замовчуванням

source: Perform a system-wide installation.
uk: Виконайте установку для всієї системи.

source: The installation directory
uk: Каталог встановлення

source: Selected based on InstallAllUsers
uk: Вибрано на основі InstallAllUsers

source: The default installation directory for all-user installs
uk: Стандартний каталог встановлення для всіх користувачів

source: The default install directory for just-for-me installs
uk: Каталог встановлення за замовчуванням для встановлення лише для мене

source: The default custom install directory displayed in the UI
uk: Каталог спеціального встановлення за замовчуванням, який відображається в інтерфейсі користувача

source: (empty)
uk: (порожній)

source: Create file associations if the launcher is also installed.
uk: Створіть асоціації файлів, якщо також встановлено програму запуску.

source: Compile all ``.py`` files to ``.pyc``.
uk: Зкомпілюйте всі файли ``.py`` до ``.pyc``.

source: Shortcuts
uk: Ярлики

source: Create shortcuts for the interpreter, documentation and IDLE if installed.
uk: Створіть ярлики для інтерпретатора, документації та IDLE, якщо встановлено.

source: Install Python manual
uk: Інсталюйте посібник з Python

source: Install debug binaries
uk: Встановити двійкові файли налагодження

source: Include_exe
uk: Включити_exe

source: Install :ref:`launcher`.
uk: Встановіть :ref:`launcher`.

source: Include_lib
uk: Включити_бібліотеку

source: Include_pip
uk: Включити_піп

source: Install bundled pip and setuptools
uk: Встановіть у комплекті pip і setuptools

source: Include_symbols
uk: Включити_символи

source: Include_tcltk
uk: Включити_tcltk

source: Install Tcl/Tk support and IDLE
uk: Встановіть підтримку Tcl/Tk і IDLE

source: Include_test
uk: Включити_тест

source: Install standard library test suite
uk: Встановіть стандартний набір тестів бібліотеки

source: Install utility scripts
uk: Встановити службові скрипти

source: Only installs the launcher. This will override most other options.
uk: Встановлює лише лаунчер. Це замінить більшість інших параметрів.

source: Disable most install UI
uk: Вимкнути більшість інтерфейсу користувача для встановлення

source: A custom message to display when the simplified install UI is used.
uk: Спеціальне повідомлення, яке відображатиметься під час використання спрощеного інтерфейсу користувача для встановлення.

source: For example, to silently install a default, system-wide Python installation, you could use the following command (from an elevated command prompt)::
uk: Наприклад, щоб безшумно встановити загальносистемну інсталяцію Python за замовчуванням, можна використати таку команду (з командного рядка з адміністраторами):

source: To allow users to easily install a personal copy of Python without the test suite, you could provide a shortcut with the following command. This will display a simplified initial page and disallow customization::
uk: Щоб дозволити користувачам легко інсталювати особисту копію Python без набору тестів, ви можете створити ярлик за допомогою такої команди. Це відобразить спрощену початкову сторінку та заборонить налаштування::

source: (Note that omitting the launcher also omits file associations, and is only recommended for per-user installs when there is also a system-wide installation that included the launcher.)
uk: (Зауважте, що відсутність програми запуску також пропускає асоціації файлів і рекомендується лише для інсталяції для кожного користувача, якщо також є загальносистемна інсталяція, яка включає програму запуску.)

source: The options listed above can also be provided in a file named ``unattend.xml`` alongside the executable. This file specifies a list of options and values. When a value is provided as an attribute, it will be converted to a number if possible. Values provided as element text are always left as strings. This example file sets the same options as the previous example:
uk: Параметри, перелічені вище, також можна надати у файлі з назвою ``unattend.xml`` разом із виконуваним файлом. Цей файл визначає список параметрів і значень. Коли значення надається як атрибут, воно буде перетворено на число, якщо це можливо. Значення, надані як текст елемента, завжди залишаються як рядки. Цей приклад файлу встановлює ті самі параметри, що й попередній приклад:

source: Installing Without Downloading
uk: Встановлення без завантаження

source: As some features of Python are not included in the initial installer download, selecting those features may require an internet connection. To avoid this need, all possible components may be downloaded on-demand to create a complete *layout* that will no longer require an internet connection regardless of the selected features. Note that this download may be bigger than required, but where a large number of installations are going to be performed it is very useful to have a locally cached copy.
uk: Оскільки деякі функції Python не входять до початкового завантаження інсталятора, для вибору цих функцій може знадобитися підключення до Інтернету. Щоб уникнути цієї необхідності, усі можливі компоненти можна завантажити на вимогу, щоб створити повний *макет*, який більше не потребуватиме підключення до Інтернету, незалежно від вибраних функцій. Зауважте, що це завантаження може бути більшим, ніж потрібно, але якщо планується виконати велику кількість інсталяцій, дуже корисно мати локально кешовану копію.

source: Execute the following command from Command Prompt to download all possible required files. Remember to substitute ``python-3.9.0.exe`` for the actual name of your installer, and to create layouts in their own directories to avoid collisions between files with the same name.
uk: Виконайте наступну команду з командного рядка, щоб завантажити всі необхідні файли. Не забудьте замінити ``python-3.9.0.exe`` замість справжньої назви вашого інсталятора та створити макети у власних каталогах, щоб уникнути зіткнень між файлами з однаковою назвою.

source: You may also specify the ``/quiet`` option to hide the progress display.
uk: Ви також можете вказати параметр ``/quiet``, щоб приховати відображення прогресу.

source: Modifying an install
uk: Зміна інсталяції

source: Once Python has been installed, you can add or remove features through the Programs and Features tool that is part of Windows. Select the Python entry and choose "Uninstall/Change" to open the installer in maintenance mode.
uk: Після встановлення Python ви можете додавати або видаляти функції за допомогою інструмента "Програми та засоби", який є частиною Windows. Виберіть запис Python і виберіть "Видалити/Змінити", щоб відкрити програму встановлення в режимі обслуговування.

source: "Modify" allows you to add or remove features by modifying the checkboxes - unchanged checkboxes will not install or remove anything. Some options cannot be changed in this mode, such as the install directory; to modify these, you will need to remove and then reinstall Python completely.
uk: "Змінити" дозволяє додавати або видаляти функції, змінюючи прапорці - незмінені прапорці не встановлюють або видаляють нічого. Деякі параметри не можна змінити в цьому режимі, наприклад каталог встановлення; щоб змінити їх, вам потрібно буде видалити, а потім повністю перевстановити Python.

source: "Repair" will verify all the files that should be installed using the current settings and replace any that have been removed or modified.
uk: "Відновлення" перевірить усі файли, які слід інсталювати з використанням поточних налаштувань, і замінить усі видалені чи змінені.

source: "Uninstall" will remove Python entirely, with the exception of the :ref:`launcher`, which has its own entry in Programs and Features.
uk: "Видалити" повністю видалить Python, за винятком :ref:`launcher`, який має власний запис у програмах і функціях.

source: The Microsoft Store package
uk: Пакет Microsoft Store

source: The Microsoft Store package is an easily installable Python interpreter that is intended mainly for interactive use, for example, by students.
uk: Пакет Microsoft Store — це інтерпретатор Python, який легко встановлюється і призначений переважно для інтерактивного використання, наприклад, студентами.

source: To install the package, ensure you have the latest Windows 10 updates and search the Microsoft Store app for "Python |version|". Ensure that the app you select is published by the Python Software Foundation, and install it.
uk: Щоб інсталювати пакет, переконайтеся, що у вас є останні оновлення Windows 10, і знайдіть у програмі Microsoft Store "Python |version|". Переконайтеся, що вибрану програму опубліковано Python Software Foundation, і встановіть її.

source: Python will always be available for free on the Microsoft Store. If you are asked to pay for it, you have not selected the correct package.
uk: Python завжди буде доступний безкоштовно в Microsoft Store. Якщо вас попросять заплатити за це, ви не вибрали правильний пакет.

source: After installation, Python may be launched by finding it in Start. Alternatively, it will be available from any Command Prompt or PowerShell session by typing ``python``. Further, pip and IDLE may be used by typing ``pip`` or ``idle``. IDLE can also be found in Start.
uk: Після інсталяції Python можна запустити, знайшовши його в меню Пуск. Крім того, він буде доступний з будь-якого командного рядка або сеансу PowerShell, ввівши ``python``. Крім того, pip і IDLE можна використовувати, ввівши ``pip`` або ``idle``. IDLE також можна знайти в Пуск.

source: All three commands are also available with version number suffixes, for example, as ``python3.exe`` and ``python3.x.exe`` as well as ``python.exe`` (where ``3.x`` is the specific version you want to launch, such as |version|). Open "Manage App Execution Aliases" through Start to select which version of Python is associated with each command. It is recommended to make sure that ``pip`` and ``idle`` are consistent with whichever version of ``python`` is selected.
uk: Усі три команди також доступні з суфіксами номерів версій, наприклад, як ``python3.exe`` і ``python3.x.exe``, а також ``python.exe`` (де ``'3.x'`` — це конкретна версія, яку ви хочете запустити, наприклад |version|). Відкрийте "Керування псевдонімами виконання програми" через "Пуск", щоб вибрати, яку версію Python пов’язано з кожною командою. Рекомендується переконатися, що ``pip`` і ``idle`` узгоджені з будь-якою версією ``python``, яку вибрано.

source: Virtual environments can be created with ``python -m venv`` and activated and used as normal.
uk: Віртуальні середовища можна створити за допомогою ``python -m venv``, активувати та використовувати як зазвичай.

source: If you have installed another version of Python and added it to your ``PATH`` variable, it will be available as ``python.exe`` rather than the one from the Microsoft Store. To access the new installation, use ``python3.exe`` or ``python3.x.exe``.
uk: Якщо ви встановили іншу версію Python і додали її до своєї змінної ``PATH``, вона буде доступна як ``python.exe``, а не як файл із Microsoft Store. Щоб отримати доступ до нової інсталяції, використовуйте ``python3.exe`` або ``python3.x.exe``.

source: The ``py.exe`` launcher will detect this Python installation, but will prefer installations from the traditional installer.
uk: Засіб запуску ``py.exe`` виявить цю інсталяцію Python, але віддасть перевагу інсталяції з традиційного інсталятора.

source: To remove Python, open Settings and use Apps and Features, or else find Python in Start and right-click to select Uninstall. Uninstalling will remove all packages you installed directly into this Python installation, but will not remove any virtual environments
uk: Щоб видалити Python, відкрийте "Параметри" та скористайтеся "Програми та функції" або знайдіть Python у "Пуску" та клацніть правою кнопкою миші, щоб вибрати "Видалити". Видалення видалить усі пакети, які ви встановили безпосередньо в цю інсталяцію Python, але не видалить віртуальні середовища

source: For more detail on the technical basis for these limitations, please consult Microsoft's documentation on packaged full-trust apps, currently available at `docs.microsoft.com/en-us/windows/msix/desktop/desktop-to-uwp-behind-the-scenes <https://docs.microsoft.com/en-us/windows/msix/desktop/desktop-to-uwp-behind-the-scenes>`_
uk: Щоб отримати докладніші відомості про технічну основу цих обмежень, зверніться до документації Microsoft щодо пакетних програм із повною довірою, яка наразі доступна за адресою `docs.microsoft.com/en-us/windows/msix/desktop/desktop-to-uwp-behind- the-scenes <https://docs.microsoft.com/en-us/windows/msix/desktop/desktop-to-uwp-behind-the-scenes>`_

source: The nuget.org packages
uk: Пакунки nuget.org
