Repository: seanpm2001/python-docs-uk
Catalog: using/windows.po
Languages: uk

source: The nuget.org package is a reduced size Python environment intended for use on continuous integration and build systems that do not have a system-wide install of Python. While nuget is "the package manager for .NET", it also works perfectly fine for packages containing build-time tools.
uk: Пакет nuget.org — це середовище Python зменшеного розміру, призначене для використання в системах безперервної інтеграції та побудови, які не мають загальносистемної інсталяції Python. Хоча nuget є "менеджером пакунків для .NET", він також чудово працює для пакунків, що містять інструменти для збирання.

source: Visit `nuget.org <https://www.nuget.org/>`_ for the most up-to-date information on using nuget. What follows is a summary that is sufficient for Python developers.
uk: Відвідайте `nuget.org <https://www.nuget.org/>`_, щоб отримати найновішу інформацію про використання nuget. Далі наведено підсумок, достатній для розробників Python.

source: The ``nuget.exe`` command line tool may be downloaded directly from ``https://aka.ms/nugetclidl``, for example, using curl or PowerShell. With the tool, the latest version of Python for 64-bit or 32-bit machines is installed using::
uk: Інструмент командного рядка ``nuget.exe`` можна завантажити безпосередньо з ``https://aka.ms/nugetclidl``, наприклад, за допомогою curl або PowerShell. За допомогою інструменту встановлюється остання версія Python для 64-розрядних або 32-розрядних машин за допомогою:

source: To select a particular version, add a ``-Version 3.x.y``. The output directory may be changed from ``.``, and the package will be installed into a subdirectory. By default, the subdirectory is named the same as the package, and without the ``-ExcludeVersion`` option this name will include the specific version installed. Inside the subdirectory is a ``tools`` directory that contains the Python installation:
uk: Щоб вибрати певну версію, додайте ``-Version 3.x.y``. Вихідний каталог можна змінити з ``.``, і пакет буде встановлено в підкаталог. За замовчуванням підкаталог називається так само, як і пакунок, і без опції ``-ExcludeVersion`` ця назва включатиме конкретну встановлену версію. Усередині підкаталогу є каталог ``tools``, який містить установку Python:

source: In general, nuget packages are not upgradeable, and newer versions should be installed side-by-side and referenced using the full path. Alternatively, delete the package directory manually and install it again. Many CI systems will do this automatically if they do not preserve files between builds.
uk: Загалом пакети nuget не можна оновлювати, а новіші версії слід встановлювати поруч із повним шляхом. Крім того, видаліть каталог пакетів вручну та інсталюйте його знову. Багато систем CI зроблять це автоматично, якщо вони не зберігають файли між збірками.

source: Alongside the ``tools`` directory is a ``build\native`` directory. This contains a MSBuild properties file ``python.props`` that can be used in a C++ project to reference the Python install. Including the settings will automatically use the headers and import libraries in your build.
uk: Поряд з каталогом ``tools`` є каталог ``build\native``. Він містить файл властивостей MSBuild ``python.props``, який можна використовувати в проекті C++ для посилання на встановлення Python. Включення налаштувань автоматично використовуватиме заголовки та бібліотеки імпорту у вашій збірці.

source: The package information pages on nuget.org are `www.nuget.org/packages/python <https://www.nuget.org/packages/python>`_ for the 64-bit version and `www.nuget.org/packages/pythonx86 <https://www.nuget.org/packages/pythonx86>`_ for the 32-bit version.
uk: Сторінки інформації про пакети на nuget.org: `www.nuget.org/packages/python <https://www.nuget.org/packages/python>`_ для 64-розрядної версії та `www.nuget.org/packages/pythonx86 <https://www.nuget.org/packages/pythonx86>`_ для 32-розрядної версії.

source: The embeddable package
uk: Вбудовуваний пакет

source: The embedded distribution is a ZIP file containing a minimal Python environment. It is intended for acting as part of another application, rather than being directly accessed by end-users.
uk: Вбудований дистрибутив — це ZIP-файл, що містить мінімальне середовище Python. Він призначений для роботи як частини іншої програми, а не для прямого доступу кінцевих користувачів.

source: When extracted, the embedded distribution is (almost) fully isolated from the user's system, including environment variables, system registry settings, and installed packages. The standard library is included as pre-compiled and optimized ``.pyc`` files in a ZIP, and ``python3.dll``, ``python37.dll``, ``python.exe`` and ``pythonw.exe`` are all provided. Tcl/tk (including all dependants, such as Idle), pip and the Python documentation are not included.
uk: Після розпакування вбудований дистрибутив (майже) повністю ізольований від системи користувача, включаючи змінні середовища, налаштування системного реєстру та встановлені пакети. Стандартна бібліотека включена у вигляді попередньо скомпільованих та оптимізованих файлів ``.pyc`` у ZIP, а також ``python3.dll``, ``python37.dll``, ``python.exe`` і ``pythonw`` Усі файли .exe`` надаються. Tcl/tk (включно з усіма залежними, такими як Idle), pip і документація Python не включені.

source: The embedded distribution does not include the `Microsoft C Runtime <https://docs.microsoft.com/en-US/cpp/windows/latest-supported-vc-redist#visual-studio-2015-2017-2019-and-2022>`_ and it is the responsibility of the application installer to provide this. The runtime may have already been installed on a user's system previously or automatically via Windows Update, and can be detected by finding ``ucrtbase.dll`` in the system directory.
uk: Вбудований дистрибутив не включає `Microsoft C Runtime <https://docs.microsoft.com/en-US/cpp/windows/latest-supported-vc-redist#visual-studio-2015-2017-2019-and-2022>`_, і інсталятор програми несе відповідальність за його надання. Середовище виконання могло бути вже встановлено в системі користувача раніше або автоматично через Windows Update, і його можна виявити, знайшовши ``ucrtbase.dll`` у системному каталозі.

source: Third-party packages should be installed by the application installer alongside the embedded distribution. Using pip to manage dependencies as for a regular Python installation is not supported with this distribution, though with some care it may be possible to include and use pip for automatic updates. In general, third-party packages should be treated as part of the application ("vendoring") so that the developer can ensure compatibility with newer versions before providing updates to users.
uk: Пакунки сторонніх розробників повинні бути встановлені інсталятором програми разом із вбудованим дистрибутивом. Використання pip для керування залежностями, як для звичайної інсталяції Python, не підтримується цим дистрибутивом, хоча з певною обережністю можна включити та використовувати pip для автоматичних оновлень. Загалом пакети сторонніх розробників слід розглядати як частину програми ("постачальник"), щоб розробник міг забезпечити сумісність із новими версіями, перш ніж надавати оновлення користувачам.

source: The two recommended use cases for this distribution are described below.
uk: Нижче наведено два рекомендованих випадки використання цього дистрибутива.

source: Python Application
uk: Програма Python

source: An application written in Python does not necessarily require users to be aware of that fact. The embedded distribution may be used in this case to include a private version of Python in an install package. Depending on how transparent it should be (or conversely, how professional it should appear), there are two options.
uk: Програма, написана на Python, не обов’язково вимагає від користувачів усвідомлення цього факту. Вбудований дистрибутив можна використовувати в цьому випадку, щоб включити приватну версію Python до інсталяційного пакета. Залежно від того, наскільки це має бути прозоро (або, навпаки, наскільки професійно це має виглядати), є два варіанти.

source: Using a specialized executable as a launcher requires some coding, but provides the most transparent experience for users. With a customized launcher, there are no obvious indications that the program is running on Python: icons can be customized, company and version information can be specified, and file associations behave properly. In most cases, a custom launcher should simply be able to call ``Py_Main`` with a hard-coded command line.
uk: Використання спеціалізованого виконуваного файлу як засобу запуску вимагає певного кодування, але забезпечує максимально прозорий досвід для користувачів. За допомогою налаштованого засобу запуску немає очевидних ознак того, що програма працює на Python: значки можна налаштувати, інформацію про компанію та версію можна вказати, а асоціації файлів поводяться належним чином. У більшості випадків спеціальна програма запуску повинна просто мати можливість викликати ``Py_Main`` за допомогою жорстко закодованого командного рядка.

source: The simpler approach is to provide a batch file or generated shortcut that directly calls the ``python.exe`` or ``pythonw.exe`` with the required command-line arguments. In this case, the application will appear to be Python and not its actual name, and users may have trouble distinguishing it from other running Python processes or file associations.
uk: Простіший підхід полягає в тому, щоб надати пакетний файл або згенерований ярлик, який безпосередньо викликає ``python.exe`` або ``pythonw.exe`` з потрібними аргументами командного рядка. У цьому випадку програма виглядатиме як Python, а не її справжня назва, і користувачі можуть мати проблеми з відрізненням її від інших запущених процесів Python або асоціацій файлів.

source: With the latter approach, packages should be installed as directories alongside the Python executable to ensure they are available on the path. With the specialized launcher, packages can be located in other locations as there is an opportunity to specify the search path before launching the application.
uk: За останнього підходу пакунки мають бути встановлені як каталоги поряд із виконуваним файлом Python, щоб забезпечити їх доступність на шляху. За допомогою спеціалізованої програми запуску пакети можуть бути розташовані в інших місцях, оскільки є можливість вказати шлях пошуку перед запуском програми.

source: Embedding Python
uk: Вбудовування Python

source: Applications written in native code often require some form of scripting language, and the embedded Python distribution can be used for this purpose. In general, the majority of the application is in native code, and some part will either invoke ``python.exe`` or directly use ``python3.dll``. For either case, extracting the embedded distribution to a subdirectory of the application installation is sufficient to provide a loadable Python interpreter.
uk: Програми, написані у рідному коді, часто вимагають певної форми мови сценаріїв, і для цієї мети можна використовувати вбудований дистрибутив Python. Загалом, більшість програми створено у власному коді, а деяка частина або викликає ``python.exe``, або безпосередньо використовує ``python3.dll``. У будь-якому випадку вилучення вбудованого дистрибутива до підкаталогу інсталяції програми достатньо для забезпечення завантажуваного інтерпретатора Python.

source: As with the application use, packages can be installed to any location as there is an opportunity to specify search paths before initializing the interpreter. Otherwise, there is no fundamental differences between using the embedded distribution and a regular installation.
uk: Як і у випадку з використанням програми, пакети можна встановити в будь-яке місце, оскільки є можливість вказати шляхи пошуку перед ініціалізацією інтерпретатора. В іншому принципових відмінностей між використанням вбудованого дистрибутива і звичайною установкою немає.

source: Alternative bundles
uk: Альтернативні пучки

source: Besides the standard CPython distribution, there are modified packages including additional functionality. The following is a list of popular versions and their key features:
uk: Окрім стандартного дистрибутива CPython, існують модифіковані пакети, що включають додаткові функції. Нижче наведено список популярних версій та їхні основні функції:

source: Installer with multi-platform compatibility, documentation, PyWin32
uk: Інсталятор з мультиплатформенною сумісністю, документація, PyWin32

source: `Anaconda <https://www.anaconda.com/download/>`_
uk: `Анаконда <https://www.anaconda.com/download/>`_

source: Popular scientific modules (such as numpy, scipy and pandas) and the ``conda`` package manager.
uk: Науково-популярні модулі (такі як numpy, scipy і pandas) і менеджер пакетів ``conda``.

source: Windows-specific distribution with prebuilt scientific packages and tools for building packages.
uk: Спеціальний дистрибутив для Windows із попередньо зібраними науковими пакетами та інструментами для створення пакетів.

source: Note that these packages may not include the latest versions of Python or other libraries, and are not maintained or supported by the core Python team.
uk: Зауважте, що ці пакети можуть не включати останні версії Python або інші бібліотеки, а також не обслуговуються та не підтримуються основною командою Python.

source: Configuring Python
uk: Налаштування Python

source: To run Python conveniently from a command prompt, you might consider changing some default environment variables in Windows. While the installer provides an option to configure the PATH and PATHEXT variables for you, this is only reliable for a single, system-wide installation. If you regularly use multiple versions of Python, consider using the :ref:`launcher`.
uk: Щоб зручно запускати Python із командного рядка, ви можете змінити деякі змінні середовища за замовчуванням у Windows. Хоча інсталятор надає можливість налаштувати змінні PATH і PATHEXT для вас, це надійно лише для однієї інсталяції в системі. Якщо ви регулярно використовуєте кілька версій Python, подумайте про використання :ref:`launcher`.

source: Excursus: Setting environment variables
uk: Екскурс: Встановлення змінних середовища

source: Windows allows environment variables to be configured permanently at both the User level and the System level, or temporarily in a command prompt.
uk: Windows дозволяє постійно налаштовувати змінні середовища як на рівні користувача, так і на рівні системи або тимчасово в командному рядку.

source: To temporarily set environment variables, open Command Prompt and use the :command:`set` command:
uk: Щоб тимчасово встановити змінні середовища, відкрийте командний рядок і скористайтеся командою :command:`set`:

source: These changes will apply to any further commands executed in that console, and will be inherited by any applications started from the console.
uk: Ці зміни застосовуватимуться до будь-яких подальших команд, що виконуються на цій консолі, і будуть успадковані будь-якими програмами, запущеними з консолі.

source: Including the variable name within percent signs will expand to the existing value, allowing you to add your new value at either the start or the end. Modifying :envvar:`PATH` by adding the directory containing :program:`python.exe` to the start is a common way to ensure the correct version of Python is launched.
uk: Включення назви змінної до знаків відсотка розширить наявне значення, що дозволить вам додати нове значення на початку або в кінці. Змінення :envvar:`PATH` шляхом додавання каталогу, що містить :program:`python.exe` на початок, є поширеним способом забезпечення запуску правильної версії Python.

source: To permanently modify the default environment variables, click Start and search for 'edit environment variables', or open System properties, :guilabel:`Advanced system settings` and click the :guilabel:`Environment Variables` button. In this dialog, you can add or modify User and System variables. To change System variables, you need non-restricted access to your machine (i.e. Administrator rights).
uk: Щоб остаточно змінити змінні середовища за замовчуванням, клацніть "Пуск" і знайдіть "редагувати змінні середовища" або відкрийте властивості системи, :guilabel:`Advanced system settings` і натисніть кнопку :guilabel:`Environment Variables`. У цьому діалоговому вікні ви можете додавати або змінювати змінні користувача та системи. Щоб змінити системні змінні, вам потрібен необмежений доступ до вашої машини (тобто права адміністратора).

source: Windows will concatenate User variables *after* System variables, which may cause unexpected results when modifying :envvar:`PATH`.
uk: Windows об’єднає змінні користувача *після* системних змінних, що може призвести до неочікуваних результатів під час зміни :envvar:`PATH`.

source: The :envvar:`PYTHONPATH` variable is used by all versions of Python, so you should not permanently configure it unless the listed paths only include code that is compatible with all of your installed Python versions.
uk: Змінна :envvar:`PYTHONPATH` використовується всіма версіями Python, тому вам не слід постійно налаштовувати її, якщо перелічені шляхи не містять лише коду, сумісного з усіма встановленими версіями Python.

source: Overview of environment variables on Windows
uk: Огляд змінних середовища в Windows

source: The ``set`` command, for temporarily modifying environment variables
uk: Команда ``set`` для тимчасової зміни змінних середовища

source: The ``setx`` command, for permanently modifying environment variables
uk: Команда ``setx`` для постійної зміни змінних середовища

source: Finding the Python executable
uk: Пошук виконуваного файлу Python

source: Besides using the automatically created start menu entry for the Python interpreter, you might want to start Python in the command prompt. The installer has an option to set that up for you.
uk: Окрім використання автоматично створеного пункту меню "Пуск" для інтерпретатора Python, ви можете запустити Python у командному рядку. Інсталятор має можливість налаштувати це для вас.

source: On the first page of the installer, an option labelled "Add Python to PATH" may be selected to have the installer add the install location into the :envvar:`PATH`. The location of the :file:`Scripts\\` folder is also added. This allows you to type :command:`python` to run the interpreter, and :command:`pip` for the package installer. Thus, you can also execute your scripts with command line options, see :ref:`using-on-cmdline` documentation.
uk: На першій сторінці інсталятора можна вибрати опцію "Додати Python до ШЛЯХУ", щоб інсталятор додав місце встановлення до :envvar:`PATH`. Також додано розташування папки :file:`Scripts\\`. Це дозволяє ввести :command:`python` для запуску інтерпретатора та :command:`pip` для інсталятора пакунків. Таким чином, ви також можете виконувати ваші сценарії з параметрами командного рядка, дивіться документацію :ref:`using-on-cmdline`.

source: If you don't enable this option at install time, you can always re-run the installer, select Modify, and enable it. Alternatively, you can manually modify the :envvar:`PATH` using the directions in :ref:`setting-envvars`. You need to set your :envvar:`PATH` environment variable to include the directory of your Python installation, delimited by a semicolon from other entries. An example variable could look like this (assuming the first two entries already existed)::
uk: Якщо ви не ввімкнете цей параметр під час інсталяції, ви завжди можете повторно запустити інсталятор, вибрати "Змінити" та ввімкнути його. Крім того, ви можете вручну змінити :envvar:`PATH`, використовуючи вказівки в :ref:`setting-envvars`. Вам потрібно налаштувати змінну середовища :envvar:`PATH`, щоб включити каталог вашої інсталяції Python, відокремлений крапкою з комою від інших записів. Приклад змінної може виглядати так (за умови, що перші два записи вже існують):

source: UTF-8 mode
uk: Режим UTF-8

source: This may cause issues because UTF-8 is widely used on the internet and most Unix systems, including WSL (Windows Subsystem for Linux).
uk: Це може спричинити проблеми, оскільки UTF-8 широко використовується в Інтернеті та більшості систем Unix, включаючи WSL (підсистема Windows для Linux).

source: You can use the :ref:`Python UTF-8 Mode <utf8-mode>` to change the default text encoding to UTF-8. You can enable the :ref:`Python UTF-8 Mode <utf8-mode>` via the ``-X utf8`` command line option, or the ``PYTHONUTF8=1`` environment variable. See :envvar:`PYTHONUTF8` for enabling UTF-8 mode, and :ref:`setting-envvars` for how to modify environment variables.
uk: Ви можете використати режим :ref:`Python UTF-8 Mode <utf8-mode>`, щоб змінити стандартне кодування тексту на UTF-8. Ви можете ввімкнути :ref:`Режим Python UTF-8 <utf8-mode>` за допомогою параметра командного рядка ``-X utf8`` або змінної середовища ``PYTHONUTF8=1``. Перегляньте :envvar:`PYTHONUTF8`, щоб увімкнути режим UTF-8, і :ref:`setting-envvars`, щоб дізнатися, як змінити змінні середовища.

source: When the :ref:`Python UTF-8 Mode <utf8-mode>` is enabled, you can still use the system encoding (the ANSI Code Page) via the "mbcs" codec.
uk: Коли режим :ref:`Python UTF-8 Mode <utf8-mode>` увімкнено, ви все ще можете використовувати системне кодування (кодову сторінку ANSI) через кодек "mbcs".

source: Note that adding ``PYTHONUTF8=1`` to the default environment variables will affect all Python 3.7+ applications on your system. If you have any Python 3.7+ applications which rely on the legacy system encoding, it is recommended to set the environment variable temporarily or use the ``-X utf8`` command line option.
uk: Зауважте, що додавання ``PYTHONUTF8=1`` до змінних середовища за замовчуванням вплине на всі програми Python 3.7+ у вашій системі. Якщо у вас є будь-які програми Python 3.7+, які покладаються на застаріле системне кодування, рекомендується тимчасово встановити змінну середовища або скористатися параметром командного рядка ``-X utf8``.

source: Even when UTF-8 mode is disabled, Python uses UTF-8 by default on Windows for:
uk: Навіть якщо режим UTF-8 вимкнено, Python за замовчуванням використовує UTF-8 у Windows для:

source: Console I/O including standard I/O (see :pep:`528` for details).
uk: Консольний ввід-вивід, включаючи стандартний ввід-вивід (подробиці див. :pep:`528`).

source: The :term:`filesystem encoding <filesystem encoding and error handler>` (see :pep:`529` for details).
uk: :term:`кодування файлової системи <filesystem encoding and error handler>` (докладніше див. :pep:`529`).

source: Python Launcher for Windows
uk: Python Launcher для Windows

source: The Python launcher for Windows is a utility which aids in locating and executing of different Python versions. It allows scripts (or the command-line) to indicate a preference for a specific Python version, and will locate and execute that version.
uk: Засіб запуску Python для Windows — це утиліта, яка допомагає знаходити та запускати різні версії Python. Це дозволяє сценаріям (або командному рядку) вказувати перевагу для певної версії Python, а також знаходити та виконувати цю версію.

source: Unlike the :envvar:`PATH` variable, the launcher will correctly select the most appropriate version of Python. It will prefer per-user installations over system-wide ones, and orders by language version rather than using the most recently installed version.
uk: На відміну від змінної :envvar:`PATH`, програма запуску правильно вибере найбільш відповідну версію Python. Він віддасть перевагу інсталяціям для кожного користувача, а не загальносистемним, і впорядковуватиметься за мовною версією, а не з використанням останньої встановленої версії.

source: The launcher was originally specified in :pep:`397`.
uk: Засіб запуску спочатку було зазначено в :pep:`397`.

source: Getting started
uk: Починаємо
