Repository: seanpm2001/python-docs-uk
Catalog: using/windows.po
Languages: uk

source: From the command-line
uk: З командного рядка

source: System-wide installations of Python 3.3 and later will put the launcher on your :envvar:`PATH`. The launcher is compatible with all available versions of Python, so it does not matter which version is installed. To check that the launcher is available, execute the following command in Command Prompt::
uk: Загальносистемні інсталяції Python 3.3 і пізнішої версії розмістять засіб запуску на вашому :envvar:`PATH`. Панель запуску сумісна з усіма доступними версіями Python, тому не має значення, яка версія встановлена. Щоб перевірити, чи доступна програма запуску, виконайте таку команду в командному рядку:

source: You should find that the latest version of Python you have installed is started - it can be exited as normal, and any additional command-line arguments specified will be sent directly to Python.
uk: Ви повинні виявити, що запущено найновішу встановлену вами версію Python — її можна вийти як зазвичай, і будь-які додаткові вказані аргументи командного рядка будуть надіслані безпосередньо в Python.

source: If you have multiple versions of Python installed (e.g., 3.7 and |version|) you will have noticed that Python |version| was started - to launch Python 3.7, try the command::
uk: Якщо у вас встановлено кілька версій Python (наприклад, 3.7 і |version|), ви помітили, що Python |version| було запущено - щоб запустити Python 3.7, спробуйте команду::

source: If you want the latest version of Python 2 you have installed, try the command::
uk: Якщо вам потрібна остання встановлена версія Python 2, спробуйте команду::

source: You should find the latest version of Python 3.x starts.
uk: Ви повинні знайти останню версію Python 3.x.

source: If you see the following error, you do not have the launcher installed::
uk: Якщо ви бачите таку помилку, у вас не встановлено програму запуску:

source: Per-user installations of Python do not add the launcher to :envvar:`PATH` unless the option was selected on installation.
uk: При інсталяції Python для кожного користувача програма запуску не додається до :envvar:`PATH`, якщо цей параметр не було вибрано під час інсталяції.

source: The command::
uk: Команда::

source: displays the currently installed version(s) of Python.
uk: відображає поточну встановлену версію (версії) Python.

source: Virtual environments
uk: Віртуальні середовища

source: If the launcher is run with no explicit Python version specification, and a virtual environment (created with the standard library :mod:`venv` module or the external ``virtualenv`` tool) active, the launcher will run the virtual environment's interpreter rather than the global one. To run the global interpreter, either deactivate the virtual environment, or explicitly specify the global Python version.
uk: Якщо програму запуску запускають без явної специфікації версії Python і активне віртуальне середовище (створене за допомогою модуля стандартної бібліотеки :mod:`venv` або зовнішнього інструменту ``virtualenv``), програма запуску швидше запустить інтерпретатор віртуального середовища ніж глобальна. Щоб запустити глобальний інтерпретатор, деактивуйте віртуальне середовище або явно вкажіть глобальну версію Python.

source: From a script
uk: Зі сценарію

source: Let's create a test Python script - create a file called ``hello.py`` with the following contents
uk: Давайте створимо тестовий сценарій Python - створіть файл під назвою ``hello.py`` з таким вмістом

source: From the directory in which hello.py lives, execute the command::
uk: З каталогу, в якому знаходиться hello.py, виконайте команду::

source: You should notice the version number of your latest Python 2.x installation is printed. Now try changing the first line to be:
uk: Слід помітити, що надруковано номер версії вашої останньої інсталяції Python 2.x. Тепер спробуйте змінити перший рядок на:

source: Re-executing the command should now print the latest Python 3.x information. As with the above command-line examples, you can specify a more explicit version qualifier. Assuming you have Python 3.7 installed, try changing the first line to ``#! python3.7`` and you should find the |version| version information printed.
uk: Повторне виконання команди має надрукувати останню інформацію Python 3.x. Як і у наведених вище прикладах командного рядка, ви можете вказати більш явний кваліфікатор версії. Якщо у вас встановлено Python 3.7, спробуйте змінити перший рядок на ``#! python3.7`` і ви повинні знайти |version| інформація про версію надрукована.

source: Note that unlike interactive use, a bare "python" will use the latest version of Python 2.x that you have installed. This is for backward compatibility and for compatibility with Unix, where the command ``python`` typically refers to Python 2.
uk: Зауважте, що на відміну від інтерактивного використання, голий "python" використовуватиме останню версію Python 2.x, яку ви встановили. Це для зворотної сумісності та сумісності з Unix, де команда ``python`` зазвичай відноситься до Python 2.

source: From file associations
uk: З асоціацій файлів

source: The launcher should have been associated with Python files (i.e. ``.py``, ``.pyw``, ``.pyc`` files) when it was installed. This means that when you double-click on one of these files from Windows explorer the launcher will be used, and therefore you can use the same facilities described above to have the script specify the version which should be used.
uk: Під час інсталяції програма запуску мала бути пов’язана з файлами Python (тобто файлами ``.py``, ``.pyw``, ``.pyc``). Це означає, що коли ви двічі клацаєте один із цих файлів у провіднику Windows, буде використано програму запуску, і тому ви можете використовувати ті самі засоби, які описані вище, щоб сценарій вказав версію, яку слід використовувати.

source: The key benefit of this is that a single launcher can support multiple Python versions at the same time depending on the contents of the first line.
uk: Основною перевагою цього є те, що одна програма запуску може підтримувати кілька версій Python одночасно залежно від вмісту першого рядка.

source: Shebang Lines
uk: Лінії Shebang

source: If the first line of a script file starts with ``#!``, it is known as a "shebang" line. Linux and other Unix like operating systems have native support for such lines and they are commonly used on such systems to indicate how a script should be executed. This launcher allows the same facilities to be used with Python scripts on Windows and the examples above demonstrate their use.
uk: Якщо перший рядок файлу сценарію починається з ``#!``, він відомий як рядок "shebang". Linux та інші Unix-подібні операційні системи мають власну підтримку таких рядків, і вони зазвичай використовуються в таких системах, щоб вказати, як повинен виконуватися сценарій. Цей засіб запуску дозволяє використовувати ті самі можливості зі сценаріями Python у Windows, і наведені вище приклади демонструють їх використання.

source: To allow shebang lines in Python scripts to be portable between Unix and Windows, this launcher supports a number of 'virtual' commands to specify which interpreter to use. The supported virtual commands are:
uk: Щоб дозволити перенесення рядків shebang у сценаріях Python між Unix і Windows, цей засіб запуску підтримує низку "віртуальних" команд, щоб вказати, який інтерпретатор використовувати. Підтримувані віртуальні команди:

source: For example, if the first line of your script starts with
uk: Наприклад, якщо перший рядок вашого сценарію починається з

source: The default Python will be located and used. As many Python scripts written to work on Unix will already have this line, you should find these scripts can be used by the launcher without modification. If you are writing a new script on Windows which you hope will be useful on Unix, you should use one of the shebang lines starting with ``/usr``.
uk: Буде знайдено та використано стандартний Python. Оскільки багато сценаріїв Python, написаних для роботи в Unix, уже мають цей рядок, ви повинні переконатися, що ці сценарії можуть використовуватися програмою запуску без змін. Якщо ви пишете новий сценарій у Windows, який, як сподіваєтеся, буде корисним у Unix, вам слід використовувати один із рядків shebang, що починається з ``/usr``.

source: Any of the above virtual commands can be suffixed with an explicit version (either just the major version, or the major and minor version). Furthermore the 32-bit version can be requested by adding "-32" after the minor version. I.e. ``/usr/bin/python3.7-32`` will request usage of the 32-bit python 3.7.
uk: До будь-якої з наведених вище віртуальних команд можна додати явну версію (або лише основну версію, або основну та допоміжну версії). Крім того, можна запитати 32-розрядну версію, додавши "-32" після другорядної версії. тобто ``/usr/bin/python3.7-32`` вимагатиме використання 32-розрядної версії python 3.7.

source: Beginning with python launcher 3.7 it is possible to request 64-bit version by the "-64" suffix. Furthermore it is possible to specify a major and architecture without minor (i.e. ``/usr/bin/python3-64``).
uk: Починаючи з python launcher 3.7, можна запитувати 64-розрядну версію за допомогою суфікса "-64". Крім того, можна вказати основну та архітектуру без другорядної (тобто ``/usr/bin/python3-64``).

source: Arguments in shebang lines
uk: Аргументи в рядках shebang

source: The shebang lines can also specify additional options to be passed to the Python interpreter. For example, if you have a shebang line:
uk: Рядки shebang також можуть вказувати додаткові параметри, які передаються інтерпретатору Python. Наприклад, якщо у вас є лінія шибенг:

source: Then Python will be started with the ``-v`` option
uk: Тоді Python буде запущено з опцією ``-v``

source: Customization
uk: Налаштування

source: Customization via INI files
uk: Налаштування за допомогою файлів INI

source: Two .ini files will be searched by the launcher - ``py.ini`` in the current user's "application data" directory (i.e. the directory returned by calling the Windows function ``SHGetFolderPath`` with ``CSIDL_LOCAL_APPDATA``) and ``py.ini`` in the same directory as the launcher. The same .ini files are used for both the 'console' version of the launcher (i.e. py.exe) and for the 'windows' version (i.e. pyw.exe).
uk: Засіб запуску шукатиме два файли .ini — ``py.ini`` у каталозі "даних програми" поточного користувача (тобто в каталозі, який повертається викликом функції Windows ``SHGetFolderPath`` з ``CSIDL_LOCAL_APPDATA``) і ``py.ini`` у тому ж каталозі, що й програма запуску. Ті самі файли .ini використовуються як для "консольної" версії програми запуску (тобто py.exe), так і для версії "windows" (тобто pyw.exe).

source: Customization specified in the "application directory" will have precedence over the one next to the executable, so a user, who may not have write access to the .ini file next to the launcher, can override commands in that global .ini file.
uk: Налаштування, указані в "каталозі програми", матимуть перевагу над налаштуваннями поруч із виконуваним файлом, тому користувач, який може не мати права запису до файлу .ini поруч із засобом запуску, може замінити команди в цьому глобальному файлі .ini.

source: Customizing default Python versions
uk: Налаштування версій Python за замовчуванням

source: In some cases, a version qualifier can be included in a command to dictate which version of Python will be used by the command. A version qualifier starts with a major version number and can optionally be followed by a period ('.') and a minor version specifier. Furthermore it is possible to specify if a 32 or 64 bit implementation shall be requested by adding "-32" or "-64".
uk: У деяких випадках у команду можна включити кваліфікатор версії, щоб вказати, яку версію Python використовуватиме команда. Специфікатор версії починається з основного номера версії та за бажанням може супроводжуватися крапкою ('.') і другорядним специфікатором версії. Крім того, можна вказати, чи потрібно запитувати 32- або 64-бітну реалізацію, додавши "-32" або "-64".

source: For example, a shebang line of ``#!python`` has no version qualifier, while ``#!python3`` has a version qualifier which specifies only a major version.
uk: Наприклад, рядок shebang ``#!python`` не має кваліфікатора версії, тоді як ``#!python3`` має кваліфікатор версії, який визначає лише основну версію.

source: If no version qualifiers are found in a command, the environment variable :envvar:`PY_PYTHON` can be set to specify the default version qualifier. If it is not set, the default is "3". The variable can specify any value that may be passed on the command line, such as "3", "3.7", "3.7-32" or "3.7-64". (Note that the "-64" option is only available with the launcher included with Python 3.7 or newer.)
uk: Якщо в команді не знайдено кваліфікаторів версії, змінну середовища :envvar:`PY_PYTHON` можна встановити для визначення кваліфікатора версії за замовчуванням. Якщо його не встановлено, за замовчуванням буде "3". Змінна може вказувати будь-яке значення, яке можна передати в командному рядку, наприклад "3", "3.7", "3.7-32" або "3.7-64". (Зауважте, що параметр "-64" доступний лише з програмою запуску, яка входить до складу Python 3.7 або новішої версії.)

source: If no minor version qualifiers are found, the environment variable ``PY_PYTHON{major}`` (where ``{major}`` is the current major version qualifier as determined above) can be set to specify the full version. If no such option is found, the launcher will enumerate the installed Python versions and use the latest minor release found for the major version, which is likely, although not guaranteed, to be the most recently installed version in that family.
uk: Якщо кваліфікаторів другорядної версії не знайдено, змінну середовища ``PY_PYTHON{major}`` (де ``{major}`` є поточним кваліфікатором основної версії, як визначено вище) можна встановити для визначення повної версії. Якщо такий параметр не знайдено, програма запуску перерахує встановлені версії Python і використає останній другорядний випуск, знайдений для основної версії, який, імовірно, хоча й не гарантовано, буде останньою встановленою версією в цьому сімействі.

source: On 64-bit Windows with both 32-bit and 64-bit implementations of the same (major.minor) Python version installed, the 64-bit version will always be preferred. This will be true for both 32-bit and 64-bit implementations of the launcher - a 32-bit launcher will prefer to execute a 64-bit Python installation of the specified version if available. This is so the behavior of the launcher can be predicted knowing only what versions are installed on the PC and without regard to the order in which they were installed (i.e., without knowing whether a 32 or 64-bit version of Python and corresponding launcher was installed last). As noted above, an optional "-32" or "-64" suffix can be used on a version specifier to change this behaviour.
uk: У 64-розрядній Windows з інстальованою 32-розрядною та 64-розрядною реалізаціями однієї (major.minor) версії Python 64-розрядна версія завжди матиме перевагу. Це буде вірно як для 32-розрядної, так і для 64-розрядної реалізації програми запуску - 32-розрядна програма запуску віддасть перевагу виконанню 64-розрядної інсталяції Python зазначеної версії, якщо вона доступна. Тому можна передбачити поведінку програми запуску, знаючи лише те, які версії встановлено на ПК, і незалежно від порядку їх інсталяції (тобто не знаючи, 32- чи 64-бітну версію Python і відповідну програму запуску було встановлено). встановлено останнім). Як зазначалося вище, необов’язковий суфікс "-32" або "-64" можна використовувати у специфікаторі версії, щоб змінити цю поведінку.

source: Examples:
uk: приклади:

source: If no relevant options are set, the commands ``python`` and ``python2`` will use the latest Python 2.x version installed and the command ``python3`` will use the latest Python 3.x installed.
uk: Якщо відповідні параметри не встановлено, команди ``python`` і ``python2`` використовуватимуть останню встановлену версію Python 2.x, а команда ``python3`` використовуватиме останню встановлену версію Python 3.x.

source: The command ``python3.7`` will not consult any options at all as the versions are fully specified.
uk: Команда ``python3.7`` взагалі не перевірятиме жодних параметрів, оскільки версії вказано повністю.

source: If ``PY_PYTHON=3``, the commands ``python`` and ``python3`` will both use the latest installed Python 3 version.
uk: Якщо ``PY_PYTHON=3``, обидві команди ``python`` і ``python3`` використовуватимуть останню встановлену версію Python 3.

source: If ``PY_PYTHON=3.7-32``, the command ``python`` will use the 32-bit implementation of 3.7 whereas the command ``python3`` will use the latest installed Python (PY_PYTHON was not considered at all as a major version was specified.)
uk: Якщо ``PY_PYTHON=3.7-32``, команда ``python`` використовуватиме 32-розрядну реалізацію 3.7, тоді як команда ``python3`` використовуватиме останній встановлений Python (PY_PYTHON взагалі не розглядався як була вказана основна версія.)

source: If ``PY_PYTHON=3`` and ``PY_PYTHON3=3.7``, the commands ``python`` and ``python3`` will both use specifically 3.7
uk: Якщо ``PY_PYTHON=3`` і ``PY_PYTHON3=3.7``, обидві команди ``python`` і ``python3`` використовуватимуть саме 3.7

source: In addition to environment variables, the same settings can be configured in the .INI file used by the launcher. The section in the INI file is called ``[defaults]`` and the key name will be the same as the environment variables without the leading ``PY_`` prefix (and note that the key names in the INI file are case insensitive.) The contents of an environment variable will override things specified in the INI file.
uk: Окрім змінних середовища, ті самі параметри можна налаштувати у файлі .INI, який використовується програмою запуску. Розділ у файлі INI називається ``[defaults]``, і назва ключа буде такою ж, як і змінні середовища, без початкового префікса ``PY_`` (і зауважте, що назви ключа у файлі INI нечутливі до регістру .) Вміст змінної середовища перевизначає речі, вказані у файлі INI.

source: For example:
uk: Наприклад:

source: Setting ``PY_PYTHON=3.7`` is equivalent to the INI file containing:
uk: Параметр ``PY_PYTHON=3.7`` еквівалентний файлу INI, який містить:

source: Setting ``PY_PYTHON=3`` and ``PY_PYTHON3=3.7`` is equivalent to the INI file containing:
uk: Параметри ``PY_PYTHON=3`` і ``PY_PYTHON3=3.7`` еквівалентні файлу INI, який містить:

source: Diagnostics
uk: діагностика

source: Value
uk: Значення

source: Finding modules
uk: Пошук модулів

source: When no ``._pth`` file is found, this is how :data:`sys.path` is populated on Windows:
uk: Якщо файл ``._pth`` не знайдено, :data:`sys.path` заповнюється у Windows таким чином:

source: An empty entry is added at the start, which corresponds to the current directory.
uk: На початку додається порожній запис, який відповідає поточному каталогу.

source: If the environment variable :envvar:`PYTHONPATH` exists, as described in :ref:`using-on-envvars`, its entries are added next. Note that on Windows, paths in this variable must be separated by semicolons, to distinguish them from the colon used in drive identifiers (``C:\`` etc.).
uk: Якщо змінна середовища :envvar:`PYTHONPATH` існує, як описано в :ref:`using-on-envvars`, її записи додаються наступними. Зауважте, що в Windows шляхи в цій змінній мають бути розділені крапкою з комою, щоб відрізнити їх від двокрапки, яка використовується в ідентифікаторах дисків (``C:\`` тощо).

source: Additional "application paths" can be added in the registry as subkeys of :samp:`\\SOFTWARE\\Python\\PythonCore\\{version}\\PythonPath` under both the ``HKEY_CURRENT_USER`` and ``HKEY_LOCAL_MACHINE`` hives. Subkeys which have semicolon-delimited path strings as their default value will cause each path to be added to :data:`sys.path`. (Note that all known installers only use HKLM, so HKCU is typically empty.)
uk: Додаткові "шляхи до програм" можна додати до реєстру як підрозділи :samp:`\\SOFTWARE\\Python\\PythonCore\\{version}\\PythonPath` як у ``HKEY_CURRENT_USER``, так і в ``HKEY_LOCAL_MACHINE`` вулики. Підключі, які мають рядки шляху, розділені крапкою з комою як значення за замовчуванням, спричинять додавання кожного шляху до :data:`sys.path`. (Зверніть увагу, що всі відомі інсталятори використовують лише HKLM, тому HKCU зазвичай порожній.)

source: If the environment variable :envvar:`PYTHONHOME` is set, it is assumed as "Python Home". Otherwise, the path of the main Python executable is used to locate a "landmark file" (either ``Lib\os.py`` or ``pythonXY.zip``) to deduce the "Python Home". If a Python home is found, the relevant sub-directories added to :data:`sys.path` (``Lib``, ``plat-win``, etc) are based on that folder. Otherwise, the core Python path is constructed from the PythonPath stored in the registry.
uk: Якщо встановлено змінну середовища :envvar:`PYTHONHOME`, вона вважається "Python Home". В іншому випадку шлях основного виконуваного файлу Python використовується для пошуку "файлу орієнтира" (або ``Lib\os.py``, або ``pythonXY.zip``), щоб вивести "Домашню сторінку Python". Якщо домашню сторінку Python знайдено, відповідні підкаталоги, додані до :data:`sys.path` (``Lib``, ``plat-win`` тощо), базуються на цій папці. В іншому випадку основний шлях Python створюється з PythonPath, що зберігається в реєстрі.

source: If the Python Home cannot be located, no :envvar:`PYTHONPATH` is specified in the environment, and no registry entries can be found, a default path with relative entries is used (e.g. ``.\Lib;.\plat-win``, etc).
uk: Якщо не вдається знайти домашню сторінку Python, у середовищі не вказано :envvar:`PYTHONPATH` і не можна знайти записи реєстру, використовується шлях за замовчуванням із відносними записами (наприклад, ``.\Lib;.\plat-win`` тощо).

source: If a ``pyvenv.cfg`` file is found alongside the main executable or in the directory one level above the executable, the following variations apply:
uk: Якщо файл ``pyvenv.cfg`` знайдено поряд з основним виконуваним файлом або в каталозі на один рівень вище виконуваного файлу, застосовуються такі варіанти:

source: If ``home`` is an absolute path and :envvar:`PYTHONHOME` is not set, this path is used instead of the path to the main executable when deducing the home location.
uk: Якщо ``home`` є абсолютним шляхом і :envvar:`PYTHONHOME` не встановлено, цей шлях використовується замість шляху до основного виконуваного файлу під час визначення домашнього розташування.

source: The end result of all this is:
uk: Кінцевим результатом всього цього є:

source: When running :file:`python.exe`, or any other .exe in the main Python directory (either an installed version, or directly from the PCbuild directory), the core path is deduced, and the core paths in the registry are ignored. Other "application paths" in the registry are always read.
uk: Під час запуску :file:`python.exe` або будь-якого іншого .exe в головному каталозі Python (у встановленій версії або безпосередньо з каталогу PCbuild) виводиться основний шлях, а основні шляхи в реєстрі ігноруються . Інші "шляхи програми" в реєстрі завжди читаються.

source: When Python is hosted in another .exe (different directory, embedded via COM, etc), the "Python Home" will not be deduced, so the core path from the registry is used. Other "application paths" in the registry are always read.
uk: Коли Python розміщено в іншому .exe (іншому каталозі, вбудованому через COM тощо), "Домашня сторінка Python" не буде виведена, тому використовується основний шлях із реєстру. Інші "шляхи програми" в реєстрі завжди читаються.
