Repository: seanpm2001/python-docs-uk
Catalog: c-api/frame.po
Languages: uk

source: Frame Objects
uk: Рамкові об’єкти

source: The C structure of the objects used to describe frame objects.
uk: Структура C об’єктів, яка використовується для опису об’єктів кадру.

source: There are no public members in this structure.
uk: У цій структурі немає громадських учасників.

source: The members of this structure were removed from the public C API. Refer to the :ref:`What's New entry <pyframeobject-3.11-hiding>` for details.
uk: Членів цієї структури було видалено з загальнодоступного C API. Зверніться до запису :ref:`Що нового <pyframeobject-3.11-hiding>`, щоб дізнатися більше.

source: The :c:func:`PyEval_GetFrame` and :c:func:`PyThreadState_GetFrame` functions can be used to get a frame object.
uk: Функції :c:func:`PyEval_GetFrame` і :c:func:`PyThreadState_GetFrame` можна використовувати для отримання об’єкта фрейму.

source: See also :ref:`Reflection <reflection>`.
uk: Дивіться також :ref:`Reflection <reflection>`.

source: Get the *frame* next outer frame.
uk: Отримайте *рамку* наступну зовнішню рамку.

source: Return a :term:`strong reference`, or ``NULL`` if *frame* has no outer frame.
uk: Повертає :term:`strong reference` або ``NULL``, якщо *frame* не має зовнішнього кадру.

source: Get the *frame*'s ``f_builtins`` attribute.
uk: Отримайте атрибут ``f_builtins`` *frame*.

source: Return a :term:`strong reference`. The result cannot be ``NULL``.
uk: Повертає :term:`strong reference`. Результат не може бути ``NULL``.

source: Get the *frame* code.
uk: Отримайте код *frame*.

source: Return a :term:`strong reference`.
uk: Повертає :term:`strong reference`.

source: The result (frame code) cannot be ``NULL``.
uk: Результат (код кадру) не може бути ``NULL``.

source: Get the generator, coroutine, or async generator that owns this frame, or ``NULL`` if this frame is not owned by a generator. Does not raise an exception, even if the return value is ``NULL``.
uk: Отримайте генератор, співпрограму або асинхронний генератор, якому належить цей кадр, або ``NULL``, якщо цей кадр не належить генератору. Не створює винятку, навіть якщо повертається значення ``NULL``.

source: Return a :term:`strong reference`, or ``NULL``.
uk: Повертає :term:`strong reference` або ``NULL``.

source: Get the *frame*'s ``f_globals`` attribute.
uk: Отримайте атрибут ``f_globals`` *frame*.

source: Get the *frame*'s ``f_lasti`` attribute.
uk: Отримайте атрибут ``f_lasti`` *frame*.

source: Returns -1 if ``frame.f_lasti`` is ``None``.
uk: Повертає -1, якщо ``frame.f_lasti`` має значення ``None``.

source: Get the *frame*'s ``f_locals`` attribute (:class:`dict`).
uk: Отримайте атрибут ``f_locals`` *frame* (:class:`dict`).

source: Return the line number that *frame* is currently executing.
uk: Повертає номер рядка, який *frame* зараз виконує.
