Repository: seanpm2001/python-docs-uk
Catalog: c-api/function.po
Languages: uk

source: Function Objects
uk: Функціональні об’єкти

source: There are a few functions specific to Python functions.
uk: Є кілька функцій, специфічних для функцій Python.

source: The C structure used for functions.
uk: Структура C, яка використовується для функцій.

source: This is an instance of :c:type:`PyTypeObject` and represents the Python function type. It is exposed to Python programmers as ``types.FunctionType``.
uk: Це екземпляр :c:type:`PyTypeObject` і представляє тип функції Python. Він надається програмістам Python як ``types.FunctionType``.

source: Return true if *o* is a function object (has type :c:data:`PyFunction_Type`). The parameter must not be ``NULL``. This function always succeeds.
uk: Повертає true, якщо *o* є об’єктом функції (має тип :c:data:`PyFunction_Type`). Параметр не має бути ``NULL``. Ця функція завжди успішна.

source: Return a new function object associated with the code object *code*. *globals* must be a dictionary with the global variables accessible to the function.
uk: Повертає новий об’єкт функції, пов’язаний з об’єктом коду *code*. *globals* має бути словником із глобальними змінними, доступними для функції.

source: Return the code object associated with the function object *op*.
uk: Повертає об’єкт коду, пов’язаний з об’єктом функції *op*.

source: Return the globals dictionary associated with the function object *op*.
uk: Повертає словник globals, пов’язаний з об’єктом функції *op*.

source: Return a :term:`borrowed reference` to the *__module__* attribute of the function object *op*. It can be *NULL*.
uk: Повертає :term:`borrowed reference` на атрибут *__module__* об’єкта функції *op*. Це може бути *NULL*.

source: This is normally a string containing the module name, but can be set to any other object by Python code.
uk: Зазвичай це рядок, що містить назву модуля, але кодом Python можна встановити будь-який інший об’єкт.

source: Return the argument default values of the function object *op*. This can be a tuple of arguments or ``NULL``.
uk: Повертає стандартні значення аргументу об’єкта функції *op*. Це може бути кортеж аргументів або ``NULL``.

source: Set the argument default values for the function object *op*. *defaults* must be ``Py_None`` or a tuple.
uk: Установіть значення аргументу за замовчуванням для об’єкта функції *op*. *за замовчуванням* має бути ``Py_None`` або кортеж.

source: Raises :exc:`SystemError` and returns ``-1`` on failure.
uk: Викликає :exc:`SystemError` і повертає ``-1`` у разі помилки.

source: Return the closure associated with the function object *op*. This can be ``NULL`` or a tuple of cell objects.
uk: Повертає закриття, пов’язане з об’єктом функції *op*. Це може бути ``NULL`` або кортеж об’єктів клітинки.

source: Set the closure associated with the function object *op*. *closure* must be ``Py_None`` or a tuple of cell objects.
uk: Установіть закриття, пов’язане з функціональним об’єктом *op*. *закриття* має бути ``Py_None`` або кортеж об’єктів клітинки.

source: Return the annotations of the function object *op*. This can be a mutable dictionary or ``NULL``.
uk: Повертає анотації об’єкта функції *op*. Це може бути змінний словник або ``NULL``.

source: Set the annotations for the function object *op*. *annotations* must be a dictionary or ``Py_None``.
uk: Встановіть анотації для об’єкта функції *op*. *анотації* мають бути словником або ``Py_None``.
